const e = {
  "sheets-outline-ui": {
    cancel: "انصراف",
    group: "گروه‌بندی",
    ungroup: "لغو گروه‌بندی",
    groupRows: "گروه‌بندی ردیف‌های {0} - {1}",
    groupColumns: "گروه‌بندی ستون‌های {0} - {1}",
    ungroupRows: "لغو گروه‌بندی ردیف‌های {0} - {1}",
    ungroupColumns: "لغو گروه‌بندی ستون‌های {0} - {1}",
    error: {
      permission: "شما مجوز مشاهده ندارید، بنابراین عملیات مربوط به گروه‌بندی قابل انجام نیست.",
      invalidRange: "به دلیل نامعتبر بودن محدوده انتخاب‌شده، نمی‌توان طرح کلی ایجاد کرد.",
      outOfBounds: "به دلیل خارج بودن محدوده انتخاب‌شده از شیت، نمی‌توان طرح کلی ایجاد کرد.",
      crossing: "نمی‌توان\x20طرح\x20کلی\x20را\x20به‌روزرسانی\x20کرد،\x20زیرا\x20نتیجه\x20باعث\x20ایجاد\x20گروه‌های\x20هم‌پوشان\x20می‌شود.",
      maxDepth: "نمی‌توان طرح کلی ایجاد کرد، زیرا طرح‌های سازگار با Excel حداکثر تا ۸ سطح را پشتیبانی می‌کنند.",
      moveSplitsOutline: "نمی‌توان\x20ردیف‌ها\x20یا\x20ستون‌ها\x20را\x20جابه‌جا\x20کرد،\x20زیرا\x20این\x20کار\x20یک\x20طرح\x20کلی\x20موجود\x20را\x20جدا\x20می‌کند.\x20ابتدا\x20طرح\x20کلی\x20مرتبط\x20را\x20حذف\x20کنید.",
      clearRangeNotContainOutline: "نمی‌توان گروه‌بندی را لغو کرد، زیرا محدوده انتخاب‌شده به‌طور کامل محدوده گروه طرح کلی را در بر نمی‌گیرد.",
      unknown: "نمی‌توان طرح کلی را به‌روزرسانی کرد، زیرا عملیات نامعتبر است."
    }
  }
};
module.exports = e;
