const e = {
  "collaboration-client": {
    collabClient: { tooltip: { reconnect: "انقر لإعادة الاتصال" } },
    collabStatus: {
      fetchMiss: "جارٍ مزامنة بيانات الخادم...",
      conflict: "تعارضات في التحرير",
      notCollab: "ملف محلي",
      synced: "تمت المزامنة",
      syncing: "جارٍ المزامنة...",
      offline: "غير متصل، سيتم حفظ التحريرات محلياً",
    },
    session: {
      "connection-failed": "فشل الاتصال. يرجى التحقق من شبكتك.",
      "will-retry": "فشل الاتصال. سنحاول مرة أخرى بعد قليل.",
      "room-full":
        "وصل المستند إلى حد التعاون الأقصى. سيتم تخزين تحريراتك محلياً.",
      "join-failed":
        "فشل الانضمام للتعاون. يرجى المحاولة لاحقاً. سيتم تخزين تحريراتك محلياً.",
      "room-not-exists": "فشل الانضمام للتعاون. سيتم تخزين تحريراتك محلياً.",
      "room-permission-denied":
        "لا\x20يوجد\x20إذن\x20للتعاون.\x20سيتم\x20تخزين\x20تحريراتك\x20محلياً.",
      "room-cnt-exceeds":
        "عدد المستندات التعاونية يتجاوز الحد. سيتم تخزين تحريراتك محلياً.",
      "collaboration-timeout":
        "الخادم\x20لا\x20يستجيب\x20لطلب\x20التعاون.\x20سيتم\x20حفظ\x20تحريراتك\x20محلياً.",
    },
    conflict: {
      title: "تعارض\x20في\x20التعاون",
      content:
        "يوجد تعارض بين نسختك المحلية والنسخة على الخادم. يرجى حفظ تحريراتك المحلية، لأنها ستُفقد عند إعادة تحميل الصفحة.",
    },
    permission: {
      title: "خطأ\x20في\x20المصادقة",
      content:
        "تتعارض إجراءاتك مع أذونات الخادم. يرجى حفظ تحريراتك المحلية في مكان آخر حيث سيتم تجاهلها بعد تحديث الصفحة.",
    },
    collaboration: {
      "single-unit": {
        warning:
          "لقد فتحت نفس الملف في علامة تبويب أخرى. في حالة فقدان البيانات، لا يمكنك التحرير في هذه العلامة.",
      },
      closeRoom:
        "تم\x20إلغاء\x20امتيازات\x20التحرير\x20لأنه\x20تم\x20إغلاق\x20غرفة\x20التعاون.",
    },
    auth: {
      needGotoLoginAlert:
        'انتهت صلاحية تسجيل الدخول، انقر "موافق" لإعادة تسجيل الدخول، أو انقر "إلغاء" لحفظ تحريراتك محلياً.',
    },
  },
};
module.exports = e;
