const e = {
  "collaboration-client": {
    collabClient: {
      tooltip: { reconnect: "برای\x20اتصال\x20مجدد\x20کلیک\x20کنید" },
    },
    collabStatus: {
      fetchMiss: "در حال همگام سازی داده های سرور...",
      conflict: "تداخل\x20ویرایش",
      notCollab: "پرونده\x20محلی",
      synced: "همگام\x20سازی",
      syncing: "در حال همگام سازی...",
      offline: "آفلاین، ویرایش ها در محلی ذخیره می شوند",
    },
    session: {
      "connection-failed": "اتصال ناموفق بود، لطفاً شبکه خود را بررسی کنید.",
      "will-retry":
        "اتصال\x20ناموفق\x20بود،\x20ما\x20بعداً\x20دوباره\x20تلاش\x20می\x20کنیم.",
      "room-full":
        "ظرفیت\x20همکاری\x20در\x20این\x20سند\x20پر\x20شده\x20است.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
      "join-failed":
        "پیوستن\x20به\x20همکاری\x20ناموفق\x20بود.\x20لطفاً\x20بعداً\x20دوباره\x20امتحان\x20کنید.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
      "room-not-exists":
        "پیوستن به همکاری ناموفق بود. ویرایش‌های شما به صورت محلی ذخیره خواهد شد.",
      "room-permission-denied":
        "دسترسی همکاری وجود ندارد. ویرایش‌های شما به صورت محلی ذخیره خواهد شد.",
      "room-cnt-exceeds":
        "تعداد اسناد همکاری از حد مجاز فراتر رفته است. ویرایش‌های شما به صورت محلی ذخیره خواهد شد.",
      "collaboration-timeout":
        "سرور به درخواست همکاری شما پاسخ نمی‌دهد. ویرایش‌های شما به صورت محلی ذخیره خواهد شد.",
    },
    conflict: {
      title: "تداخل همکاری",
      content:
        "یک تداخل بین نسخه محلی شما و نسخه در سرور وجود دارد. لطفاً ویرایش های محلی خود را ذخیره کنید، زیرا آنها پس از بازیابی صفحه از بین خواهند رفت.",
    },
    permission: {
      title: "خطای اعتبارسنجی",
      content:
        "اعمال شما با مجوزهای سرور تداخل دارد. لطفاً ویرایش های محلی خود را در جای دیگر ذخیره کنید زیرا پس از تازه سازی صفحه از بین خواهند رفت.",
    },
    collaboration: {
      "single-unit": {
        warning:
          "شما همان پرونده را در یک تب دیگر باز کرده اید. در صورت عدم وجود داده، نمی توانید در این تب ویرایش کنید.",
      },
      closeRoom: "امتیازات ویرایش به دلیل بسته شدن اتاق همکاری لغو شد.",
    },
    auth: {
      needGotoLoginAlert:
        "ورود\x20شم\x20منقضی\x20شده\x20است،\x20برای\x20ورود\x20مجدد\x20کلیک\x20کنید،\x20برای\x20ذخیره\x20ویرایش\x20های\x20محلی\x20خود\x20کلیک\x20کنید.",
    },
  },
};
module.exports = e;
