const e = {
  "sheets-outline-ui": {
    cancel: "إلغاء",
    group: "تجميع",
    ungroup: "إلغاء التجميع",
    groupRows: "تجميع الصفوف {0} - {1}",
    groupColumns: "تجميع الأعمدة {0} - {1}",
    ungroupRows: "إلغاء تجميع الصفوف {0} - {1}",
    ungroupColumns: "إلغاء تجميع الأعمدة {0} - {1}",
    error: {
      permission:
        "ليس\x20لديك\x20إذن\x20العرض،\x20لذا\x20لا\x20يمكن\x20إجراء\x20عمليات\x20التجميع.",
      invalidRange: "تعذر إنشاء المخطط التفصيلي لأن النطاق المحدد غير صالح.",
      outOfBounds: "تعذر إنشاء المخطط التفصيلي لأن النطاق المحدد خارج الورقة.",
      crossing: "تعذر تحديث المخطط التفصيلي لأن النتيجة ستنشئ مجموعات متداخلة.",
      maxDepth:
        "تعذر إنشاء المخطط التفصيلي لأن المخططات المتوافقة مع Excel تدعم حتى 8 مستويات.",
      moveSplitsOutline:
        "تعذر نقل الصفوف أو الأعمدة لأن ذلك سيقسم المخطط التفصيلي الموجود. قم بإزالة المخطط التفصيلي ذي الصلة أولاً.",
      clearRangeNotContainOutline:
        "تعذر إلغاء التجميع لأن النطاق المحدد لا يحتوي بالكامل على نطاق مجموعة المخطط التفصيلي.",
      unknown:
        "تعذر\x20تحديث\x20المخطط\x20التفصيلي\x20لأن\x20العملية\x20غير\x20صالحة.",
    },
  },
};
export { e as default };
