const e = {
  "sheets-outline-ui": {
    cancel: "انصراف",
    group: "گروه‌بندی",
    ungroup: "لغو گروه‌بندی",
    groupRows: "گروه‌بندی ردیف‌های {0} - {1}",
    groupColumns: "گروه‌بندی ستون‌های {0} - {1}",
    ungroupRows: "لغو گروه‌بندی ردیف‌های {0} - {1}",
    ungroupColumns: "لغو گروه‌بندی ستون‌های {0} - {1}",
    error: {
      permission:
        "شما\x20مجوز\x20مشاهده\x20ندارید،\x20بنابراین\x20عملیات\x20مربوط\x20به\x20گروه‌بندی\x20قابل\x20انجام\x20نیست.",
      invalidRange:
        "به دلیل نامعتبر بودن محدوده انتخاب‌شده، نمی‌توان طرح کلی ایجاد کرد.",
      outOfBounds:
        "به دلیل خارج بودن محدوده انتخاب‌شده از شیت، نمی‌توان طرح کلی ایجاد کرد.",
      crossing:
        "نمی‌توان طرح کلی را به‌روزرسانی کرد، زیرا نتیجه باعث ایجاد گروه‌های هم‌پوشان می‌شود.",
      maxDepth:
        "نمی‌توان طرح کلی ایجاد کرد، زیرا طرح‌های سازگار با Excel حداکثر تا ۸ سطح را پشتیبانی می‌کنند.",
      moveSplitsOutline:
        "نمی‌توان ردیف‌ها یا ستون‌ها را جابه‌جا کرد، زیرا این کار یک طرح کلی موجود را جدا می‌کند. ابتدا طرح کلی مرتبط را حذف کنید.",
      clearRangeNotContainOutline:
        "نمی‌توان گروه‌بندی را لغو کرد، زیرا محدوده انتخاب‌شده به‌طور کامل محدوده گروه طرح کلی را در بر نمی‌گیرد.",
      unknown: "نمی‌توان طرح کلی را به‌روزرسانی کرد، زیرا عملیات نامعتبر است.",
    },
  },
};
export { e as default };
