
//#region src/locale/function-list/array/ar-SA.ts
const locale$15 = {
	ARRAY_CONSTRAIN: {
		description: "يقيّد ناتج صفيف إلى حجم محدد.",
		abstract: "يقيّد ناتج صفيف إلى حجم محدد.",
		links: [{
			title: "التعليمات",
			url: "https://support.google.com/docs/answer/3267036?hl=ar"
		}],
		functionParameter: {
			inputRange: {
				name: "نطاق_الإدخال",
				detail: "النطاق المراد تقييده."
			},
			numRows: {
				name: "عدد_الصفوف",
				detail: "عدد الصفوف التي يجب أن يحتوي عليها الناتج."
			},
			numCols: {
				name: "عدد_الأعمدة",
				detail: "عدد الأعمدة التي يجب أن يحتوي عليها الناتج."
			}
		}
	},
	FLATTEN: {
		description: "يجمع كل القيم من نطاق واحد أو أكثر في عمود واحد.",
		abstract: "يجمع كل القيم من نطاق واحد أو أكثر في عمود واحد.",
		links: [{
			title: "التعليمات",
			url: "https://support.google.com/docs/answer/10307761?hl=ar"
		}],
		functionParameter: {
			range1: {
				name: "النطاق1",
				detail: "النطاق الأول المراد جمعه."
			},
			range2: {
				name: "النطاق2",
				detail: "[اختياري، قابل للتكرار] نطاقات إضافية مراد جمعها."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/compatibility/ar-SA.ts
const locale$14 = {
	BETADIST: {
		description: "تُرجع دالة كثافة احتمال بيتا التراكمية. يتم بشكلٍ عام استخدام توزيع بيتا لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل فترات اليوم التي يقضيها الأشخاص في مشاهدة التلفزيون.",
		abstract: "تُرجع دالة كثافة احتمال بيتا التراكمية. يتم بشكلٍ عام استخدام توزيع بيتا لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل فترات اليوم التي يقضيها الأشخاص في مشاهدة التلفزيون.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/betadist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة بين A وB التي يتم تقييم الدالة عندها."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			A: {
				name: "A",
				detail: "وهي حد أدنى للفاصل الزمني x."
			},
			B: {
				name: "B",
				detail: "اختياري. وهي حد أعلى للفاصل الزمني x."
			}
		}
	},
	BETAINV: {
		description: "تُرجع عكس دالة كثافة احتمال بيتا التراكمية لتوزيع بيتا معين. أي إذا كانت probability = BETADIST(x,...)‎، فعندئذٍ تكون BETAINV(probability,...) = x. يمكن استخدام توزيع بيتا في تخطيط المشاريع لتخطيط مواعيد الانتهاء المحتملة عند تعيين الوقت المتوقع للإنهاء وقابلية التغيير.",
		abstract: "تُرجع عكس دالة كثافة احتمال بيتا التراكمية لتوزيع بيتا معين. أي إذا كانت probability = BETADIST(x,...)‎، فعندئذٍ تكون BETAINV(probability,...) = x. يمكن استخدام توزيع بيتا في تخطيط المشاريع لتخطيط مواعيد الانتهاء المحتملة عند تعيين الوقت المتوقع للإنهاء وقابلية التغيير.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/betainv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. وهي الاحتمال المقترن بتوزيع بيتا."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			A: {
				name: "A",
				detail: "وهي حد أدنى للفاصل الزمني x."
			},
			B: {
				name: "B",
				detail: "اختياري. وهي حد أعلى للفاصل الزمني x."
			}
		}
	},
	BINOMDIST: {
		description: "تُرجع المصطلح الفردي لاحتمال التوزيع ذي الحدين. استخدم BINOMDIST في المشاكل ذات العدد الثابت من الاختبارات أو التجارب، عندما تكون نتائج أي تجربة هي نجاح أو فشل فقط، وعندما تكون التجارب مستقلة، وعندما يكون احتمال النجاح ثابتاً في كافة مراحل التجربة. على سبيل المثال، بإمكان BINOMDIST حساب احتمال أن يكون اثنان من المواليد الثلاثة القادمين من الذكور.",
		abstract: "تُرجع المصطلح الفردي لاحتمال التوزيع ذي الحدين. استخدم BINOMDIST في المشاكل ذات العدد الثابت من الاختبارات أو التجارب، عندما تكون نتائج أي تجربة هي نجاح أو فشل فقط، وعندما تكون التجارب مستقلة، وعندما يكون احتمال النجاح ثابتاً في كافة مراحل التجربة. على سبيل المثال، بإمكان BINOMDIST حساب احتمال أن يكون اثنان من المواليد الثلاثة القادمين من الذكور.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/binomdist-function"
		}],
		functionParameter: {
			numberS: {
				name: "number_s",
				detail: "مطلوب. وهي عدد مرات النجاح في التجارب."
			},
			trials: {
				name: "trials",
				detail: "مطلوب. وهي عدد التجارب المستقلة."
			},
			probabilityS: {
				name: "probability_s",
				detail: "مطلوب. وهي احتمال النجاح في كل تجربة."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. وهي القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة cumulative تساوي TRUE، فإن BINOMDIST تُرجع دالة التوزيع التراكمي، وهي الاحتمال بوجود number_s لعدد مرات النجاح على الأكثر، وإذا كانت تساوي FALSE، فإنها تُرجع دالة الاحتمالات غير التراكمية، وهي الاحتمال بوجود number_s لعدد مرات النجاح بالضبط."
			}
		}
	},
	CHIDIST: {
		description: "تُرجع الاحتمال ذا الطرف الأيمن لتوزيع كاي التربيعي. يقترن توزيع χ2 باختبار χ2. استخدم اختبار χ2 لمقارنة القيم التي تمت ملاحظتها بالقيم المتوقعة. على سبيل المثال، قد تفترض إحدى التجارب الجينية أن الجيل التالي من النباتات سيحمل مجموعة معينة من الألوان. يمكنك تحديد ما إذا كانت فرضيتك الأصلية صحيحة من خلال مقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة.",
		abstract: "تُرجع الاحتمال ذا الطرف الأيمن لتوزيع كاي التربيعي. يقترن توزيع χ2 باختبار χ2. استخدم اختبار χ2 لمقارنة القيم التي تمت ملاحظتها بالقيم المتوقعة. على سبيل المثال، قد تفترض إحدى التجارب الجينية أن الجيل التالي من النباتات سيحمل مجموعة معينة من الألوان. يمكنك تحديد ما إذا كانت فرضيتك الأصلية صحيحة من خلال مقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chidist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة التي تريد تقييم التوزيع عندها."
			},
			degFreedom: {
				name: "deg_freedom",
				detail: "مطلوب. وهي عدد درجات الحرية."
			}
		}
	},
	CHIINV: {
		description: "تُرجع عكس الاحتمال ذي الطرف الأيمن لتوزيع كاي التربيعي. إذا كانت probability = CHIDIST(x,...)‎، فعندئذٍ تكون CHIINV(probability,...) = x. استخدم هذه الدالة لمقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة لتحديد ما إذا كانت فرضيتك الأصلية صحيحة.",
		abstract: "تُرجع عكس الاحتمال ذي الطرف الأيمن لتوزيع كاي التربيعي. إذا كانت probability = CHIDIST(x,...)‎، فعندئذٍ تكون CHIINV(probability,...) = x. استخدم هذه الدالة لمقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة لتحديد ما إذا كانت فرضيتك الأصلية صحيحة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chiinv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. وهي احتمال مقترن بتوزيع كاي تربيع."
			},
			degFreedom: {
				name: "deg_freedom",
				detail: "مطلوب. وهي عدد درجات الحرية."
			}
		}
	},
	CHITEST: {
		description: "تُرجع اختبار الاستقلال. تُرجع CHITEST القيمة من توزيع كاي تربيع (χ2) للإحصاء ودرجات الحرية المناسبة. ويمكنك استخدام اختبارات χ2 لتحديد ما إذا تم التحقق من صحة النتائج المفترضة بواسطة تجربة.",
		abstract: "تُرجع اختبار الاستقلال. تُرجع CHITEST القيمة من توزيع كاي تربيع (χ2) للإحصاء ودرجات الحرية المناسبة. ويمكنك استخدام اختبارات χ2 لتحديد ما إذا تم التحقق من صحة النتائج المفترضة بواسطة تجربة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chitest-function"
		}],
		functionParameter: {
			actualRange: {
				name: "actual_range",
				detail: "مطلوب. وهي نطاق البيانات الذي يحتوي على الملاحظات التي تريد اختبارها مقابل القيم المتوقعة."
			},
			expectedRange: {
				name: "expected_range",
				detail: "مطلوب. وهي نطاق البيانات الذي يحتوي على نسبة حاصل ضرب إجماليات الصفوف وإجماليات الأعمدة إلى الإجمالي الكلي."
			}
		}
	},
	CONFIDENCE: {
		description: "تُرجع فاصل الثقة لوسط محتوى باستخدام توزيع عادي.",
		abstract: "تُرجع فاصل الثقة لوسط محتوى باستخدام توزيع عادي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/confidence-function"
		}],
		functionParameter: {
			alpha: {
				name: "alpha",
				detail: "مطلوب. مستوى الدلالة المُستخدم لحساب مستوى الثقة. يساوي مستوى الثقة ‎100*(1 - alpha)%‎، أو بعبارة أخرى، تشير alpha ذات القيمة 0,05 إلى مستوى ثقة بنسبة 95 في المئة."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري للمحتوى الخاص بنطاق البيانات والذي من المفترض أن يكون معروفاً."
			},
			size: {
				name: "size",
				detail: "مطلوب. حجم العينة."
			}
		}
	},
	COVAR: {
		description: "إرجاع التباين المشترك، متوسط منتجات الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات.",
		abstract: "إرجاع التباين المشترك، متوسط منتجات الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/covar-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. تمثل هذه الوسيطة نطاق الخلايا الأول من الأعداد الصحيحة."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. تمثل هذه الوسيطة نطاق الخلايا الثاني من الأعداد الصحيحة."
			}
		}
	},
	CRITBINOM: {
		description: "تُرجع أصغر قيمة يكون التوزيع التراكمي ذو الحدين الخاص بها أكبر من قيمة المعيار أو مساوياً لها. استخدم هذه الدالة مع تطبيقات تأكيد الجودة. على سبيل المثال، استخدم CRITBINOM لتحديد أكبر عدد من الأجزاء التالفة المسموح بفصلها عن خط تجميع من دون رفض الكمية بأكملها.",
		abstract: "تُرجع أصغر قيمة يكون التوزيع التراكمي ذو الحدين الخاص بها أكبر من قيمة المعيار أو مساوياً لها. استخدم هذه الدالة مع تطبيقات تأكيد الجودة. على سبيل المثال، استخدم CRITBINOM لتحديد أكبر عدد من الأجزاء التالفة المسموح بفصلها عن خط تجميع من دون رفض الكمية بأكملها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/critbinom-function"
		}],
		functionParameter: {
			trials: {
				name: "trials",
				detail: "مطلوب. وهي عدد تجارب Bernoulli."
			},
			probabilityS: {
				name: "probability_s",
				detail: "مطلوب. وهي احتمال النجاح في كل تجربة."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. وهي قيمة المعيار."
			}
		}
	},
	EXPONDIST: {
		description: "تُرجع التوزيع الأسي. استخدم الدالة EXPONDIST لتنظيم الوقت بين الأحداث، مثل الوقت الذي يحتاجه صرّاف المصرف الآلي لتسليم النقود. على سبيل المثال، يمكنك استخدام EXPONDIST لتحديد احتمال أن تستغرق العملية دقيقة واحدة كحد أقصى.",
		abstract: "تُرجع التوزيع الأسي. استخدم الدالة EXPONDIST لتنظيم الوقت بين الأحداث، مثل الوقت الذي يحتاجه صرّاف المصرف الآلي لتسليم النقود. على سبيل المثال، يمكنك استخدام EXPONDIST لتحديد احتمال أن تستغرق العملية دقيقة واحدة كحد أقصى.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/expondist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. قيمة الدالة."
			},
			lambda: {
				name: "lambda",
				detail: "مطلوب. قيمة المعلمة."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. قيمة منطقية تشير إلى تركيبة الدالة الأسية التي سيتم توفيرها. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع EXPONDIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال."
			}
		}
	},
	FDIST: {
		description: "تُرجع توزيع الاحتمال F (ذي الطرف الأيمن) (درجة الاختلاف) لمجموعتين من البيانات. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك معاينة نقاط الاختبار التي حصل عليها شبّان وشابات في امتحان دخول مدرسة ثانوية وتحديد ما إذا كان الفرق بين نقاط الإناث مختلفاً عن الفرق بين نقاط الذكور.",
		abstract: "تُرجع توزيع الاحتمال F (ذي الطرف الأيمن) (درجة الاختلاف) لمجموعتين من البيانات. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك معاينة نقاط الاختبار التي حصل عليها شبّان وشابات في امتحان دخول مدرسة ثانوية وتحديد ما إذا كان الفرق بين نقاط الإناث مختلفاً عن الفرق بين نقاط الذكور.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/fdist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			degFreedom1: {
				name: "deg_freedom1",
				detail: "مطلوب. بسط درجات الحرية."
			},
			degFreedom2: {
				name: "deg_freedom2",
				detail: "مطلوب. مقام درجات الحرية."
			}
		}
	},
	FINV: {
		description: "تُرجع هذه الدالة عكس توزيع الاحتمال F (ذي الطرف الأيمن). إذا كانت p = FDIST(x,...)‎، فتكون عندئذِ FINV(p,...) = x.",
		abstract: "تُرجع هذه الدالة عكس توزيع الاحتمال F (ذي الطرف الأيمن). إذا كانت p = FDIST(x,...)‎، فتكون عندئذِ FINV(p,...) = x.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/finv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. احتمال مقترن بتوزيع F التراكمي."
			},
			degFreedom1: {
				name: "deg_freedom1",
				detail: "مطلوب. بسط درجات الحرية."
			},
			degFreedom2: {
				name: "deg_freedom2",
				detail: "مطلوب. مقام درجات الحرية."
			}
		}
	},
	FTEST: {
		description: "إرجاع نتيجة اختبار F. يقوم اختبار F بإرجاع الاحتمال ثنائي الطرف أن التباينات في array1 و array2 ليست مختلفة بشكل كبير. استخدم هذه الدالة لتحديد وجود تباينات مختلفة بين نموذجين. على سبيل المثال، بالاستناد إلى نقاط اختبار من مدرستين رسمية وخاصة، يمكنك اختبار ما إذا كانت مستويات التباين في نقاط الاختبار مختلفة بين هاتين المدرستين.",
		abstract: "إرجاع نتيجة اختبار F. يقوم اختبار F بإرجاع الاحتمال ثنائي الطرف أن التباينات في array1 و array2 ليست مختلفة بشكل كبير. استخدم هذه الدالة لتحديد وجود تباينات مختلفة بين نموذجين. على سبيل المثال، بالاستناد إلى نقاط اختبار من مدرستين رسمية وخاصة، يمكنك اختبار ما إذا كانت مستويات التباين في نقاط الاختبار مختلفة بين هاتين المدرستين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ftest-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. الصفيف أو نطاق البيانات الأول."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. الصفيف أو نطاق البيانات الثاني."
			}
		}
	},
	GAMMADIST: {
		description: "تُرجع توزيع غاما. يمكنك استخدام هذه الدالة لدراسة المتغيرات التي قد تكون ذات توزيع منحرف. يُستخدم توزيع غاما بشكل شائع في تحليل الصفوف.",
		abstract: "تُرجع توزيع غاما. يمكنك استخدام هذه الدالة لدراسة المتغيرات التي قد تكون ذات توزيع منحرف. يُستخدم توزيع غاما بشكل شائع في تحليل الصفوف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gammadist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة التي تريد تقييم التوزيع عندها."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. معلمة للتوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. معلمة للتوزيع. إذا كانت beta = 1، فتُرجع الدالة GAMMADIST توزيع غاما القياسي."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد تركيبة الدالة. إذا تم تقييم Cumulative على أنها TRUE، فتُرجع الدالة GAMMADIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال."
			}
		}
	},
	GAMMAINV: {
		description: "تُرجع عكس توزيع غاما التراكمي. إذا كانت قيمة p = GAMMADIST(x,...)‎، فتكون عندئذٍ GAMMAINV(p,...) = x. يمكنك استخدام هذه الدالة لدراسة متغير قد يكون توزيعه منحرفاً.",
		abstract: "تُرجع عكس توزيع غاما التراكمي. إذا كانت قيمة p = GAMMADIST(x,...)‎، فتكون عندئذٍ GAMMAINV(p,...) = x. يمكنك استخدام هذه الدالة لدراسة متغير قد يكون توزيعه منحرفاً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gammainv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المقترن بتوزيع غاما."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. معلمة للتوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. معلمة للتوزيع. إذا كانت beta = 1، فتُرجع GAMMAINV توزيع غاما القياسي."
			}
		}
	},
	HYPGEOMDIST: {
		description: "تُرجع هذه الدالة توزيع الهندسة الفوقية. تُرجع الدالة HYPGEOMDIST احتمال عدد معين لمرات النجاح في العينة، بالنسبة إلى حجم العينة ومرات النجاح في المحتوى وحجم المحتوى. استخدم HYPGEOMDIST لحل المشاكل التي تتعلق بمحتوى محدود، حيث تكون كل عملية مراقبة عبارة عن نجاح أو فشل، وحيث يتم اختيار كل مجموعة فرعية ذات حجم معيّن باحتمالية متساوية.",
		abstract: "تُرجع هذه الدالة توزيع الهندسة الفوقية. تُرجع الدالة HYPGEOMDIST احتمال عدد معين لمرات النجاح في العينة، بالنسبة إلى حجم العينة ومرات النجاح في المحتوى وحجم المحتوى. استخدم HYPGEOMDIST لحل المشاكل التي تتعلق بمحتوى محدود، حيث تكون كل عملية مراقبة عبارة عن نجاح أو فشل، وحيث يتم اختيار كل مجموعة فرعية ذات حجم معيّن باحتمالية متساوية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hypgeomdist-function"
		}],
		functionParameter: {
			sampleS: {
				name: "sample_s",
				detail: "مطلوب. عدد مرات النجاح في العينة."
			},
			numberSample: {
				name: "number_sample",
				detail: "مطلوب. حجم العينة."
			},
			populationS: {
				name: "population_s",
				detail: "مطلوب. عدد مرات النجاح في المحتوى."
			},
			numberPop: {
				name: "number_pop",
				detail: "مطلوب. حجم المحتوى."
			}
		}
	},
	LOGINV: {
		description: "تُرجع هذه الدالة عكس دالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع ln(x)‎ بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. إذا كانت قيمة p = LOGNORMDIST(x,...)‎، فتكون عندئذٍ قيمة LOGINV(p) = x.",
		abstract: "تُرجع هذه الدالة عكس دالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع ln(x)‎ بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. إذا كانت قيمة p = LOGNORMDIST(x,...)‎، فتكون عندئذٍ قيمة LOGINV(p) = x.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/loginv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المقترن بالتوزيع اللوغاريتمي الطبيعي."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. وسط (ln(x."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري لـ (ln(x."
			}
		}
	},
	LOGNORMDIST: {
		description: "تُرجع هذه الدالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع (ln(x بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. استخدم هذه الدالة لتحليل البيانات التي تم تحويلها لوغاريتمياً.",
		abstract: "تُرجع هذه الدالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع (ln(x بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. استخدم هذه الدالة لتحليل البيانات التي تم تحويلها لوغاريتمياً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/lognormdist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. وسط (ln(x."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري لـ (ln(x."
			}
		}
	},
	MODE: {
		description: "لنفترض أنك تريد معرفة عدد أنواع الطيور الأكثر شيوعًا الذي تم رصده في عينة لعدد الطيور في أرض رطبة متدهورة على مدى فترة زمنية قدرها 30 عامًا، أو تريد معرفة عدد المكالمات الهاتفية الأكثر شيوعًا في مركز دعم عبر الهاتف خارج ساعات الذروة. لحساب وضع مجموعة من الأرقام، استخدم الدالة MODE .",
		abstract: "لنفترض أنك تريد معرفة عدد أنواع الطيور الأكثر شيوعًا الذي تم رصده في عينة لعدد الطيور في أرض رطبة متدهورة على مدى فترة زمنية قدرها 30 عامًا، أو تريد معرفة عدد المكالمات الهاتفية الأكثر شيوعًا في مركز دعم عبر الهاتف خارج ساعات الذروة. لحساب وضع مجموعة من الأرقام، استخدم الدالة MODE .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mode-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول الذي تريد حساب الوضع الخاص به."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 255 التي تريد حساب الوضع الخاص بها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	NEGBINOMDIST: {
		description: "تُرجع هذه الدالة التوزيع السالب ذا الحدين. تُرجع الدالة NEGBINOMDIST احتمال وجود مرات فشل عددها number_f قبل النجاح رقم number_s، عندما يكون الاحتمال الثابت للنجاح probability_s. تشبه هذه الدالة التوزيع ذا الحدين، باستثناء أن عدد النجاحات ثابت وعدد التجارب متغير. من المفترض أن تكون التجارب مستقلة، مثل التوزيع ذي الحدين.",
		abstract: "تُرجع هذه الدالة التوزيع السالب ذا الحدين. تُرجع الدالة NEGBINOMDIST احتمال وجود مرات فشل عددها number_f قبل النجاح رقم number_s، عندما يكون الاحتمال الثابت للنجاح probability_s. تشبه هذه الدالة التوزيع ذا الحدين، باستثناء أن عدد النجاحات ثابت وعدد التجارب متغير. من المفترض أن تكون التجارب مستقلة، مثل التوزيع ذي الحدين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/negbinomdist-function"
		}],
		functionParameter: {
			numberF: {
				name: "number_f",
				detail: "مطلوب. عدد مرات الفشل."
			},
			numberS: {
				name: "number_s",
				detail: "مطلوب. عتبة محاولات النجاح."
			},
			probabilityS: {
				name: "probability_s",
				detail: "مطلوب. احتمال النجاح."
			}
		}
	},
	NORMDIST: {
		description: "ترجع الدالة NORMDIST التوزيع العادي للمتوسط المحدد والانحراف المعياري. تحتوي هذه الدالة على مجموعة واسعة من التطبيقات في الإحصائيات، بما في ذلك اختبار الفرضية.",
		abstract: "ترجع الدالة NORMDIST التوزيع العادي للمتوسط المحدد والانحراف المعياري. تحتوي هذه الدالة على مجموعة واسعة من التطبيقات في الإحصائيات، بما في ذلك اختبار الفرضية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/normdist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي تريد التوزيع لها"
			},
			mean: {
				name: "mean",
				detail: "مطلوب. الوسط الحسابي للتوزيع"
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري للتوزيع"
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت القيمة التراكمية TRUE، فترجع الدالة NORMDIST دالة التوزيع التراكمي؛ إذا كانت القيمة التراكمية FALSE، فإنها ترجع دالة الاحتمالات الجماعية."
			}
		}
	},
	NORMINV: {
		description: "تُرجع هذه الدالة عكس التوزيع التراكمي العادي للوسط والانحراف المعياري المحددين.",
		abstract: "تُرجع هذه الدالة عكس التوزيع التراكمي العادي للوسط والانحراف المعياري المحددين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/norminv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المطابق للتوزيع العادي."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. الوسط الحسابي للتوزيع."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. وهي الانحراف المعياري للتوزيع."
			}
		}
	},
	NORMSDIST: {
		description: "تُرجع هذه الدالة دالة التوزيع التراكمي العادي القياسي. يحتوي التوزيع على وسط من 0 (صفر) وانحراف معياري من واحد. استخدم هذه الدالة بدلاً من جدول مناطق المنحنيات العادية القياسية.",
		abstract: "تُرجع هذه الدالة دالة التوزيع التراكمي العادي القياسي. يحتوي التوزيع على وسط من 0 (صفر) وانحراف معياري من واحد. استخدم هذه الدالة بدلاً من جدول مناطق المنحنيات العادية القياسية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/normsdist-function"
		}],
		functionParameter: { z: {
			name: "z",
			detail: "مطلوبة. القيمة التي تريد حساب التوزيع لها."
		} }
	},
	NORMSINV: {
		description: "تُرجع هذه الدالة عكس التوزيع التراكمي القياسي العادي. يحتوي التوزيع على وسط من صفر وانحراف معياري من واحد.",
		abstract: "تُرجع هذه الدالة عكس التوزيع التراكمي القياسي العادي. يحتوي التوزيع على وسط من صفر وانحراف معياري من واحد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/normsinv-function"
		}],
		functionParameter: { probability: {
			name: "probability",
			detail: "مطلوب. الاحتمال المطابق للتوزيع العادي."
		} }
	},
	PERCENTILE: {
		description: "تُرجع هذه الدالة النسب المئوية للقيم في نطاق. ويمكنك استخدام هذه الدالة لتأسيس عتبة القبول. على سبيل المثال، يمكنك أن تتخذ قراراً باختبار المرشحين الذين سجلوا مجموع نقاط أعلى من القيمة المئوية 90.",
		abstract: "تُرجع هذه الدالة النسب المئوية للقيم في نطاق. ويمكنك استخدام هذه الدالة لتأسيس عتبة القبول. على سبيل المثال، يمكنك أن تتخذ قراراً باختبار المرشحين الذين سجلوا مجموع نقاط أعلى من القيمة المئوية 90.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/percentile-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق البيانات الذي يعرِّف حالات النسبية."
			},
			k: {
				name: "k",
				detail: "مطلوبة. القيمة المئوية في النطاق من 0 إلى 1، ضمناً."
			}
		}
	},
	PERCENTRANK: {
		description: "ترجع الدالة PERCENTRANK مرتبة قيمة في مجموعة بيانات كنسبة مئوية من مجموعة البيانات - بشكل أساسي، المركز النسبي للقيمة داخل مجموعة البيانات بأكملها. على سبيل المثال، يمكنك استخدام PERCENTRANK لتحديد مكانة درجة اختبار الفرد بين حقل جميع الدرجات لنفس الاختبار.",
		abstract: "ترجع الدالة PERCENTRANK مرتبة قيمة في مجموعة بيانات كنسبة مئوية من مجموعة البيانات - بشكل أساسي، المركز النسبي للقيمة داخل مجموعة البيانات بأكملها. على سبيل المثال، يمكنك استخدام PERCENTRANK لتحديد مكانة درجة اختبار الفرد بين حقل جميع الدرجات لنفس الاختبار.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/percentrank-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. نطاق البيانات (أو الصفيف المحدد مسبقا) للقيم الرقمية التي يتم فيها تحديد ترتيب النسبة المئوية."
			},
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي تريد معرفة الرتبة ضمن الصفيف لها."
			},
			significance: {
				name: "significance",
				detail: "الاختياري. قيمة تعرّف عدد الأرقام ذات الأهمية لقيمة النسبة المئوية التي تم إرجاعها. في حالة حذف هذه الوسيطة، تستخدم الدالة PERCENTRANK ثلاثة أرقام (0‎.xxx)."
			}
		}
	},
	POISSON: {
		description: "تُرجع هذه الدالة توزيع Poisson. يُعتبر التنبؤ بعدد الأحداث خلال فترة زمنية محددة أحد التطبيقات الشائعة لتوزيع Poisson، كالتنبؤ بعدد السيارات التي تصل إلى ساحة تفرض رسم مرور خلال دقيقة واحدة مثلاً.",
		abstract: "تُرجع هذه الدالة توزيع Poisson. يُعتبر التنبؤ بعدد الأحداث خلال فترة زمنية محددة أحد التطبيقات الشائعة لتوزيع Poisson، كالتنبؤ بعدد السيارات التي تصل إلى ساحة تفرض رسم مرور خلال دقيقة واحدة مثلاً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/poisson-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. عدد الأحداث."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. القيمة الرقمية المتوقعة."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد نموذج توزيع الاحتمال الذي يتم إرجاعه. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع الدالة POISSON احتمال Poisson التراكمي بأن يكون عدد الأحداث العشوائية التي تحصل ما بين الصفر وx ضمناً؛ وإذا كانت قيمتها FALSE، فتُرجع دالة Poisson للاحتمالات غير التراكمية بأن يكون عدد الأحداث التي تحصل مساوياً لـ x تماماً."
			}
		}
	},
	QUARTILE: {
		description: "تُرجع هذه الدالة ربع مجموعة بيانات. غالباً ما يتم استخدام الأرباع في المبيعات وبيانات الاستطلاعات لتقسيم السكان إلى مجموعات. على سبيل المثال، يمكنك استخدام QUARTILE للبحث عن 25 في المئة من السكان من ذوي نسبة الدخل الأعلى.",
		abstract: "تُرجع هذه الدالة ربع مجموعة بيانات. غالباً ما يتم استخدام الأرباع في المبيعات وبيانات الاستطلاعات لتقسيم السكان إلى مجموعات. على سبيل المثال، يمكنك استخدام QUARTILE للبحث عن 25 في المئة من السكان من ذوي نسبة الدخل الأعلى.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/quartile-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق خلايا القيم الرقمية الذي تريد حساب قيمته الربعية."
			},
			quart: {
				name: "quart",
				detail: "مطلوب. تشير إلى القيمة التي يجب إرجاعها."
			}
		}
	},
	RANK: {
		description: "تُرجع هذه الدالة مرتبة رقم في قائمة من الأرقام. تمثّل مرتبة الرقم حجمه بالنسبة إلى أحجام القيم الأخرى في القائمة. (إذا كنت تريد فرز القائمة، ستكون مرتبة الرقم موضعه في القائمة.)",
		abstract: "تُرجع هذه الدالة مرتبة رقم في قائمة من الأرقام. تمثّل مرتبة الرقم حجمه بالنسبة إلى أحجام القيم الأخرى في القائمة. (إذا كنت تريد فرز القائمة، ستكون مرتبة الرقم موضعه في القائمة.)",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rank-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوب. الرقم الذي تريد العثور على مرتبته."
			},
			ref: {
				name: "ref",
				detail: "مطلوب. مرجع إلى قائمة الأرقام. يتم تجاهل القيم غير الرقمية في المرجع."
			},
			order: {
				name: "order",
				detail: "الاختياري. رقم يحدد كيفية ترتيب الرقم. إذا كان الترتيب يساوي 0 (صفر) أو إذا كان محذوفاً، يحدد Microsoft Excel مرتبة الرقم كما لو كان المرجع عبارة عن قائمة تم فرزها بترتيب تنازلي. إذا كان الترتيب عبارة عن قيمة غير صفرية، يحدد Microsoft Excel مرتبة الرقم كما لو كان المرجع عبارة عن قائمة تم فرزها بترتيب تصاعدي."
			}
		}
	},
	STDEV: {
		description: "تقدّر هذه الدالة الانحراف المعياري استناداً إلى عينة. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		abstract: "تقدّر هذه الدالة الانحراف المعياري استناداً إلى عينة. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/stdev-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق عينة من المحتوى."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق عينة من المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	STDEVP: {
		description: "تحسب هذه الدالة الانحراف المعياري استناداً إلى المحتوى بأكمله المحدد كوسيطات. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		abstract: "تحسب هذه الدالة الانحراف المعياري استناداً إلى المحتوى بأكمله المحدد كوسيطات. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/stdevp-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق المحتوى."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	TDIST: {
		description: "تُرجع هذه الدالة نقاط النسبة المئوية (الاحتمال) لتوزيع t للطلاب حيث تكون القيمة الرقمية (x) القيمة المحسوبة لـ t التي يجب حساب نقاط النسبة المئوية لها. يتم استخدام توزيع t في الاختبار الفرضي لنماذج صغيرة من مجموعات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.",
		abstract: "تُرجع هذه الدالة نقاط النسبة المئوية (الاحتمال) لتوزيع t للطلاب حيث تكون القيمة الرقمية (x) القيمة المحسوبة لـ t التي يجب حساب نقاط النسبة المئوية لها. يتم استخدام توزيع t في الاختبار الفرضي لنماذج صغيرة من مجموعات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tdist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة الرقمية التي يتم تقييم التوزيع عندها."
			},
			degFreedom: {
				name: "degFreedom",
				detail: "مطلوب. عدد صحيح يشير إلى عدد درجات الحرية."
			},
			tails: {
				name: "tails",
				detail: "مطلوب. تحدد هذه الوسيطة عدد أطراف التوزيع التي يتم إرجاعها. إذا كانت قيمة الأطراف = 1، تُرجع الدالة TDIST التوزيع أحادي الطرف. إذا كانت قيمة الأطراف = 2، تُرجع الدالة TDIST التوزيع ثنائي الطرف."
			}
		}
	},
	TINV: {
		description: "إرجاع عكس توزيع t للطالب ثنائي الطرف.",
		abstract: "إرجاع عكس توزيع t للطالب ثنائي الطرف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tinv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المقترن بتوزيع t للطالب ثنائي الطرف."
			},
			degFreedom: {
				name: "degFreedom",
				detail: "مطلوب. عدد درجات الحرية التي تميز التوزيع."
			}
		}
	},
	TTEST: {
		description: "تُرجع هذه الدالة الاحتمال المقترن باختبار t للطالب. استخدم TTEST لتحديد ما إذا كان من المحتمل وجود عينتين من محتويين مماثلين أساسيين لهما الوسط نفسه.",
		abstract: "تُرجع هذه الدالة الاحتمال المقترن باختبار t للطالب. استخدم TTEST لتحديد ما إذا كان من المحتمل وجود عينتين من محتويين مماثلين أساسيين لهما الوسط نفسه.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ttest-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. مجموعة البيانات الأولى."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. مجموعة البيانات الثانية."
			},
			tails: {
				name: "tails",
				detail: "مطلوب. تحدد هذه الوسيطة عدد أطراف التوزيع. إذا كانت قيمة الأطراف = 1، تستخدم الدالة TTEST التوزيع وحيد الطرف. إذا كانت قيمة الأطراف = 2، تستخدم الدالة TTEST التوزيع وحيد الطرف."
			},
			type: {
				name: "type",
				detail: "مطلوب. نوع اختبار t الذي يجب تأديته."
			}
		}
	},
	VAR: {
		description: "تقوم هذه الدالة بتقدير التباين استناداً إلى عينة.",
		abstract: "تقوم هذه الدالة بتقدير التباين استناداً إلى عينة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/var-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق عينة من المحتوى."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق عينة من المحتوى."
			}
		}
	},
	VARP: {
		description: "تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله.",
		abstract: "تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/varp-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق المحتوى."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق المحتوى."
			}
		}
	},
	WEIBULL: {
		description: "تُرجع هذه الدالة توزيع Weibull. استخدم هذا التوزيع في تحليل ثبات النظام، كحساب متوسط وقت حدوث فشل في أحد الأجهزة.",
		abstract: "تُرجع هذه الدالة توزيع Weibull. استخدم هذا التوزيع في تحليل ثبات النظام، كحساب متوسط وقت حدوث فشل في أحد الأجهزة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/weibull-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. معلمة للتوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. معلمة للتوزيع."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. تحدد هذه الوسيطة شكل الدالة."
			}
		}
	},
	ZTEST: {
		description: "تُرجع هذه الدالة قيمة الاحتمال وحيدة الطرف لاختبار z. من خلال تعيين الوسط المفترض للمحتوى ?0، تقوم ZTEST بإرجاع احتمال أن يكون الوسط النموذجي أكبر من متوسط الملاحظات في مجموعة البيانات (الصفيف)، أي الوسط النموذجي الذي تمت ملاحظته.",
		abstract: "تُرجع هذه الدالة قيمة الاحتمال وحيدة الطرف لاختبار z. من خلال تعيين الوسط المفترض للمحتوى ?0، تقوم ZTEST بإرجاع احتمال أن يكون الوسط النموذجي أكبر من متوسط الملاحظات في مجموعة البيانات (الصفيف)، أي الوسط النموذجي الذي تمت ملاحظته.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ztest-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق البيانات لاختبار x بالمقابلة معه."
			},
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يجب اختبارها."
			},
			sigma: {
				name: "sigma",
				detail: "الاختياري. الانحراف المعياري للمحتوى (معروف). في حالة حذفها، يتم استخدام الانحراف المعياري للعينة."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/cube/ar-SA.ts
const locale$13 = {
	CUBEKPIMEMBER: {
		description: "تُرجع خاصية مؤشر الأداء الرئيسي (KPI) وتعرض اسم KPI في الخلية. يعتبر KPI مقياساً كمياً، يحسب مثلاً إجمالي الربح الشهري أو معدل الدوران الربع سنوي للموظفين، ويتم استخدامه لمراقبة أداء المؤسسة.",
		abstract: "تُرجع خاصية مؤشر الأداء الرئيسي (KPI) وتعرض اسم KPI في الخلية. يعتبر KPI مقياساً كمياً، يحسب مثلاً إجمالي الربح الشهري أو معدل الدوران الربع سنوي للموظفين، ويتم استخدامه لمراقبة أداء المؤسسة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cubekpimember-function"
		}],
		functionParameter: {
			connection: {
				name: "اتصال",
				detail: "مطلوب. وهي سلسلة نصية لاسم الاتصال بالمكعب."
			},
			kpiName: {
				name: "Kpi_name",
				detail: "مطلوب. سلسلة نصية لاسم KPI الموجود في المكعب."
			},
			kpiProperty: {
				name: "Kpi_property",
				detail: "مطلوب. وهي مكون KPI الذي يتم إرجاعه ويمكن أن يكون واحداً مما يلي:"
			},
			caption: {
				name: "التسميه التوضيحيه",
				detail: "الاختياري. وهي سلسلة نصية بديلة يتم عرضها في الخلية بدلاً من kpi_name وkpi_property."
			}
		}
	},
	CUBEMEMBER: {
		description: "تُرجع عضواً واحداً أو مجموعة من المكعب. ويمكن استخدامها للتحقق من وجود العضو أو المجموعة في المكعب.",
		abstract: "تُرجع عضواً واحداً أو مجموعة من المكعب. ويمكن استخدامها للتحقق من وجود العضو أو المجموعة في المكعب.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cubemember-function"
		}],
		functionParameter: {
			connection: {
				name: "اتصال",
				detail: "مطلوب. وهي سلسلة نصية لاسم الاتصال بالمكعب."
			},
			memberExpression: {
				name: "Member_expression",
				detail: "مطلوب. وهي سلسلة نصية لتعبير متعدد الأبعاد (MDX) يتم تقييمه إلى عضو فريد في المكعب. بدلاً من ذلك، يمكن أن تكون member_expression عبارة عن مجموعة تم تعيينها كنطاق خلايا أو كثابت صفيف."
			},
			caption: {
				name: "التسميه التوضيحيه",
				detail: "الاختياري. وهي سلسلة نصية يتم عرضها في الخلية بدلاً من التسمية التوضيحية، وذلك إذا تم تعريف إحداها، من المكعب. عند إرجاع إحدى المجموعات، تكون التسمية التوضيحية المُستخدمة هي تلك الخاصة بآخر عضو في المجموعة."
			}
		}
	},
	CUBEMEMBERPROPERTY: {
		description: "ترجع الدالة CUBEMEMBERPROPERTY ، إحدى دالات Cube في Excel، قيمة خاصية عضو من مكعب. ويمكن استخدامها للتحقق من وجود اسم العضو داخل المكعب وإرجاع الخاصية المحددة لهذا العضو.",
		abstract: "ترجع الدالة CUBEMEMBERPROPERTY ، إحدى دالات Cube في Excel، قيمة خاصية عضو من مكعب. ويمكن استخدامها للتحقق من وجود اسم العضو داخل المكعب وإرجاع الخاصية المحددة لهذا العضو.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cubememberproperty-function"
		}],
		functionParameter: {
			connection: {
				name: "اتصال",
				detail: "مطلوب. وهي سلسلة نصية لاسم الاتصال بالمكعب."
			},
			memberExpression: {
				name: "Member_expression",
				detail: "مطلوب. وهي سلسلة نصية لتعبير متعدد الأبعاد (MDX) خاص بأحد الأعضاء داخل المكعب."
			},
			property: {
				name: "الخاصيه",
				detail: "مطلوب. وهي سلسلة نصية لاسم الخاصية التي تم إرجاعها أو مرجع إلى خلية تحتوي على اسم الخاصية."
			}
		}
	},
	CUBERANKEDMEMBER: {
		description: "تُرجع العضو الأعلى أو المُصنف في مجموعة. ويمكن استخدامها لإرجاع عنصر واحد أو أكثر في مجموعة، مثل صاحب أعلى نسبة مبيعات أو أفضل عشرة طلاب.",
		abstract: "تُرجع العضو الأعلى أو المُصنف في مجموعة. ويمكن استخدامها لإرجاع عنصر واحد أو أكثر في مجموعة، مثل صاحب أعلى نسبة مبيعات أو أفضل عشرة طلاب.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cuberankedmember-function"
		}],
		functionParameter: {
			connection: {
				name: "اتصال",
				detail: "مطلوب. وهي سلسلة نصية لاسم الاتصال بالمكعب."
			},
			setExpression: {
				name: "Set_expression",
				detail: "مطلوب. وهي سلسلة نصية لتعبير مجموعة، مثل \"{[العنصر 1].الأطفال}\". يمكن أيضاً أن تكون Set_expression عبارة عن الدالة CUBESET أو مرجع لخلية تحتوي على الدالة CUBESET."
			},
			rank: {
				name: "رتبه",
				detail: "مطلوب. وهي قيمة عدد صحيح يحدد أعلى قيمة يتم إرجاعها. إذا كانت قيمة التصنيف تساوي 1، فإنها تُرجع أعلى قيمة، وإذا كانت قيمة التصنيف تساوي 2، فإنها تُرجع ثاني أعلى قيمة، وما إلى ذلك. لإرجاع أعلى خمس قيم، استخدم الدالة CUBERANKEDMEMBER خمس مرات، مع تحديد تصنيف مختلف، من 1 إلى 5، في كل مرة."
			},
			caption: {
				name: "التسميه التوضيحيه",
				detail: "الاختياري. وهي سلسلة نصية يتم عرضها في الخلية بدلاً من التسمية التوضيحية، وذلك إذا تم تعريف إحداها، من المكعب."
			}
		}
	},
	CUBESET: {
		description: "تعرّف مجموعة محسوبة من قيم أعضاء أو مجموعة عن طريق إرسال تعبير مجموعة إلى المكعب على الخادم، مما يؤدي إلى إنشاء المجموعة، ثم إرجاع تلك المجموعة إلى Microsoft Excel.",
		abstract: "تعرّف مجموعة محسوبة من قيم أعضاء أو مجموعة عن طريق إرسال تعبير مجموعة إلى المكعب على الخادم، مما يؤدي إلى إنشاء المجموعة، ثم إرجاع تلك المجموعة إلى Microsoft Excel.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cubeset-function"
		}],
		functionParameter: {
			connection: {
				name: "اتصال",
				detail: "مطلوب. وهي سلسلة نصية لاسم الاتصال بالمكعب."
			},
			setExpression: {
				name: "Set_expression",
				detail: "مطلوب. وهي سلسلة نصية لتعبير مجموعة ينتج عنها مجموعة أعضاء أو مجموعات قيم. يمكن أيضاً أن تكون Set_expression عبارة عن مرجع خلية لنطاق Excel يحتوي على واحد أو أكثر من الأعضاء أو مجموعات القيم أو المجموعات التي تم تضمينها في المجموعة."
			},
			caption: {
				name: "التسميه التوضيحيه",
				detail: "الاختياري. وهي سلسلة نصية يتم عرضها في الخلية بدلاً من التسمية التوضيحية، وذلك إذا تم تعريف إحداها، من المكعب."
			},
			sortOrder: {
				name: "Sort_order",
				detail: "الاختياري. نوع الفرز الذي تريد تطبيقه، إن وجد، ويمكن أن يكون أياً مما يلي:"
			},
			sortBy: {
				name: "Sort_by",
				detail: "الاختياري. سلسلة نصية للقيمة التي سيتم الفرز بواسطتها. على سبيل المثال، للحصول على المدينة ذات المبيعات الأعلى، قد تكون set_expression مجموعة من المدن، وتكون sort_by هي مقياس المبيعات. أو، للحصول على المدينة ذات عدد السكان الأعلى، قد تكون set_expression مجموعة من المدن، وتكون sort_by هي مقياس عدد السكان. إذا sort_order تطلّب sort_by، وتم حذف sort_by، ترجع CUBESET رسالة الخطأ #VALUE!."
			}
		}
	},
	CUBESETCOUNT: {
		description: "تُرجع عدد العناصر الموجودة في مجموعة.",
		abstract: "تُرجع عدد العناصر الموجودة في مجموعة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cubesetcount-function"
		}],
		functionParameter: { set: {
			name: "تعيين",
			detail: "مطلوب. وهي سلسلة نصية لتعبير Microsoft Excel يتم تقييمه إلى مجموعة معرّفة بواسطة الدالة CUBESET. يمكن أيضاً أن تكون Set عبارة عن الدالة CUBESET أو مرجعاً لخلية تحتوي على الدالة CUBESET."
		} }
	},
	CUBEVALUE: {
		description: "تُرجع قيمة مجمّعة من المكعب.",
		abstract: "تُرجع قيمة مجمّعة من المكعب.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cubevalue-function"
		}],
		functionParameter: {
			connection: {
				name: "اتصال",
				detail: "مطلوب. وهي سلسلة نصية لاسم الاتصال بالمكعب."
			},
			memberExpression: {
				name: "Member_expression",
				detail: "الاختياري. وهي سلسلة نصية لتعبير متعدد الأبعاد (MDX) يتم تقييمه إلى عضو أو مجموعة داخل المكعب. ويمكن أن تكون member_expression بدلاً من ذلك عبارة عن مجموعة تم تعريفها باستخدام الدالة CUBESET. استخدم member_expression كمقسم طريقة عرض لتعريف جزء المكعب الذي يتم إرجاع القيمة المجمّعة له. إذا لم يتم تحديد أي مقياس في member_expression، فيتم استخدام المقياس الافتراضي لهذا المكعب."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/database/ar-SA.ts
const locale$12 = {
	DAVERAGE: {
		description: "تحسب هذه الدالة متوسط القيم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		abstract: "تحسب هذه الدالة متوسط القيم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/daverage-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "هي نطاق الخلايا التي تشكل القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "يشير الحقل إلى العمود المستخدم في الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "هي نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DCOUNT: {
		description: "تقوم هذه الدالة بتعداد الخلايا التي تحتوي على أرقام في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		abstract: "تقوم هذه الدالة بتعداد الخلايا التي تحتوي على أرقام في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dcount-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DCOUNTA: {
		description: "تقوم هذه الدالة بتعداد الخلايا غير الفارغة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		abstract: "تقوم هذه الدالة بتعداد الخلايا غير الفارغة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dcounta-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "الاختياري. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DGET: {
		description: "تستخرج هذه الدالة قيمة مفردة من أحد الأعمدة في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		abstract: "تستخرج هذه الدالة قيمة مفردة من أحد الأعمدة في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dget-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DMAX: {
		description: "تُرجع هذه الدالة أكبر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		abstract: "تُرجع هذه الدالة أكبر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dmax-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DMIN: {
		description: "تُرجع هذه الدالة أصغر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		abstract: "تُرجع هذه الدالة أصغر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dmin-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DPRODUCT: {
		description: "تضرب هذه الدالة القيم الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		abstract: "تضرب هذه الدالة القيم الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dproduct-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DSTDEV: {
		description: "تقدّر هذه الدالة الانحراف المعياري لمحتوى استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		abstract: "تقدّر هذه الدالة الانحراف المعياري لمحتوى استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dstdev-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DSTDEVP: {
		description: "تحسب هذه الدالة الانحراف المعياري لمحتوى استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		abstract: "تحسب هذه الدالة الانحراف المعياري لمحتوى استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dstdevp-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DSUM: {
		description: "في قائمة أو قاعدة بيانات، يوفر DSUM مجموع الأرقام في الحقول (الأعمدة) من السجلات التي تطابق الشروط المحددة.",
		abstract: "في قائمة أو قاعدة بيانات، يوفر DSUM مجموع الأرقام في الحقول (الأعمدة) من السجلات التي تطابق الشروط المحددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dsum-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. هذا هو نطاق الخلايا الذي يشكل القائمة أو قاعدة البيانات. قاعدة البيانات هي قائمة بالبيانات ذات الصلة التي تكون فيها صفوف المعلومات ذات الصلة عبارة عن سجلات ، وأعمدة البيانات هي حقول . يحتوي الصف الأول من القائمة على تسميات لكل عمود فيه."
			},
			field: {
				name: "field",
				detail: "مطلوب. يحدد هذا العمود المستخدم في الدالة. حدد تسمية العمود المضمنة بين علامات الاقتباس المزدوجة، مثل \"العمر\" أو \"العائد\"، على سبيل المثال. بدلا من ذلك، يمكنك تحديد رقم (بدون علامات اقتباس) يمثل موضع العمود داخل القائمة: على سبيل المثال، 1 للعمود الأول، و2 للعمود الثاني، وما إلى ذلك."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. هذا هو نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DVAR: {
		description: "تقدّر هذه الدالة تباين محتوىً استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		abstract: "تقدّر هذه الدالة تباين محتوىً استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dvar-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	},
	DVARP: {
		description: "تحسب هذه الدالة تباين محتوىً استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		abstract: "تحسب هذه الدالة تباين محتوىً استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dvarp-function"
		}],
		functionParameter: {
			database: {
				name: "database",
				detail: "مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود."
			},
			field: {
				name: "field",
				detail: "مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل \"العمر\" أو \"المحصول\"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/date/ar-SA.ts
const locale$11 = {
	DATE: {
		description: "تقوم الدالة DATE بإرجاع الرقم التسلسلي المتتالي الذي يمثل تاريخاً معيناً.",
		abstract: "تقوم الدالة DATE بإرجاع الرقم التسلسلي المتتالي الذي يمثل تاريخاً معيناً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/date-function"
		}],
		functionParameter: {
			year: {
				name: "year",
				detail: "يمكن أن تتكون قيمة الوسيطة year من رقم واحد إلى أربعة أرقام. يفسر Excel الوسيطة year وفق نظام التاريخ الذي يستخدمه جهازك. يستخدم Univer نظام التاريخ 1900 افتراضياً، أي أن التاريخ الأول هو 1 يناير 1900."
			},
			month: {
				name: "month",
				detail: "عدد صحيح موجب أو سالب يمثل شهر السنة من 1 إلى 12 (يناير إلى ديسمبر)."
			},
			day: {
				name: "day",
				detail: "عدد صحيح موجب أو سالب يمثل يوم الشهر من 1 إلى 31."
			}
		}
	},
	DATEDIF: {
		description: "تحسب هذه الدالة عدد الأيام، أو الأشهر أو السنوات بين تاريخين.",
		abstract: "تحسب هذه الدالة عدد الأيام، أو الأشهر أو السنوات بين تاريخين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/datedif-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "تاريخ يمثل التاريخ الأول أو تاريخ البدء لفترة معينة. يمكن إدخال التواريخ كسلاسل نصية داخل علامات اقتباس (مثلاً، \"30/1/2001\")، أو كأرقام تسلسلية (مثلاً، 36921 الذي يمثل 30 يناير 2001، إذا كنت تستخدم نظام تاريخ 1900)، أو كنتائج صيغ أو دالات أخرى (مثلاً، DATEVALUE(\"2001/1/30\")‎)."
			},
			endDate: {
				name: "end_date",
				detail: "تاريخ يمثّل آخر تاريخ، أو تاريخ الانتهاء، في الفترة الزمنية."
			},
			unit: {
				name: "Unit",
				detail: "نوع المعلومات التي تريد إرجاعها، حيث: الوحدة****إرجاع \" Y \"عدد السنوات الكاملة في الفترة.\" M \"عدد الأشهر المكتملة في الفترة.\" D \"عدد الأيام في الفترة.\" MD \"الفرق بين الأيام في start_date end_date. يتم تجاهل الأشهر والسنوات في التواريخ. الهامه: لا نوصي باستخدام الوسيطة \"MD\"، حيث توجد قيود معروفة عليها. راجع قسم المشكلات المعروفة أدناه.\" YM \"الفرق بين الأشهر في start_date end_date. يتم تجاهل أيام وسنوات التواريخ\" YD \"الفرق بين أيام start_date end_date. يتم تجاهل السنوات في التواريخ."
			}
		}
	},
	DATEVALUE: {
		description: "تحول الدالة DATEVALUE التاريخ المخزن كنص إلى رقم تسلسلي يتعرف عليه Excel كتاريخ. على سبيل المثال، تقوم الصيغة ‎ =DATEVALUE(\"1/1/2008\")‎ بإرجاع 39448، وهو الرقم التسلسلي للتاريخ 1/1/2008. تذكر أنه على الرغم من ذلك، فقد يؤدي إعداد تاريخ النظام على الكمبيوتر لديك إلى الحصول على نتائج للدالة DATEVALUE تختلف عن نتيجة هذا المثال",
		abstract: "تحول الدالة DATEVALUE التاريخ المخزن كنص إلى رقم تسلسلي يتعرف عليه Excel كتاريخ. على سبيل المثال، تقوم الصيغة ‎ =DATEVALUE(\"1/1/2008\")‎ بإرجاع 39448، وهو الرقم التسلسلي للتاريخ 1/1/2008. تذكر أنه على الرغم من ذلك، فقد يؤدي إعداد تاريخ النظام على الكمبيوتر لديك إلى الحصول على نتائج للدالة DATEVALUE تختلف عن نتيجة هذا المثال",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/datevalue-function"
		}],
		functionParameter: { dateText: {
			name: "date_text",
			detail: "مطلوب. وهي النص الذي يمثل تاريخاً بتنسيق تاريخ لـ Excel أو مرجعاً للخلية التي تحتوي على نص يمثل تاريخاً بتنسيق تاريخ لـ Excel. على سبيل المثال، يعد التاريخ \"30/1/2008\" أو \"30 - يناير - 2008\" عبارة عن سلسلة نصية موجودة داخل علامتي اقتباس وتمثل تاريخاً. باستخدام نظام التاريخ الافتراضي في Microsoft Excel for Windows، يجب أن تمثل الوسيطة date_text تاريخا بين 1 يناير 1900 و31 ديسمبر 9999. ترجع الدالة DATEVALUE #VALUE! قيمة الخطأ إذا كانت قيمة الوسيطة date_text تقع خارج هذا النطاق. إذا تم حذف جزء السنة من الوسيطة date_text ، تستخدم الدالة DATEVALUE السنة الحالية من الساعة المضمنة في الكمبيوتر. يتم تجاهل معلومات الوقت في الوسيطة date_text ."
		} }
	},
	DAY: {
		description: "تُرجع هذه الدالة يوم تاريخ ما ممثلاً برقم تسلسلي. ويكون اليوم عدداً صحيحاً يتراوح بين 1 و31.",
		abstract: "تُرجع هذه الدالة يوم تاريخ ما ممثلاً برقم تسلسلي. ويكون اليوم عدداً صحيحاً يتراوح بين 1 و31.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/day-function"
		}],
		functionParameter: { serialNumber: {
			name: "serial_number",
			detail: "مطلوب. تاريخ اليوم الذي تحاول العثور عليه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص ."
		} }
	},
	DAYS: {
		description: "تُرجع عدد الأيام بين تاريخين.",
		abstract: "تُرجع عدد الأيام بين تاريخين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/days-function"
		}],
		functionParameter: {
			endDate: {
				name: "end_date",
				detail: "مطلوب. وتُعد كل من الوسيطتين Start_date وEnd_date التاريخين اللذين تريد معرفة عدد الأيام بينهما."
			},
			startDate: {
				name: "start_date",
				detail: "مطلوب. وتُعد كل من الوسيطتين Start_date وEnd_date التاريخين اللذين تريد معرفة عدد الأيام بينهما."
			}
		}
	},
	DAYS360: {
		description: "تُرجع الدالة DAYS360 عدد الأيام بين تاريخين استناداً إلى سنة من 360 يوماً (اثنا عشر شهراً يتألف كلٌ منها من 30 يوماً)، تُستخدم في بعض الحسابات الخاصة بالمحاسبة. استخدم هذه الدالة للمساعدة في حساب الدفعات إذا كان نظام المحاسبة يستند إلى 12 شهراً و30 يوماً في الشهر.",
		abstract: "تُرجع الدالة DAYS360 عدد الأيام بين تاريخين استناداً إلى سنة من 360 يوماً (اثنا عشر شهراً يتألف كلٌ منها من 30 يوماً)، تُستخدم في بعض الحسابات الخاصة بالمحاسبة. استخدم هذه الدالة للمساعدة في حساب الدفعات إذا كان نظام المحاسبة يستند إلى 12 شهراً و30 يوماً في الشهر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/days360-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "start_date وend_date هما التاريخان اللذان تريد معرفة عدد الأيام بينهما."
			},
			endDate: {
				name: "end_date",
				detail: "start_date وend_date هما التاريخان اللذان تريد معرفة عدد الأيام بينهما."
			},
			method: {
				name: "method",
				detail: "قيمة منطقية تحدد ما إذا كان يجب استخدام الطريقة الأمريكية أو الأوروبية في الحساب."
			}
		}
	},
	EDATE: {
		description: "تُرجع الرقم التسلسلي الذي يمثل التاريخ وهو عدد الأشهر المشار إليه قبل تاريخ (start_date) محدد أو بعده. استخدم EDATE لحساب تواريخ الاستحقاق أو تواريخ استحقاق الدفع التي تقع في اليوم نفسه من شهر تاريخ الإصدار.",
		abstract: "تُرجع الرقم التسلسلي الذي يمثل التاريخ وهو عدد الأشهر المشار إليه قبل تاريخ (start_date) محدد أو بعده. استخدم EDATE لحساب تواريخ الاستحقاق أو تواريخ استحقاق الدفع التي تقع في اليوم نفسه من شهر تاريخ الإصدار.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/edate-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "مطلوب. تاريخ يمثل تاريخ البدء. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص ."
			},
			months: {
				name: "months",
				detail: "مطلوب. عدد الأشهر التي تسبق تاريخ_البدء أو تليه. تشير القيمة الموجبة للأشهر إلى تاريخ مستقبلي، في حين تشير القيمة السالبة إلى تاريخ سابق."
			}
		}
	},
	EOMONTH: {
		description: "تُرجع هذه الدالة الرقم التسلسلي لليوم الأخير من الشهر وهو عدد الأشهر المشار إليه قبل تاريخ_البدء أو بعده. استخدم الدالة EOMONTH لحساب تواريخ التسديد أو تواريخ الاستحقاق التي تقع في اليوم الأخير من الشهر.",
		abstract: "تُرجع هذه الدالة الرقم التسلسلي لليوم الأخير من الشهر وهو عدد الأشهر المشار إليه قبل تاريخ_البدء أو بعده. استخدم الدالة EOMONTH لحساب تواريخ التسديد أو تواريخ الاستحقاق التي تقع في اليوم الأخير من الشهر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/eomonth-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "مطلوب. تاريخ يمثل تاريخ البدء. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص ."
			},
			months: {
				name: "months",
				detail: "مطلوب. عدد الأشهر التي تسبق تاريخ_البدء أو تليه. تشير القيمة الموجبة للأشهر إلى تاريخ مستقبلي، في حين تشير القيمة السالبة إلى تاريخ سابق. ملاحظة إذا لم يكن عدد الأشهر عبارة عن رقم صحيح، فيتم اقتطاعه."
			}
		}
	},
	EPOCHTODATE: {
		description: "يحوّل طابع وقت حقبة Unix بالثواني أو المللي ثانية أو الميكروثانية إلى تاريخ ووقت بالتوقيت العالمي المنسق (UTC).",
		abstract: "يحوّل طابع وقت حقبة Unix بالثواني أو المللي ثانية أو الميكروثانية إلى تاريخ ووقت بالتوقيت العالمي المنسق (UTC).",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/13193461?hl=ar"
		}],
		functionParameter: {
			timestamp: {
				name: "timestamp",
				detail: "طابع زمني لعصر Unix، بالثواني أو المللي ثانية أو الميكروثانية."
			},
			unit: {
				name: "unit",
				detail: "[اختياري — القيمة الافتراضية 1]: وحدة الزمن التي يُعبَّر بها عن الطابع الزمني."
			}
		}
	},
	HOUR: {
		description: "تُرجع هذه الدالة الساعة من قيمة وقت. وتظهر الساعة كعدد صحيح، يتراوح من 0 (12:00 ص) إلى 23 (11:00 م).",
		abstract: "تُرجع هذه الدالة الساعة من قيمة وقت. وتظهر الساعة كعدد صحيح، يتراوح من 0 (12:00 ص) إلى 23 (11:00 م).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hour-function"
		}],
		functionParameter: { serialNumber: {
			name: "serial_number",
			detail: "مطلوب. الوقت الذي يحتوي على الساعة التي تريد البحث عنها. يمكن إدخال الأوقات كسلاسل نصية بين علامتي اقتباس (على سبيل المثال، \"6:45 م\")، أو كأرقام عشرية (على سبيل المثال، 0,78125، الذي يمثل \"6:45 م\")، أو كنتائج صيغ أو دالات أخرى (على سبيل المثال، TIMEVALUE(\"6:45 م\")‎)."
		} }
	},
	ISOWEEKNUM: {
		description: "تُرجع هذه الدالة رقم أسبوع ISO من العام لتاريخ محدد.",
		abstract: "تُرجع هذه الدالة رقم أسبوع ISO من العام لتاريخ محدد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/isoweeknum-function"
		}],
		functionParameter: { date: {
			name: "date",
			detail: "مطلوب. التاريخ هو رمز التاريخ والوقت الذي يستخدمه Excel لحساب التاريخ والوقت."
		} }
	},
	MINUTE: {
		description: "إرجاع الدقائق من قيمة للوقت. تظهر قيمة الدقائق كعدد صحيح، يتراوح بين 0 و59.",
		abstract: "إرجاع الدقائق من قيمة للوقت. تظهر قيمة الدقائق كعدد صحيح، يتراوح بين 0 و59.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/minute-function"
		}],
		functionParameter: { serialNumber: {
			name: "serial_number",
			detail: "مطلوب. الوقت الذي يحتوي على الدقيقة التي تريد البحث عنها. يمكن إدخال الأوقات كسلاسل نصية بين علامتي اقتباس (على سبيل المثال، \"6:45 م\")، أو كأرقام عشرية (على سبيل المثال، 0.78125، الذي يمثل \"6:45 م\")، أو كنتائج صيغ أو دالات أخرى (على سبيل المثال، (\"TIMEVALUE(\"6:45 PM)."
		} }
	},
	MONTH: {
		description: "تُرجع هذه الدالة شهر تاريخ ما يتم تمثيله برقم تسلسلي. ويظهر الشهر كعدد صحيح، يتراوح بين 1 (يناير) و12 (ديسمبر).",
		abstract: "تُرجع هذه الدالة شهر تاريخ ما يتم تمثيله برقم تسلسلي. ويظهر الشهر كعدد صحيح، يتراوح بين 1 (يناير) و12 (ديسمبر).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/month-function"
		}],
		functionParameter: { serialNumber: {
			name: "serial_number",
			detail: "مطلوب. تاريخ الشهر الذي تحاول البحث عنه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص ."
		} }
	},
	NETWORKDAYS: {
		description: "تُرجع هذه الدالة أيام العمل الكاملة بين تاريخ البدء وتاريخ الانتهاء. وتُستبعد نهايات الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة من أيام العمل. استخدم NETWORKDAYS لحساب عوائد الموظفين المستحقة بالاستناد إلى عدد أيام العمل في فترة محددة.",
		abstract: "تُرجع هذه الدالة أيام العمل الكاملة بين تاريخ البدء وتاريخ الانتهاء. وتُستبعد نهايات الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة من أيام العمل. استخدم NETWORKDAYS لحساب عوائد الموظفين المستحقة بالاستناد إلى عدد أيام العمل في فترة محددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/networkdays-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "مطلوب. تاريخ يمثل تاريخ البدء."
			},
			endDate: {
				name: "end_date",
				detail: "مطلوب. تاريخ يمثل تاريخ الانتهاء."
			},
			holidays: {
				name: "holidays",
				detail: "الاختياري. هي نطاق اختياري يحتوي على واحد أو أكثر من التواريخ المطلوب استبعادها من تقويم العمل، مثل العطلات الرسمية الموحدة والإجازات الشخصية. يمكن أن تكون القائمة عبارة عن نطاق من الخلايا التي تحتوي على التواريخ أو ثابت صفيف من الأرقام التسلسلية التي تمثل التواريخ."
			}
		}
	},
	NETWORKDAYS_INTL: {
		description: "تُرجع هذه الدالة عدد أيام العمل الكاملة بين تاريخين باستخدام المعلمات لتحديد أيام نهايات الأسبوع وعددها. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة.",
		abstract: "تُرجع هذه الدالة عدد أيام العمل الكاملة بين تاريخين باستخدام المعلمات لتحديد أيام نهايات الأسبوع وعددها. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/networkdays-intl-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "تاريخ يمثل تاريخ البدء."
			},
			endDate: {
				name: "end_date",
				detail: "تاريخ يمثل تاريخ الانتهاء."
			},
			weekend: {
				name: "weekend",
				detail: "رقم أو سلسلة نصية تحدد أيام عطلة نهاية الأسبوع."
			},
			holidays: {
				name: "holidays",
				detail: "نطاق اختياري يتضمن تاريخاً واحداً أو أكثر لاستبعاده من تقويم العمل، مثل العطلات الرسمية أو العطلات المتحركة."
			}
		}
	},
	NOW: {
		description: "تُرجع هذه الدالة الرقم التسلسلي للتاريخ والوقت الحاليين. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تنسيق يتطابق مع تنسيق الوقت والتاريخ المحدد في الإعدادات الإقليمية. ويمكنك تغيير تنسيق التاريخ والوقت للخلية باستخدام الأوامر الموجودة في مجموعة رقم ضمن علامة التبويب الشريط الرئيسي على الشريط.",
		abstract: "تُرجع هذه الدالة الرقم التسلسلي للتاريخ والوقت الحاليين. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تنسيق يتطابق مع تنسيق الوقت والتاريخ المحدد في الإعدادات الإقليمية. ويمكنك تغيير تنسيق التاريخ والوقت للخلية باستخدام الأوامر الموجودة في مجموعة رقم ضمن علامة التبويب الشريط الرئيسي على الشريط.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/now-function"
		}],
		functionParameter: {}
	},
	SECOND: {
		description: "تُرجع هذه الدالة الثواني من قيمة وقت. وتظهر الثانية كعدد صحيح يتراوح بين 0 و59.",
		abstract: "تُرجع هذه الدالة الثواني من قيمة وقت. وتظهر الثانية كعدد صحيح يتراوح بين 0 و59.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/second-function"
		}],
		functionParameter: { serialNumber: {
			name: "serial_number",
			detail: "مطلوب. الوقت الذي يحتوي على الثواني التي تريد العثور عليها. يمكن إدخال الأوقات كسلاسل نصية بين علامات اقتباس (مثلاً، \"6:45 م\")، أو كأرقام عشرية (مثلاً 0.78125، وهي تشير إلى \"6:45 م\")، أو كنتائج لصيغ أو دالات أخرى (مثلاً TIMEVALUE(\"6:45 PM\")‎‏)."
		} }
	},
	TIME: {
		description: "تُرجع هذه الدالة الرقم العشري لوقت محدد. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، فيتم تنسيق الخلية كتاريخ.",
		abstract: "تُرجع هذه الدالة الرقم العشري لوقت محدد. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، فيتم تنسيق الخلية كتاريخ.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/time-function"
		}],
		functionParameter: {
			hour: {
				name: "hour",
				detail: "مطلوب. رقم من 0 (صفر) إلى 32767 يمثل الساعة. سيتم تقسيم أي قيمة أكبر من 23 على 24، ويُعتبر الباقي قيمة الساعة. على سبيل المثال، TIME(27,0,0) = TIME(3,0,0) = .125 أو 3:00 ص."
			},
			minute: {
				name: "minute",
				detail: "مطلوب. رقم من 0 إلى 32767 يمثل الدقيقة. سيتم تحويل أي قيمة أكبر من 59 إلى ساعات ودقائق. على سبيل المثال، TIME(0,750,0) = TIME(12,30,0) = .520833 أو 12:30 م."
			},
			second: {
				name: "second",
				detail: "مطلوب. رقم من 0 إلى 32767 يمثل الثانية. سيتم تحويل أي قيمة أكبر من 59 إلى ساعات، ودقائق، وثوانٍ. على سبيل المثال، TIME(0,0,2000) = TIME(0,33,22) = .023148 أو 12:33:20 ص."
			}
		}
	},
	TIMEVALUE: {
		description: "تُرجع هذه الدالة الرقم العشري للوقت ممثلاً بسلسلة نصية. إن الرقم العشري عبارة عن قيمة تتراوح بين 0 (صفر) و0,99988426 وتمثل الأوقات من 0:00:00 (12:00:00 ص) إلى 23:59:59 (11:59:59 م).",
		abstract: "تُرجع هذه الدالة الرقم العشري للوقت ممثلاً بسلسلة نصية. إن الرقم العشري عبارة عن قيمة تتراوح بين 0 (صفر) و0,99988426 وتمثل الأوقات من 0:00:00 (12:00:00 ص) إلى 23:59:59 (11:59:59 م).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/timevalue-function"
		}],
		functionParameter: { timeText: {
			name: "time_text",
			detail: "مطلوب. سلسلة نصية تمثل وقتاً بأي من تنسيقات الوقت الخاصة بـ Microsoft Excel؛ مثلاً، \"6:45 م\" و\"18:45\" عبارة عن سلسلتين نصيتين داخل علامات اقتباس تمثلان وقتاً."
		} }
	},
	TO_DATE: {
		description: "يحوّل رقماً مقدماً إلى تاريخ.",
		abstract: "يحوّل رقماً مقدماً إلى تاريخ.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/3094239?hl=ar"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "الوسيطة أو مرجع الخلية المراد تحويله إلى تاريخ. إذا كانت value رقماً أو مرجعاً إلى خلية تحتوي على قيمة رقمية، فترجع TO_DATE القيمة بعد تحويلها إلى تاريخ، باعتبارها عدد الأيام منذ 30 ديسمبر 1899. تُفسَّر القيم السالبة على أنها أيام قبل ذلك التاريخ، وتشير القيم الكسرية إلى الوقت المنقضي بعد منتصف الليل. إذا لم تكن value رقماً أو مرجعاً إلى خلية تحتوي على قيمة رقمية، فترجع TO_DATE القيمة دون تغيير."
		} }
	},
	TODAY: {
		description: "ترجع الدالة TODAY الرقم التسلسلي للتاريخ الحالي. الرقم التسلسلي عبارة عن تعليمة برمجية للتاريخ والوقت يستخدمها Excel لحسابات التاريخ والوقت. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تاريخ . إذا كنت تريد عرض الرقم التسلسلي، فعليك تغيير تنسيق الخلية إلى عام أو رقم .",
		abstract: "ترجع الدالة TODAY الرقم التسلسلي للتاريخ الحالي. الرقم التسلسلي عبارة عن تعليمة برمجية للتاريخ والوقت يستخدمها Excel لحسابات التاريخ والوقت. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تاريخ . إذا كنت تريد عرض الرقم التسلسلي، فعليك تغيير تنسيق الخلية إلى عام أو رقم .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/today-function"
		}],
		functionParameter: {}
	},
	WEEKDAY: {
		description: "تُرجع هذه الدالة يوم الأسبوع المطابق لأحد التواريخ. يتم تقديم اليوم كعدد صحيح، وهو يتراوح من 1 (الأحد) إلى 7 (السبت)، بشكل افتراضي.",
		abstract: "تُرجع هذه الدالة يوم الأسبوع المطابق لأحد التواريخ. يتم تقديم اليوم كعدد صحيح، وهو يتراوح من 1 (الأحد) إلى 7 (السبت)، بشكل افتراضي.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/weekday-function"
		}],
		functionParameter: {
			serialNumber: {
				name: "serial_number",
				detail: "مطلوب. رقم تسلسلي يمثل تاريخ اليوم الذي تحاول البحث عنه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص."
			},
			returnType: {
				name: "return_type",
				detail: "الاختياري. رقم يحدد نوع القيمة المرجعة."
			}
		}
	},
	WEEKNUM: {
		description: "تُرجع رقم الأسبوع لتاريخ محدد. على سبيل المثال، إن الأسبوع الذي يقع فيه التاريخ 1 يناير هو الأسبوع الأول في السنة ورقمه الأسبوع 1.",
		abstract: "تُرجع رقم الأسبوع لتاريخ محدد. على سبيل المثال، إن الأسبوع الذي يقع فيه التاريخ 1 يناير هو الأسبوع الأول في السنة ورقمه الأسبوع 1.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/weeknum-function"
		}],
		functionParameter: {
			serialNumber: {
				name: "serial_number",
				detail: "مطلوب. تاريخ يقع ضمن الأسبوع. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص."
			},
			returnType: {
				name: "return_type",
				detail: "الاختياري. رقم يحدد اليوم الذي يبدأ عنده الأسبوع. إن القيمة الافتراضية هي 1."
			}
		}
	},
	WORKDAY: {
		description: "تُرجع رقماً يمثل تاريخاً يشير إلى عدد أيام العمل قبل تاريخ معين (تاريخ البدء) أو بعده. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى يتم تحديدها على أنها أيام عطلة. استخدم WORKDAY لاستبعاد عطلات نهاية الأسبوع أو أيام العطلة الرسمية عند حساب تواريخ استحقاق الفواتير أو مواعيد التسليم المتوقعة أو عدد الأيام التي تم فيها إنجاز العمل.",
		abstract: "تُرجع رقماً يمثل تاريخاً يشير إلى عدد أيام العمل قبل تاريخ معين (تاريخ البدء) أو بعده. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى يتم تحديدها على أنها أيام عطلة. استخدم WORKDAY لاستبعاد عطلات نهاية الأسبوع أو أيام العطلة الرسمية عند حساب تواريخ استحقاق الفواتير أو مواعيد التسليم المتوقعة أو عدد الأيام التي تم فيها إنجاز العمل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/workday-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "مطلوب. تاريخ يمثل تاريخ البدء."
			},
			days: {
				name: "days",
				detail: "مطلوب. عدد الأيام غير عطلات نهاية الأسبوع وغير أيام العطلة الرسمية الواقعة قبل تاريخ البدء start_date أو بعده. ينتج عن القيمة الموجبة للوسيطة days تاريخ مستقبلي؛ وينتج عن القيمة السالبة تاريخ ماضٍ."
			},
			holidays: {
				name: "holidays",
				detail: "الاختياري. هي قائمة اختيارية تحتوي على واحد أو أكثر من التواريخ المطلوب استبعادها من تقويم العمل، مثل العطلات الرسمية الموحدة والإجازات الشخصية. يمكن أن تكون القائمة عبارة عن نطاق من الخلايا التي تحتوي على التواريخ أو ثابت صفيف من الأرقام التسلسلية التي تمثل التواريخ."
			}
		}
	},
	WORKDAY_INTL: {
		description: "ترجع هذه الدالة الرقم التسلسلي للتاريخ قبل عدد محدد من أيام العمل أو بعده باستخدام معلمات عطلة نهاية الأسبوع المخصصة. يمكن أن تشير معلمات عطلة نهاية الأسبوع الاختيارية إلى أيام عطلة نهاية الأسبوع وعددها. لاحظ أن أيام عطلة نهاية الأسبوع وأي أيام محددة كعطلات لا تعتبر أيام عمل.",
		abstract: "ترجع هذه الدالة الرقم التسلسلي للتاريخ قبل عدد محدد من أيام العمل أو بعده باستخدام معلمات عطلة نهاية الأسبوع المخصصة. يمكن أن تشير معلمات عطلة نهاية الأسبوع الاختيارية إلى أيام عطلة نهاية الأسبوع وعددها. لاحظ أن أيام عطلة نهاية الأسبوع وأي أيام محددة كعطلات لا تعتبر أيام عمل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/workday-intl-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "مطلوب. تاريخ البدء، تم اقتطاعه إلى عدد صحيح."
			},
			days: {
				name: "days",
				detail: "مطلوب. عدد أيام العمل قبل تاريخ البدء start_date أو بعده. ينتج عن القيمة الموجبة تاريخ مستقبلي؛ ينتج عن القيمة السالبة تاريخ سابق؛ ينتج عن القيمة الصفرية start_date المحددة بالفعل . يتم اقتطاع إزاحة اليوم إلى عدد صحيح."
			},
			weekend: {
				name: "weekend",
				detail: "الاختياري. إذا تم استخدامه، فهذا يشير إلى أيام الأسبوع التي هي أيام عطلة نهاية الأسبوع ولا تعتبر أيام عمل. وسيطة نهاية الأسبوع هي رقم عطلة نهاية الأسبوع أو سلسلة تحدد وقت حدوث عطلات نهاية الأسبوع. تشير قيم أرقام عطلة نهاية الأسبوع إلى أيام عطلة نهاية الأسبوع كما هو موضح أدناه."
			},
			holidays: {
				name: "holidays",
				detail: "هذه وسيطة اختيارية في نهاية بناء الجملة. يحدد مجموعة اختيارية من تاريخ واحد أو أكثر سيتم استبعاده من تقويم يوم العمل. يجب أن تكون العطلات عبارة عن نطاق خلايا يحتوي على التواريخ - أو ثابت صفيف للقيم التسلسلية التي تمثل تلك التواريخ. يمكن أن يكون ترتيب التواريخ أو القيم التسلسلية في العطلات عشوائياً."
			}
		}
	},
	YEAR: {
		description: "تُرجع السنة المطابقة لتاريخ معيّن. ويتم إرجاع السنة كعدد صحيح ضمن النطاق 1900-9999.",
		abstract: "تُرجع السنة المطابقة لتاريخ معيّن. ويتم إرجاع السنة كعدد صحيح ضمن النطاق 1900-9999.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/year-function"
		}],
		functionParameter: { serialNumber: {
			name: "serial_number",
			detail: "مطلوب. تاريخ السنة الذي تريد البحث عنه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2025,5,23) لليوم الثالث والعشرين من مايو 2025. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص."
		} }
	},
	YEARFRAC: {
		description: "يحسب YEARFRAC كسر السنة ممثلاً بعدد الأيام الكاملة التي تقع بين تاريخين (تاريخ البدء start_date وتاريخ الانتهاء end_date ). على سبيل المثال، يمكنك استخدام YEARFRAC لتحديد نسبة الالتزامات والمنافع خلال سنة كاملة والتي تريد تعيينها لفترة معينة.",
		abstract: "يحسب YEARFRAC كسر السنة ممثلاً بعدد الأيام الكاملة التي تقع بين تاريخين (تاريخ البدء start_date وتاريخ الانتهاء end_date ). على سبيل المثال، يمكنك استخدام YEARFRAC لتحديد نسبة الالتزامات والمنافع خلال سنة كاملة والتي تريد تعيينها لفترة معينة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/yearfrac-function"
		}],
		functionParameter: {
			startDate: {
				name: "start_date",
				detail: "تاريخ يمثل تاريخ البدء."
			},
			endDate: {
				name: "end_date",
				detail: "تاريخ يمثل تاريخ الانتهاء."
			},
			basis: {
				name: "basis",
				detail: "نوع أساس احتساب الأيام المراد استخدامه."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/engineering/ar-SA.ts
const locale$10 = {
	BESSELI: {
		description: "تُرجع الدالة Bessel المُعدلة، والتي تكافئ الدالة Bessel التي يتم تقييمها إلى وسيطات تخيلية تماماً.",
		abstract: "تُرجع الدالة Bessel المُعدلة، والتي تكافئ الدالة Bessel التي يتم تقييمها إلى وسيطات تخيلية تماماً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/besseli-function"
		}],
		functionParameter: {
			x: {
				name: "X",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			n: {
				name: "N",
				detail: "مطلوبة. وهي ترتيب الدالة Bessel. إذا لم تكن n عدداً صحيحاً، فإنه يتم اقتطاعها."
			}
		}
	},
	BESSELJ: {
		description: "تُرجع الدالة Bessel.",
		abstract: "تُرجع الدالة Bessel.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/besselj-function"
		}],
		functionParameter: {
			x: {
				name: "X",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			n: {
				name: "N",
				detail: "مطلوبة. وهي ترتيب الدالة Bessel. إذا لم تكن n عدداً صحيحاً، فإنه يتم اقتطاعها."
			}
		}
	},
	BESSELK: {
		description: "تُرجع الدالة Bessel المُعدلة، والتي تكافئ دالات Bessel التي يتم تقييمها إلى وسيطات تخيلية تماماً.",
		abstract: "تُرجع الدالة Bessel المُعدلة، والتي تكافئ دالات Bessel التي يتم تقييمها إلى وسيطات تخيلية تماماً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/besselk-function"
		}],
		functionParameter: {
			x: {
				name: "X",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			n: {
				name: "N",
				detail: "مطلوبة. وهي ترتيب الدالة. إذا لم تكن n عدداً صحيحاً، فإنه يتم اقتطاعها."
			}
		}
	},
	BESSELY: {
		description: "تُرجع الدالة Bessel، التي تسمى أيضاً الدالة Weber أو الدالة Neumann.",
		abstract: "تُرجع الدالة Bessel، التي تسمى أيضاً الدالة Weber أو الدالة Neumann.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bessely-function"
		}],
		functionParameter: {
			x: {
				name: "X",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			n: {
				name: "N",
				detail: "مطلوبة. وهي ترتيب الدالة. إذا لم تكن n عدداً صحيحاً، فإنه يتم اقتطاعها."
			}
		}
	},
	BIN2DEC: {
		description: "تحويل رقم ثنائي إلى رقم عشري.",
		abstract: "تحويل رقم ثنائي إلى رقم عشري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bin2dec-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي الرقم الثنائي الذي ترغب في تحويله. لا يمكن أن تحتوي الوسيطة Number على أكثر من 10 أحرف (10 بت). إن بت العلامة هو بت الرقم الأكثر أهمية. أما وحدات البت التسع المتبقية، فهي تشير إلى وحدات بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
		} }
	},
	BIN2HEX: {
		description: "تقوم بتحويل رقم ثنائي إلى رقم سداسي عشري.",
		abstract: "تقوم بتحويل رقم ثنائي إلى رقم سداسي عشري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bin2hex-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. وهي الرقم الثنائي الذي ترغب في تحويله. لا يمكن أن تحتوي الوسيطة Number على أكثر من 10 أحرف (10 بت). إن بت العلامة هو بت الرقم الأكثر أهمية. أما وحدات البت التسع المتبقية، فهي تشير إلى وحدات بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "الاختياري. وهي عدد الأحرف المراد استخدامها. إذا تم إهمال قيمة places، فإن BIN2HEX تستخدم الحد الأدنى لعدد الأحرف الضرورية. ويفيد تعيين قيمة places في ترك مساحات كافية للقيم المرجعة ذات الأصفار البادئة (0)."
			}
		}
	},
	BIN2OCT: {
		description: "تقوم بتحويل رقم ثنائي إلى رقم ثماني.",
		abstract: "تقوم بتحويل رقم ثنائي إلى رقم ثماني.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bin2oct-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. وهي الرقم الثنائي الذي ترغب في تحويله. لا يمكن أن تحتوي الوسيطة Number على أكثر من 10 أحرف (10 بت). إن بت العلامة هو بت الرقم الأكثر أهمية. أما وحدات البت التسع المتبقية، فهي تشير إلى وحدات بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "الاختياري. وهي عدد الأحرف المراد استخدامها. إذا تم إهمال قيمة places، فإن BIN2OCT تستخدم الحد الأدنى لعدد الأحرف الضرورية. ويفيد تعيين قيمة places في ترك مساحات كافية للقيم المرجعة ذات الأصفار البادئة (0)."
			}
		}
	},
	BITAND: {
		description: "ترجع البت And لرقمين.",
		abstract: "ترجع البت And لرقمين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bitand-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. يجب أن تكون في شكل عشري وأكبر من أو تساوي 0."
			},
			number2: {
				name: "number2",
				detail: "مطلوب. يجب أن تكون في شكل عشري وأكبر من أو تساوي 0."
			}
		}
	},
	BITLSHIFT: {
		description: "تُرجع رقماً تمت إزاحته إلى اليسار بمقدار العدد المحدد من أرقام البت.",
		abstract: "تُرجع رقماً تمت إزاحته إلى اليسار بمقدار العدد المحدد من أرقام البت.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bitlshift-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. يجب أن يكون الرقم عددا صحيحا أكبر من أو يساوي 0."
			},
			shiftAmount: {
				name: "shift_amount",
				detail: "مطلوب. يجب أن يكون Shift_amount عددا صحيحا."
			}
		}
	},
	BITOR: {
		description: "تُرجع هذه الدالة البت 'OR' لرقمين.",
		abstract: "تُرجع هذه الدالة البت 'OR' لرقمين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bitor-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. يجب أن تكون في شكل عشري وأكبر من أو تساوي 0."
			},
			number2: {
				name: "number2",
				detail: "مطلوب. يجب أن تكون في شكل عشري وأكبر من أو تساوي 0."
			}
		}
	},
	BITRSHIFT: {
		description: "تُرجع هذه الدالة رقماً تمت إزاحته إلى اليمين بمقدار عدد محدد من البت.",
		abstract: "تُرجع هذه الدالة رقماً تمت إزاحته إلى اليمين بمقدار عدد محدد من البت.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bitrshift-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. يجب أن يكون عددا صحيحا أكبر من أو يساوي 0."
			},
			shiftAmount: {
				name: "shift_amount",
				detail: "مطلوب. يجب أن يكون عددا صحيحا."
			}
		}
	},
	BITXOR: {
		description: "تُرجع هذه الدالة البت 'XOR' لرقمين.",
		abstract: "تُرجع هذه الدالة البت 'XOR' لرقمين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bitxor-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. يجب أن يكون أكبر من أو يساوي 0."
			},
			number2: {
				name: "number2",
				detail: "مطلوب. يجب أن يكون أكبر من أو يساوي 0."
			}
		}
	},
	COMPLEX: {
		description: "تحويل المعاملات الحقيقية والتخيلية إلى عدد مركب بالشكل x + yi أو x + yj.",
		abstract: "تحويل المعاملات الحقيقية والتخيلية إلى عدد مركب بالشكل x + yi أو x + yj.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/complex-function"
		}],
		functionParameter: {
			realNum: {
				name: "real_num",
				detail: "مطلوب. المعامل الحقيقي للعدد المركب."
			},
			iNum: {
				name: "i_num",
				detail: "مطلوب. المعامل التخيلي للعدد المركب."
			},
			suffix: {
				name: "suffix",
				detail: "الاختياري. لاحقة المكون التخيلي للعدد المركب. إذا تم حذف الوسيطة Suffix، فيتم افتراض أنها \"i\"."
			}
		}
	},
	CONVERT: {
		description: "تقوم بتحويل رقم من أحد أنظمة القياس إلى نظام آخر. على سبيل المثال، بإمكان CONVERT ترجمة جدول للمسافات بالميل إلى جدول للمسافات بالكيلومتر.",
		abstract: "تقوم بتحويل رقم من أحد أنظمة القياس إلى نظام آخر. على سبيل المثال، بإمكان CONVERT ترجمة جدول للمسافات بالميل إلى جدول للمسافات بالكيلومتر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/convert-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "القيمة بوحدات from_unit المراد تحويلها."
			},
			fromUnit: {
				name: "from_unit",
				detail: "وحدات القيمة number."
			},
			toUnit: {
				name: "to_unit",
				detail: "وحدات النتيجة."
			}
		}
	},
	DEC2BIN: {
		description: "تحويل رقم عشري إلى رقم ثنائي.",
		abstract: "تحويل رقم عشري إلى رقم ثنائي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dec2bin-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم العشري الصحيح الذي ترغب في تحويله. إذا كان الرقم سالباً، فيتم تجاهل قيم المنازل الصحيحة وتُرجع الدالة DEC2BIN رقماً ثنائياً يتألف من 10 أحرف (10 بت) حيث تكون بت الإشارة وحدة البت الأكثر أهمية. وتشير وحدات البت التسع المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "الاختياري. عدد الأحرف التي سيتم استخدامها. في حالة حذف المنازل، تستخدم DEC2BIN أقل عدد ممكن من الأحرف الضرورية. وتُعد الوسيطة Places مفيدة لترك مساحة للقيمة المرجعة بأصفار بادئة (0)."
			}
		}
	},
	DEC2HEX: {
		description: "تحويل رقم عشري إلى رقم سداسي عشري.",
		abstract: "تحويل رقم عشري إلى رقم سداسي عشري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dec2hex-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم العشري الصحيح الذي ترغب في تحويله. إذا كان الرقم سالباً، فيتم تجاهل المنازل العشرية وترجع DEC2HEX رقماً سداسياً عشرياً يتألف من 10 أحرف (40 بت) حيث يكون بت الإشارة وحدة البت الأكثر أهمية. وتشير وحدات البت التسع والثلاثون المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "الاختياري. عدد الأحرف التي سيتم استخدامها. في حالة حذف المنازل، تستخدم DEC2HEX أقل عدد ممكن من الأحرف الضرورية. وتُعد وسيطة المنازل مفيدة لترك مساحة للقيمة المرجعة بأصفار بادئة (0)."
			}
		}
	},
	DEC2OCT: {
		description: "تحويل رقم عشري إلى رقم ثماني.",
		abstract: "تحويل رقم عشري إلى رقم ثماني.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dec2oct-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم العشري الصحيح الذي ترغب في تحويله. إذا كان الرقم سالباً، فيتم تجاهل المنازل العشرية وترجع DEC2OCT رقماً ثمانياً يتألف من 10 أحرف (30 بت) حيث يكون بت الإشارة وحدة البت الأكثر أهمية. وتشير وحدات البت التسع والعشرون المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "الاختياري. عدد الأحرف التي سيتم استخدامها. في حالة حذف المنازل، تستخدم DEC2OCT أقل عدد ممكن من الأحرف الضرورية. وتُعد الوسيطة Places مفيدة لترك مساحة للقيمة المرجعة بأصفار بادئة (0)."
			}
		}
	},
	DELTA: {
		description: "اختبار المساواة بين قيمتين. تُرجع هذه الدالة 1 إذا كانت قيمة number1 = ‏number2، وتُرجع 0 خلاف ذلك. استخدم هذه الدالة لتصفية مجموعة من القيم. على سبيل المثال، يمكنك حساب عدد الأزواج المتساوية عبر جمع دالات DELTA متعددة. تعرف هذه الدالة أيضاً باسم Kronecker Delta.",
		abstract: "اختبار المساواة بين قيمتين. تُرجع هذه الدالة 1 إذا كانت قيمة number1 = ‏number2، وتُرجع 0 خلاف ذلك. استخدم هذه الدالة لتصفية مجموعة من القيم. على سبيل المثال، يمكنك حساب عدد الأزواج المتساوية عبر جمع دالات DELTA متعددة. تعرف هذه الدالة أيضاً باسم Kronecker Delta.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/delta-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. الرقم الأول."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. الرقم الثاني. إذا تم حذف الوسيطة number2، فسيتم افتراض أن قيمتها تساوي الصفر."
			}
		}
	},
	ERF: {
		description: "تُرجع دالة الخطأ المتكاملة بين الحد_الأدنى والحد_الأعلى.",
		abstract: "تُرجع دالة الخطأ المتكاملة بين الحد_الأدنى والحد_الأعلى.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/erf-function"
		}],
		functionParameter: {
			lowerLimit: {
				name: "lower_limit",
				detail: "مطلوب. الحد الأدنى لتكامل ERF."
			},
			upperLimit: {
				name: "upper_limit",
				detail: "الاختياري. الحد الأعلى لتكامل ERF. في حال حذف هذه الوسيطة، تحقق الدالة ERF تكاملاً بين الصفر والحد_الأدنى."
			}
		}
	},
	ERF_PRECISE: {
		description: "تُرجع دالة الخطأ.",
		abstract: "تُرجع دالة الخطأ.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/erf-precise-function"
		}],
		functionParameter: { x: {
			name: "x",
			detail: "مطلوبة. الحد الأدنى لتكامل ERF.PRECISE."
		} }
	},
	ERFC: {
		description: "تُرجع دالة ERF المتممة المتكاملة بين x وما لا نهاية.",
		abstract: "تُرجع دالة ERF المتممة المتكاملة بين x وما لا نهاية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/erfc-function"
		}],
		functionParameter: { x: {
			name: "x",
			detail: "مطلوبة. الحد الأدنى لتكامل ERFC."
		} }
	},
	ERFC_PRECISE: {
		description: "تُرجع دالة ERF المتممة المتكاملة بين x وما لا نهاية.",
		abstract: "تُرجع دالة ERF المتممة المتكاملة بين x وما لا نهاية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/erfc-precise-function"
		}],
		functionParameter: { x: {
			name: "x",
			detail: "مطلوبة. الحد الأدنى لتكامل ERFC.PRECISE."
		} }
	},
	GESTEP: {
		description: "تُرجع هذه الدالة 1 إذا كان الرقم ≥ الخطوة، وتُرجع 0 (صفر) خلاف ذلك. استخدم هذه الدالة لتصفية مجموعة من القيم. على سبيل المثال، يمكنك عبر جمع عدد من دالات GESTEP حساب عدد القيم التي تتجاوز العتبة.",
		abstract: "تُرجع هذه الدالة 1 إذا كان الرقم ≥ الخطوة، وتُرجع 0 (صفر) خلاف ذلك. استخدم هذه الدالة لتصفية مجموعة من القيم. على سبيل المثال، يمكنك عبر جمع عدد من دالات GESTEP حساب عدد القيم التي تتجاوز العتبة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gestep-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. القيمة المراد اختبارها مقارنة بالخطوة."
			},
			step: {
				name: "step",
				detail: "الاختياري. قيمة العتبة. إذا حذفت قيمة الخطوة، فتستخدم GESTEP الصفر."
			}
		}
	},
	HEX2BIN: {
		description: "تحويل رقم سداسي عشري إلى رقم ثنائي.",
		abstract: "تحويل رقم سداسي عشري إلى رقم ثنائي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hex2bin-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم السداسي العشري الذي ترغب في تحويله. لا يمكن أن يحتوي الرقم على أكثر من 10 أحرف. إن بت الرقم الأكثر أهمية هو بت الإشارة (البت الأربعون من اليسار). وتشير وحدات البت التسع المتبقية إلى بت الحجم. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "اختياري. عدد الأحرف التي سيتم استخدامها. في حال حذف المنازل، تستخدم الدالة HEX2BIN أقل عدد ممكن من الأحرف الضرورية. وتُعد وسيطة عدد المنازل مفيدة لترك مساحة للقيمة المرجعة بأصفار بادئة (0)."
			}
		}
	},
	HEX2DEC: {
		description: "تحويل رقم سداسي عشري إلى رقم عشري.",
		abstract: "تحويل رقم سداسي عشري إلى رقم عشري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hex2dec-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم السداسي العشري الذي ترغب في تحويله. لا يمكن أن يحتوي الرقم على أكثر من 10 أحرف (40 بت). إن بت الرقم الأكثر أهمية هو بت الإشارة. وتشير وحدات البت التسع والثلاثون المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
		} }
	},
	HEX2OCT: {
		description: "تحويل رقم سداسي عشري إلى رقم ثماني.",
		abstract: "تحويل رقم سداسي عشري إلى رقم ثماني.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hex2oct-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم السداسي العشري الذي ترغب في تحويله. لا يمكن أن يحتوي الرقم على أكثر من 10 أحرف. إن بت الرقم الأكثر أهمية هو بت الإشارة. وتشير وحدات البت التسع والثلاثون المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "اختياري. عدد الأحرف التي سيتم استخدامها. وفي حالة حذف المنازل، تستخدم الدالة HEX2OCT أقل عدد ممكن من الأحرف الضرورية. وتُعد وسيطة المنازل مفيدة لترك مساحة للقيمة المرجعة بأصفار بادئة (0)."
			}
		}
	},
	IMABS: {
		description: "إرجاع القيمة المطلقة (المُعامل) لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع القيمة المطلقة (المُعامل) لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imabs-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب القيمة المطلقة له."
		} }
	},
	IMAGINARY: {
		description: "إرجاع المُعامل التخيلي لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع المُعامل التخيلي لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imaginary-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب المُعامل التخيلي له."
		} }
	},
	IMARGUMENT: {
		description: "ترجع الوسيطة (theta)، وهي زاوية يتم التعبير عنها بالتقدير الدائري، بحيث:",
		abstract: "ترجع الوسيطة (theta)، وهي زاوية يتم التعبير عنها بالتقدير الدائري، بحيث:",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imargument-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. رقم مركب تريد الوسيطة له ."
		} }
	},
	IMCONJUGATE: {
		description: "إرجاع المرافق المركب لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع المرافق المركب لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imconjugate-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب المرافق له."
		} }
	},
	IMCOS: {
		description: "إرجاع جيب تمام عدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع جيب تمام عدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imcos-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب جيب التمام له."
		} }
	},
	IMCOSH: {
		description: "تُرجع هذه الدالة جيب التمام الزائدي لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		abstract: "تُرجع هذه الدالة جيب التمام الزائدي لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imcosh-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. عدد مركب تريد جيب التمام الزائدي له."
		} }
	},
	IMCOT: {
		description: "تُرجع هذه الدالة ظل التمام لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		abstract: "تُرجع هذه الدالة ظل التمام لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imcot-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "عدد مركب تريد حساب ظل التمام له."
		} }
	},
	IMCOTH: {
		description: "ترجع الدالة IMCOTH ظل التمام الزائدي للعدد المركب المحدد. على سبيل المثال، ترجع للعدد المركب \"x+yi\" القيمة \"coth(x+yi)\".",
		abstract: "ترجع الدالة IMCOTH ظل التمام الزائدي للعدد المركب المحدد. على سبيل المثال، ترجع للعدد المركب \"x+yi\" القيمة \"coth(x+yi)\".",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/9366256?hl=ar"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "العدد المركب الذي تريد حساب ظل التمام الزائدي له. يمكن أن يكون ناتج الدالة COMPLEX أو عدداً حقيقياً يُفسَّر كعدد مركب جزؤه التخيلي يساوي 0، أو سلسلة بالتنسيق “x+yi” حيث x وy رقميان."
		} }
	},
	IMCSC: {
		description: "تُرجع هذه الدالة قاطع التمام لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		abstract: "تُرجع هذه الدالة قاطع التمام لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imcsc-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. عدد مركب تريد أن يكون آمنا له."
		} }
	},
	IMCSCH: {
		description: "إرجاع التمام الزائدي لعدد مركب بتنسيق نص x+yi أو x+yj.",
		abstract: "إرجاع التمام الزائدي لعدد مركب بتنسيق نص x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imcsch-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. عدد مركب تريد أن يكون آمنا للفرط."
		} }
	},
	IMDIV: {
		description: "إرجاع حاصل قسمة عددين مركبين بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع حاصل قسمة عددين مركبين بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imdiv-function"
		}],
		functionParameter: {
			inumber1: {
				name: "inumber1",
				detail: "مطلوب. الكسر المركب أو المقسوم المركب."
			},
			inumber2: {
				name: "inumber2",
				detail: "مطلوب. المقام المركب أو عامل القسمة المركب."
			}
		}
	},
	IMEXP: {
		description: "إرجاع أس عدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع أس عدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imexp-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب الأس له."
		} }
	},
	IMLN: {
		description: "إرجاع اللوغاريتم الطبيعي لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع اللوغاريتم الطبيعي لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imln-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب اللوغاريتم الطبيعي له."
		} }
	},
	IMLOG: {
		description: "ترجع الدالة IMLOG لوغاريتم عدد مركب للأساس المحدد.",
		abstract: "ترجع الدالة IMLOG لوغاريتم عدد مركب للأساس المحدد.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/9366486?hl=ar"
		}],
		functionParameter: {
			inumber: {
				name: "inumber",
				detail: "قيمة الإدخال لدالة اللوغاريتم. يمكن كتابة العدد كعدد عادي، مثل 1، ليُفسَّر كعدد حقيقي، أو كنص بين علامتي اقتباس لتحديد المعاملين الحقيقي والتخيلي."
			},
			base: {
				name: "base",
				detail: "الأساس المستخدم لحساب اللوغاريتم. يجب أن يكون عدداً حقيقياً موجباً."
			}
		}
	},
	IMLOG10: {
		description: "إرجاع اللوغاريتم المشترك (الأساس 10) لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع اللوغاريتم المشترك (الأساس 10) لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imlog10-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب الذي تريد إيجاد اللوغاريتم المشترك الخاص به."
		} }
	},
	IMLOG2: {
		description: "إرجاع اللوغاريتم ذي الأساس 2 لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع اللوغاريتم ذي الأساس 2 لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imlog2-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب اللوغاريتم ذي الأساس 2 له."
		} }
	},
	IMPOWER: {
		description: "إرجاع عدد مركب بالتنسيق النصي x + yi أو x + yj مرفوعاً إلى أس.",
		abstract: "إرجاع عدد مركب بالتنسيق النصي x + yi أو x + yj مرفوعاً إلى أس.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/impower-function"
		}],
		functionParameter: {
			inumber: {
				name: "inumber",
				detail: "مطلوب. العدد المركب المراد رفعه إلى أس."
			},
			number: {
				name: "number",
				detail: "مطلوبة. الأس المراد رفع العدد المركب إليه."
			}
		}
	},
	IMPRODUCT: {
		description: "إرجاع ناتج من 1 إلى 255 عدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع ناتج من 1 إلى 255 عدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/improduct-function"
		}],
		functionParameter: {
			inumber1: {
				name: "inumber1",
				detail: "من 1 إلى 255 عدداً مركباً لضربها."
			},
			inumber2: {
				name: "inumber2",
				detail: "من 1 إلى 255 عدداً مركباً لضربها."
			}
		}
	},
	IMREAL: {
		description: "إرجاع المُعامل الحقيقي لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع المُعامل الحقيقي لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imreal-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب المُعامل الحقيقي له."
		} }
	},
	IMSEC: {
		description: "تُرجع هذه الدالة قاطع المنحنى لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		abstract: "تُرجع هذه الدالة قاطع المنحنى لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imsec-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. عدد مركب تريد من أجله أن يكون قاطعا."
		} }
	},
	IMSECH: {
		description: "تُرجع هذه الدالة قاطع المنحنى الزائدي لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		abstract: "تُرجع هذه الدالة قاطع المنحنى الزائدي لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imsech-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. عدد مركب تريد أن يكون قاطع الثواني الزائدي له."
		} }
	},
	IMSIN: {
		description: "إرجاع جيب الزاوية لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع جيب الزاوية لعدد مركب بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imsin-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. العدد المركب المراد حساب جيب الزاوية له."
		} }
	},
	IMSINH: {
		description: "ترجع الدالة IMSINH جيب الزاوية الزائدي لعدد مركب بتنسيق نص x+yi أو x+yj.",
		abstract: "ترجع الدالة IMSINH جيب الزاوية الزائدي لعدد مركب بتنسيق نص x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imsinh-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. عدد مركب تريد جيب الزاوية الزائدي له."
		} }
	},
	IMSQRT: {
		description: "ترجع الجذر التربيعي لعدد مركب.",
		abstract: "ترجع الجذر التربيعي لعدد مركب.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imsqrt-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "عدد مركب تريد حساب جذره التربيعي."
		} }
	},
	IMSUB: {
		description: "إرجاع الفرق بين عددين مركبين بالتنسيق النصي x + yi or x + yj.",
		abstract: "إرجاع الفرق بين عددين مركبين بالتنسيق النصي x + yi or x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imsub-function"
		}],
		functionParameter: {
			inumber1: {
				name: "inumber1",
				detail: "مطلوب. العدد المركب الذي يتم طرح inumber2 منه."
			},
			inumber2: {
				name: "inumber2",
				detail: "مطلوب. العدد المركب الذي يتم طرحه من inumber1."
			}
		}
	},
	IMSUM: {
		description: "إرجاع مجموع عددين مركبين أو أكثر بالتنسيق النصي x + yi أو x + yj.",
		abstract: "إرجاع مجموع عددين مركبين أو أكثر بالتنسيق النصي x + yi أو x + yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imsum-function"
		}],
		functionParameter: {
			inumber1: {
				name: "inumber1",
				detail: "من 1 إلى 255 عدداً مركباً لجمعها."
			},
			inumber2: {
				name: "inumber2",
				detail: "من 1 إلى 255 عدداً مركباً لجمعها."
			}
		}
	},
	IMTAN: {
		description: "تُرجع هذه الدالة المماس لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		abstract: "تُرجع هذه الدالة المماس لعدد مركب بالتنسيق النصي x+yi أو x+yj.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/imtan-function"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "مطلوب. عدد مركب تريد ظل الزاوية له."
		} }
	},
	IMTANH: {
		description: "ترجع الدالة IMTANH الظل الزائدي للعدد المركب المحدد. على سبيل المثال، ترجع للعدد المركب \"x+yi\" القيمة \"tanh(x+yi)\".",
		abstract: "ترجع الدالة IMTANH الظل الزائدي للعدد المركب المحدد. على سبيل المثال، ترجع للعدد المركب \"x+yi\" القيمة \"tanh(x+yi)\".",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/9366655?hl=ar"
		}],
		functionParameter: { inumber: {
			name: "inumber",
			detail: "العدد المركب الذي تريد حساب ظله الزائدي. يمكن أن يكون ناتج الدالة COMPLEX أو عدداً حقيقياً يُفسَّر كعدد مركب جزؤه التخيلي يساوي 0، أو سلسلة بالتنسيق “x+yi” حيث x وy رقميان."
		} }
	},
	OCT2BIN: {
		description: "تقوم هذه الدالة بتحويل رقم ثماني إلى رقم ثنائي.",
		abstract: "تقوم هذه الدالة بتحويل رقم ثماني إلى رقم ثنائي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/oct2bin-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الثماني الذي ترغب في تحويله. يجب ألا تحتوي الوسيطة Number على أكثر من 10 أحرف. ويُعتبر بت الإشارة في الرقم أكثر وحدات البت أهمية. وتشير وحدات البت التسع والعشرون المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "الاختياري. عدد الأحرف التي سيتم استخدامها. وفي حال تم حذف الوسيطة places، تستخدم الدالة OCT2BIN أقل عدد ممكن من الأحرف الضرورية. وتُعد الوسيطة places مفيدة لترك مساحة للقيمة المرجعة بأصفار بادئة (0)."
			}
		}
	},
	OCT2DEC: {
		description: "تقوم هذه الدالة بتحويل رقم ثماني إلى رقم عشري.",
		abstract: "تقوم هذه الدالة بتحويل رقم ثماني إلى رقم عشري.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/oct2dec-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم الثماني الذي ترغب في تحويله. يجب ألا يحتوي الرقم على أكثر من 10 أحرف ثمانية (30 بت). يُعتبر بت الإشارة أكثر وحدات البت أهمية في الرقم. وتشير وحدات البت التسع والعشرون المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
		} }
	},
	OCT2HEX: {
		description: "تقوم هذه الدالة بتحويل رقم ثماني إلى رقم سداسي عشري.",
		abstract: "تقوم هذه الدالة بتحويل رقم ثماني إلى رقم سداسي عشري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/oct2hex-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الثماني الذي ترغب في تحويله. يجب ألا يحتوي الرقم على أكثر من 10 أحرف ثمانية (30 بت). يُعتبر بت الإشارة أكثر وحدات البت أهمية في الرقم. وتشير وحدات البت التسع والعشرون المتبقية إلى بت المقدار. ويتم تمثيل الأرقام السالبة باستخدام علامة المتمم الثنائي."
			},
			places: {
				name: "places",
				detail: "الاختياري. عدد الأحرف التي سيتم استخدامها. في حالة حذف الوسيطة places، تستخدم الدالة OCT2HEX أقل عدد ممكن من الأحرف الضرورية. وتُعد الوسيطة places مفيدة لترك مساحة للقيمة المرجعة بأصفار بادئة (0)."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/financial/ar-SA.ts
const locale$9 = {
	ACCRINT: {
		description: "تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة دورية عنها.",
		abstract: "تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة دورية عنها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/accrint-function"
		}],
		functionParameter: {
			issue: {
				name: "issue",
				detail: "مطلوب. وهي تاريخ إصدار الورقة المالية."
			},
			firstInterest: {
				name: "first_interest",
				detail: "مطلوب. وهي تاريخ أول فائدة للورقة المالية."
			},
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية."
			},
			par: {
				name: "par",
				detail: "مطلوب. وهي قيمة سعر التداول للورقة المالية. إذا تم إهمال سعر التداول، فستستخدم الدالة ACCRINT القيمة 1000 ر.س.."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			},
			calcMethod: {
				name: "calc_method",
				detail: "الاختياري. وهي قيمة منطقية تحدد طريقة حساب الفائدة المستحقة الإجمالية عند تأخر تاريخ التسوية عن تاريخ first_interest. تُرجع قيمة TRUE (1)‎ الفائدة المستحقة الإجمالية من الإصدار إلى التسوية. وتُرجع قيمة FALSE (0)‎ الفائدة المستحقة من first_interest إلى التسوية. إذا لم تُدخل قيمة الوسيطة، فسيتم تعيينها بشكلٍ افتراضي إلى TRUE."
			}
		}
	},
	ACCRINTM: {
		description: "تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة عنها في موعد الاستحقاق.",
		abstract: "تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة عنها في موعد الاستحقاق.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/accrintm-function"
		}],
		functionParameter: {
			issue: {
				name: "issue",
				detail: "مطلوب. وهي تاريخ إصدار الورقة المالية."
			},
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية."
			},
			par: {
				name: "par",
				detail: "مطلوب. وهي قيمة سعر التداول للورقة المالية. إذا تم إهمال سعر التداول، فستستخدم الدالة ACCRINTM القيمة 1000 ر.س.."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	AMORDEGRC: {
		description: "تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فيتم وضع الإهلاك المقسم بالتناسب في الاعتبار. تتشابه هذه الدالة مع الدالة AMORLINC، باستثناء أنه يتم تطبيق معامل الإهلاك على الحساب استناداً إلى فترة عمر الأصول.",
		abstract: "تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فيتم وضع الإهلاك المقسم بالتناسب في الاعتبار. تتشابه هذه الدالة مع الدالة AMORLINC، باستثناء أنه يتم تطبيق معامل الإهلاك على الحساب استناداً إلى فترة عمر الأصول.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/amordegrc-function"
		}],
		functionParameter: {
			cost: {
				name: "cost",
				detail: "مطلوب. وهي تكلفة الأصل."
			},
			datePurchased: {
				name: "date_purchased",
				detail: "مطلوب. وهي تاريخ شراء الأصل."
			},
			firstPeriod: {
				name: "first_period",
				detail: "مطلوب. وهي تاريخ نهاية الفترة الأولى."
			},
			salvage: {
				name: "salvage",
				detail: "مطلوب. وهي القيمة الباقية في نهاية فترة عمر الأصل."
			},
			period: {
				name: "period",
				detail: "مطلوب. وهي الفترة الزمنية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. وهي معدل الإهلاك."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي أساس حساب السنة المستخدم."
			}
		}
	},
	AMORLINC: {
		description: "تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فإنه يتم وضع الإهلاك المقسم بالتناسب في الاعتبار.",
		abstract: "تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فإنه يتم وضع الإهلاك المقسم بالتناسب في الاعتبار.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/amorlinc-function"
		}],
		functionParameter: {
			cost: {
				name: "cost",
				detail: "مطلوب. وهي تكلفة الأصل."
			},
			datePurchased: {
				name: "date_purchased",
				detail: "مطلوب. وهي تاريخ شراء الأصل."
			},
			firstPeriod: {
				name: "first_period",
				detail: "مطلوب. وهي تاريخ نهاية الفترة الأولى."
			},
			salvage: {
				name: "salvage",
				detail: "مطلوب. وهي القيمة الباقية في نهاية فترة عمر الأصل."
			},
			period: {
				name: "period",
				detail: "مطلوب. وهي الفترة الزمنية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. وهي معدل الإهلاك."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي أساس حساب السنة المستخدم."
			}
		}
	},
	COUPDAYBS: {
		description: "تُرجع الدالة COUPDAYBS عدد الأيام من بداية فترة القسيمة وحتى تاريخ التسوية الخاص بها.",
		abstract: "تُرجع الدالة COUPDAYBS عدد الأيام من بداية فترة القسيمة وحتى تاريخ التسوية الخاص بها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/coupdaybs-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	COUPDAYS: {
		description: "تُرجع عدد الأيام في فترة القسيمة التي تتضمن تاريخ التسوية.",
		abstract: "تُرجع عدد الأيام في فترة القسيمة التي تتضمن تاريخ التسوية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/coupdays-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	COUPDAYSNC: {
		description: "تُرجع عدد الأيام بدايةً من تاريخ التسوية وحتى تاريخ القسيمة التالي.",
		abstract: "تُرجع عدد الأيام بدايةً من تاريخ التسوية وحتى تاريخ القسيمة التالي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/coupdaysnc-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	COUPNCD: {
		description: "تُرجع رقماً يمثل تاريخ القسيمة التالي بعد تاريخ التسوية.",
		abstract: "تُرجع رقماً يمثل تاريخ القسيمة التالي بعد تاريخ التسوية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/coupncd-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	COUPNUM: {
		description: "تُرجع عدد القسائم المستحقة الدفع بين تاريخ التسوية وتاريخ الاستحقاق، مقرباً للأعلى إلى أقرب عدد صحيح للقسيمة.",
		abstract: "تُرجع عدد القسائم المستحقة الدفع بين تاريخ التسوية وتاريخ الاستحقاق، مقرباً للأعلى إلى أقرب عدد صحيح للقسيمة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/coupnum-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	COUPPCD: {
		description: "تُرجع رقماً يمثل تاريخ القسيمة السابق قبل تاريخ التسوية.",
		abstract: "تُرجع رقماً يمثل تاريخ القسيمة السابق قبل تاريخ التسوية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/couppcd-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	CUMIPMT: {
		description: "تُرجع الفائدة التراكمية المدفوعة لقرض بين end_period وstart_period.",
		abstract: "تُرجع الفائدة التراكمية المدفوعة لقرض بين end_period وstart_period.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cumipmt-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. وهي معدل الفائدة."
			},
			nper: {
				name: "nper",
				detail: "مطلوب. وهي العدد الإجمالي لفترات دفعات السداد."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. القيمة الحالية."
			},
			startPeriod: {
				name: "start_period",
				detail: "مطلوب. وهي الفترة الأولى في الحساب. يتم ترقيم فترات دفعات السداد بدءاً بـ 1."
			},
			endPeriod: {
				name: "end_period",
				detail: "مطلوب. وهي الفترة الأخيرة في الحساب."
			},
			type: {
				name: "type",
				detail: "مطلوب. وهي توقيت الدفع."
			}
		}
	},
	CUMPRINC: {
		description: "تُرجع رأس المال التراكمي المدفوع لقرض بين start_period وend_period.",
		abstract: "تُرجع رأس المال التراكمي المدفوع لقرض بين start_period وend_period.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cumprinc-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. وهي معدل الفائدة."
			},
			nper: {
				name: "nper",
				detail: "مطلوب. وهي العدد الإجمالي لفترات دفعات السداد."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. القيمة الحالية."
			},
			startPeriod: {
				name: "start_period",
				detail: "مطلوب. وهي الفترة الأولى في الحساب. يتم ترقيم فترات دفعات السداد بدءاً بـ 1."
			},
			endPeriod: {
				name: "end_period",
				detail: "مطلوب. وهي الفترة الأخيرة في الحساب."
			},
			type: {
				name: "type",
				detail: "مطلوب. وهي توقيت الدفع."
			}
		}
	},
	DB: {
		description: "تُرجع هذه الدالة إهلاك أصول لفترة معينة باستخدام أسلوب الرصيد المتناقص الثابت.",
		abstract: "تُرجع هذه الدالة إهلاك أصول لفترة معينة باستخدام أسلوب الرصيد المتناقص الثابت.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/db-function"
		}],
		functionParameter: {
			cost: {
				name: "cost",
				detail: "مطلوب. التكلفة الأولية للأصول."
			},
			salvage: {
				name: "salvage",
				detail: "مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول)."
			},
			life: {
				name: "life",
				detail: "مطلوب. عدد الفترات التي يتم فيها إهلاك الأصل (تسمى أحياناً العمر الإنتاجي للأصل)."
			},
			period: {
				name: "period",
				detail: "مطلوب. الفترة التي تريد حساب الإهلاك فيها. يجب أن تستخدم الوسيطة Period الوحدات نفسها التي تستخدمها الوسيطة life."
			},
			month: {
				name: "month",
				detail: "الاختياري. عدد الأشهر في السنة الأولى. في حال حذف الوسيطة month، يفترض أنها تساوي 12."
			}
		}
	},
	DDB: {
		description: "تُرجع هذه الدالة إهلاك الأصول لفترة معينة باستخدام طريقة الرصيد المتناقص المزدوج أو طريقة أخرى تحددها.",
		abstract: "تُرجع هذه الدالة إهلاك الأصول لفترة معينة باستخدام طريقة الرصيد المتناقص المزدوج أو طريقة أخرى تحددها.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ddb-function"
		}],
		functionParameter: {
			cost: {
				name: "cost",
				detail: "مطلوب. التكلفة الأولية للأصول."
			},
			salvage: {
				name: "salvage",
				detail: "مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول). قد تكون هذه القيمة 0."
			},
			life: {
				name: "life",
				detail: "مطلوب. عدد الفترات التي يتم فيها إهلاك الأصل (تسمى أحياناً العمر الإنتاجي للأصل)."
			},
			period: {
				name: "period",
				detail: "مطلوب. الفترة التي تريد حساب الإهلاك فيها. يجب أن تستخدم الوسيطة Period الوحدات نفسها التي تستخدمها الوسيطة life."
			},
			factor: {
				name: "factor",
				detail: "الاختياري. المعدل الذي تتراجع عنده الميزانية. إذا تم حذف الوسيطة factor، فسيفترض أنها 2 (أسلوب الاستهلاك المتناقص المزدوج)."
			}
		}
	},
	DISC: {
		description: "تُرجع هذه الدالة معدل الخصم لورقة المالية.",
		abstract: "تُرجع هذه الدالة معدل الخصم لورقة المالية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/disc-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			pr: {
				name: "pr",
				detail: "مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	DOLLARDE: {
		description: "تحوّل هذه الدالة سعر دولار يتم التعبير عنه كجزء من عدد صحيح وجزء كسر، مثل 1.02، إلى سعر دولار يتم التعبير عنه كرقم عشري. تُستخدم أرقام الدولار الكسرية أحياناً في أسعار الأوراق المالية.",
		abstract: "تحوّل هذه الدالة سعر دولار يتم التعبير عنه كجزء من عدد صحيح وجزء كسر، مثل 1.02، إلى سعر دولار يتم التعبير عنه كرقم عشري. تُستخدم أرقام الدولار الكسرية أحياناً في أسعار الأوراق المالية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dollarde-function"
		}],
		functionParameter: {
			fractionalDollar: {
				name: "fractional_dollar",
				detail: "مطلوب. رقم يتم التعبير عنه كجزء من عدد صحيح وجزء كسر، مفصول برمز عشري."
			},
			fraction: {
				name: "fraction",
				detail: "مطلوب. العدد الصحيح الذي تريد استخدامه في مقام الكسر."
			}
		}
	},
	DOLLARFR: {
		description: "استخدم DOLLARFR لتحويل أرقام عشرية إلى أرقام دولار عشرية، مثل أسعار الأوراق المالية.",
		abstract: "استخدم DOLLARFR لتحويل أرقام عشرية إلى أرقام دولار عشرية، مثل أسعار الأوراق المالية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dollarfr-function"
		}],
		functionParameter: {
			decimalDollar: {
				name: "decimal_dollar",
				detail: "مطلوب. رقم عشري."
			},
			fraction: {
				name: "fraction",
				detail: "مطلوب. العدد الصحيح المستخدم في مقام الكسر."
			}
		}
	},
	DURATION: {
		description: "ترجع الدالة DURATION ، إحدى الدالات المالية ، مدة ماكاوولي لقيمة مفترضة من نفس القيمة تبلغ 100 دولار. وتعرف المدة كمتوسط مرجح للقيمة الحالية للتدفقات النقدية، وتستخدم كمقياس لاستجابة سعر السند للتغيرات في العائد.",
		abstract: "ترجع الدالة DURATION ، إحدى الدالات المالية ، مدة ماكاوولي لقيمة مفترضة من نفس القيمة تبلغ 100 دولار. وتعرف المدة كمتوسط مرجح للقيمة الحالية للتدفقات النقدية، وتستخدم كمقياس لاستجابة سعر السند للتغيرات في العائد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/duration-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			coupon: {
				name: "coupon",
				detail: "مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية."
			},
			yld: {
				name: "yld",
				detail: "مطلوب. العائد السنوي للورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	EFFECT: {
		description: "تُرجع معدل الفائدة السنوي الساري المفعول، بالنظر إلى معدل الفائدة السنوي الاسمي وعدد الفترات المتراكبة في السنة.",
		abstract: "تُرجع معدل الفائدة السنوي الساري المفعول، بالنظر إلى معدل الفائدة السنوي الاسمي وعدد الفترات المتراكبة في السنة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/effect-function"
		}],
		functionParameter: {
			nominalRate: {
				name: "nominal_rate",
				detail: "مطلوب. معدل الفائدة الاسمي."
			},
			npery: {
				name: "npery",
				detail: "مطلوب. عدد الفترات المتراكبة كل سنة."
			}
		}
	},
	FV: {
		description: "تحسب الدالة FV ، وهي إحدى الدالات المالية ، القيمة المستقبلية للاستثمار استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام FV مع إما الدفعات الدورية الثابتة أو دفعة واحدة من المبلغ الإجمالي.",
		abstract: "تحسب الدالة FV ، وهي إحدى الدالات المالية ، القيمة المستقبلية للاستثمار استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام FV مع إما الدفعات الدورية الثابتة أو دفعة واحدة من المبلغ الإجمالي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/fv-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الفائدة لكل فترة زمنية."
			},
			nper: {
				name: "nper",
				detail: "مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري."
			},
			pmt: {
				name: "pmt",
				detail: "مطلوب. الدفعة التي تم سدادها في كل فترة؛ لا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي الوسيطة pmt عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى. إذا تم حذف pmt، فيجب تضمين الوسيطة pv."
			},
			pv: {
				name: "pv",
				detail: "الاختياري. القيمة الحالية، أو مقدار المبلغ الإجمالي الذي تساويه سلسلة دفعات مستقبلية في الوقت الحالي. إذا تم حذف pv، فسيتم افتراض أنها 0 (صفر)، وعليك تضمين الوسيطة pmt."
			},
			type: {
				name: "type",
				detail: "الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات. إذا تم حذف الوسيطة type، فسيتم افتراض أنها 0."
			}
		}
	},
	FVSCHEDULE: {
		description: "تُرجع القيمة المستقبلية لرأس مال أولي بعد تطبيق سلسلة من معدلات الفائدة المركبة. استخدم FVSCHEDULE لحساب القيمة المستقبلية لاستثمار بمعدل متغير أو قابل للتعديل.",
		abstract: "تُرجع القيمة المستقبلية لرأس مال أولي بعد تطبيق سلسلة من معدلات الفائدة المركبة. استخدم FVSCHEDULE لحساب القيمة المستقبلية لاستثمار بمعدل متغير أو قابل للتعديل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/fvschedule-function"
		}],
		functionParameter: {
			principal: {
				name: "principal",
				detail: "مطلوب. القيمة الحالية."
			},
			schedule: {
				name: "schedule",
				detail: "مطلوب. صفيف معدلات الفائدة التي تريد تطبيقها."
			}
		}
	},
	INTRATE: {
		description: "تُرجع هذه الدالة معدل الفائدة لورقة مالية تم استثمارها بالكامل.",
		abstract: "تُرجع هذه الدالة معدل الفائدة لورقة مالية تم استثمارها بالكامل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/intrate-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			investment: {
				name: "investment",
				detail: "مطلوب. المبلغ المستثمر في الورقة المالية."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. المبلغ المستلم عند الاستحقاق."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	IPMT: {
		description: "تُرجع هذه الدالة دفعة الفائدة لفترة استثمار محددة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.",
		abstract: "تُرجع هذه الدالة دفعة الفائدة لفترة استثمار محددة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ipmt-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الفائدة لكل فترة زمنية."
			},
			per: {
				name: "per",
				detail: "مطلوب. الفترة التي تريد البحث عن الفائدة الخاصة بها ويجب أن تكون في النطاق من 1 إلى nper."
			},
			nper: {
				name: "nper",
				detail: "مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. القيمة الحالية، أو مقدار المبلغ الإجمالي الذي تساويه سلسلة دفعات مستقبلية في الوقت الحالي."
			},
			fv: {
				name: "fv",
				detail: "الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيُفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي 0)."
			},
			type: {
				name: "type",
				detail: "الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات. إذا تم حذف الوسيطة type، فسيتم افتراض أنها 0."
			}
		}
	},
	IRR: {
		description: "تُرجع هذه الدالة نسبة العائد الداخلي لسلسلة التدفقات النقدية الممثلة بواسطة الأرقام في القيم. من غير الضروري أن تكون هذه التدفقات النقدية متساوية، كما هي في المرتب الدوري. ومع ذلك، يجب أن تحدث التدفقات النقدية على فترات زمنية منتظمة، شهرية أو سنوية مثلاً. إن نسبة العائد الداخلي هي معدل الفائدة التي يتم استلامها لاستثمار يتألف من دفعات (قيم سالبة) وإيرادات (قيم موجبة) تحدث على فترات منتظمة.",
		abstract: "تُرجع هذه الدالة نسبة العائد الداخلي لسلسلة التدفقات النقدية الممثلة بواسطة الأرقام في القيم. من غير الضروري أن تكون هذه التدفقات النقدية متساوية، كما هي في المرتب الدوري. ومع ذلك، يجب أن تحدث التدفقات النقدية على فترات زمنية منتظمة، شهرية أو سنوية مثلاً. إن نسبة العائد الداخلي هي معدل الفائدة التي يتم استلامها لاستثمار يتألف من دفعات (قيم سالبة) وإيرادات (قيم موجبة) تحدث على فترات منتظمة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/irr-function"
		}],
		functionParameter: {
			values: {
				name: "values",
				detail: "صفيف أو مرجع إلى خلايا تحتوي على أرقام تريد حساب معدل العائد الداخلي لها.\n1. يجب أن تحتوي values على قيمة موجبة واحدة وقيمة سالبة واحدة على الأقل لحساب معدل العائد الداخلي.\n2. تستخدم IRR ترتيب القيم لتفسير ترتيب التدفقات النقدية؛ أدخل قيم الدفعات والإيرادات بالتسلسل الذي تريده.\n3. إذا احتوت وسيطة صفيف أو مرجع على نص أو قيم منطقية أو خلايا فارغة، فتُتجاهل تلك القيم."
			},
			guess: {
				name: "guess",
				detail: "رقم تخمّن أنه قريب من نتيجة IRR."
			}
		}
	},
	ISPMT: {
		description: "حساب الفائدة المدفوعة (أو المستلمة) للفترة المحددة للقرض (أو الاستثمار) مع حتى المدفوعات الرئيسية.",
		abstract: "حساب الفائدة المدفوعة (أو المستلمة) للفترة المحددة للقرض (أو الاستثمار) مع حتى المدفوعات الرئيسية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ispmt-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوبة. معدل الفائدة للاستثمار."
			},
			per: {
				name: "per",
				detail: "مطلوبة. الفترة التي تريد العثور على الفائدة لها، ويجب أن تكون بين 1 وNper."
			},
			nper: {
				name: "nper",
				detail: "مطلوبة. العدد الإجمالي لفترات الدفع للاستثمار."
			},
			pv: {
				name: "pv",
				detail: "مطلوبة. القيمة الحالية للاستثمار. بالنسبة للقرض، Pv هو مبلغ القرض."
			}
		}
	},
	MDURATION: {
		description: "تُرجع هذه الدالة الفترة الزمنية المعدلة لماكولي لورقة مالية لها سعر تعادل افتراضي يساوي 100 ر.س..",
		abstract: "تُرجع هذه الدالة الفترة الزمنية المعدلة لماكولي لورقة مالية لها سعر تعادل افتراضي يساوي 100 ر.س..",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mduration-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			coupon: {
				name: "coupon",
				detail: "مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية."
			},
			yld: {
				name: "yld",
				detail: "مطلوب. العائد السنوي للورقة المالية."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	MIRR: {
		description: "تُرجع هذه الدالة نسبة العائد الداخلي المعدّلة لسلسلة من التدفقات النقدية الدورية. تأخذ MIRR في الاعتبار كلاً من تكلفة الاستثمار والفائدة المستلمة عند إعادة استثمار النقد.",
		abstract: "تُرجع هذه الدالة نسبة العائد الداخلي المعدّلة لسلسلة من التدفقات النقدية الدورية. تأخذ MIRR في الاعتبار كلاً من تكلفة الاستثمار والفائدة المستلمة عند إعادة استثمار النقد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mirr-function"
		}],
		functionParameter: {
			values: {
				name: "values",
				detail: "مطلوب. صفيف أو مرجع إلى خلايا تحتوي على أرقام. تمثل هذه الأرقام سلسلة من الدفعات (قيم سالبة) والإيرادات (قيم موجبة) التي تحدث على فترات منتظمة. يجب أن تحتوي القيم على قيمة موجبة واحدة على الأقل وقيمة سالبة واحدة لحساب معدل العائد الداخلي المعدل. وإلا، فترجع الدالة MIRR #DIV/0! وهي قيمة خطأ. إذا احتوت وسيطة صفيف أو مرجع على نص أو قيم منطقية أو خلايا فارغة، فيتم تجاهل تلك القيم؛ وبالرغم من ذلك، يتم تضمين الخلايا التي تحتوي على قيمة الصفر (0)."
			},
			financeRate: {
				name: "finance_rate",
				detail: "مطلوب. نسبة الفائدة التي تدفعها على النقود المستخدمة في التدفقات النقدية."
			},
			reinvestRate: {
				name: "reinvest_rate",
				detail: "مطلوب. نسبة الفائدة التي تتلقاها على التدفقات النقدية عند إعادة استثمارها."
			}
		}
	},
	NOMINAL: {
		description: "تُرجع هذه الدالة النسبة الاسمية السنوية للفائدة وفقاً لنسبة الفائدة الفعلية وعدد الفترات المتراكبة كل سنة.",
		abstract: "تُرجع هذه الدالة النسبة الاسمية السنوية للفائدة وفقاً لنسبة الفائدة الفعلية وعدد الفترات المتراكبة كل سنة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/nominal-function"
		}],
		functionParameter: {
			effectRate: {
				name: "effect_rate",
				detail: "مطلوب. نسبة الفائدة الفعلية."
			},
			npery: {
				name: "npery",
				detail: "مطلوب. عدد الفترات المتراكبة كل سنة."
			}
		}
	},
	NPER: {
		description: "تُرجع هذه الدالة عدد فترات الاستثمار استناداً إلى دفعات ثابتة دورية ومعدل فائدة ثابت.",
		abstract: "تُرجع هذه الدالة عدد فترات الاستثمار استناداً إلى دفعات ثابتة دورية ومعدل فائدة ثابت.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/nper-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الفائدة لكل فترة زمنية."
			},
			pmt: {
				name: "pmt",
				detail: "مطلوب. الدفعة التي تم سدادها في كل فترة؛ لا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي الوسيطة pmt عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. القيمة الحالية، أو مقدار المبلغ الإجمالي الذي تساويه سلسلة دفعات مستقبلية في الوقت الحالي."
			},
			fv: {
				name: "fv",
				detail: "الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيُفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي 0)."
			},
			type: {
				name: "type",
				detail: "الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات."
			}
		}
	},
	NPV: {
		description: "تحسب هذه الدالة القيمة الحالية الصافية للاستثمار باستخدام معدل الخصم وسلسلة من الدفعات المستقبلية (قيم سالبة) والإيرادات (قيم موجبة).",
		abstract: "تحسب هذه الدالة القيمة الحالية الصافية للاستثمار باستخدام معدل الخصم وسلسلة من الدفعات المستقبلية (قيم سالبة) والإيرادات (قيم موجبة).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/npv-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الخصم على مدار طول فترة واحدة."
			},
			value1: {
				name: "value1",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. تمثل الوسيطات من 1 إلى 254 الدفعات والإيرادات. يجب أن تكون Value1, value2, ...‎ على فترات متساوية من الوقت وأن تحدث في نهاية كل فترة. تستخدم الدالة NPV ترتيب value1, value2,...‎ لتفسير ترتيب التدفقات النقدية. تأكد من إدخال قيم الدفعات والإيرادات بالتسلسل الصحيح. سيتم تجاهل الوسيطات إذا كانت عبارة عن خلايا فارغة أو قيم منطقية أو تمثيلات نصية للأرقام أو قيم خطأ أو نص لا يمكن ترجمته إلى أرقام. إذا كانت الوسيطة عبارة عن صفيف أو مرجع، يتم حساب الأرقام الموجودة في ذلك الصفيف أو المرجع فقط. ويتم تجاهل الخلايا الفارغة أو القيم المنطقية أو النص أو قيم الخطأ في الصفيف أو المرجع."
			},
			value2: {
				name: "value2",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. تمثل الوسيطات من 1 إلى 254 الدفعات والإيرادات. يجب أن تكون Value1, value2, ...‎ على فترات متساوية من الوقت وأن تحدث في نهاية كل فترة. تستخدم الدالة NPV ترتيب value1, value2,...‎ لتفسير ترتيب التدفقات النقدية. تأكد من إدخال قيم الدفعات والإيرادات بالتسلسل الصحيح. سيتم تجاهل الوسيطات إذا كانت عبارة عن خلايا فارغة أو قيم منطقية أو تمثيلات نصية للأرقام أو قيم خطأ أو نص لا يمكن ترجمته إلى أرقام. إذا كانت الوسيطة عبارة عن صفيف أو مرجع، يتم حساب الأرقام الموجودة في ذلك الصفيف أو المرجع فقط. ويتم تجاهل الخلايا الفارغة أو القيم المنطقية أو النص أو قيم الخطأ في الصفيف أو المرجع."
			}
		}
	},
	ODDFPRICE: {
		description: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).",
		abstract: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/oddfprice-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			issue: {
				name: "issue",
				detail: "مطلوب. وهي تاريخ إصدار الورقة المالية."
			},
			firstCoupon: {
				name: "first_coupon",
				detail: "مطلوب. تاريخ القسيمة الأولى للورقة المالية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. معدل فائدة الورقة المالية."
			},
			yld: {
				name: "yld",
				detail: "مطلوب. العائد السنوي للورقة المالية."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	ODDFYIELD: {
		description: "تُرجع هذه الدالة عائد ورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).",
		abstract: "تُرجع هذه الدالة عائد ورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/oddfyield-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			issue: {
				name: "issue",
				detail: "مطلوب. وهي تاريخ إصدار الورقة المالية."
			},
			firstCoupon: {
				name: "first_coupon",
				detail: "مطلوب. تاريخ القسيمة الأولى للورقة المالية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. معدل فائدة الورقة المالية."
			},
			pr: {
				name: "pr",
				detail: "مطلوب. سعر الورقة المالية."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	ODDLPRICE: {
		description: "ترجع السعر لكل قيمة اسمية قدرها 100 دولار لسند ذي فترة أخيرة غير منتظمة.",
		abstract: "ترجع السعر لكل قيمة اسمية قدرها 100 دولار لسند ذي فترة أخيرة غير منتظمة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/oddlprice-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "تاريخ تسوية الورقة المالية."
			},
			maturity: {
				name: "maturity",
				detail: "تاريخ استحقاق الورقة المالية."
			},
			lastInterest: {
				name: "last_interest",
				detail: "تاريخ آخر قسيمة للورقة المالية."
			},
			rate: {
				name: "rate",
				detail: "سعر فائدة الورقة المالية."
			},
			yld: {
				name: "yld",
				detail: "العائد السنوي للورقة المالية."
			},
			redemption: {
				name: "redemption",
				detail: "قيمة استرداد الورقة المالية لكل 100 دولار من القيمة الاسمية."
			},
			frequency: {
				name: "frequency",
				detail: "عدد دفعات القسيمة في السنة. للدفعات السنوية يكون frequency = 1، ولنصف السنوية = 2، وللربع سنوية = 4."
			},
			basis: {
				name: "basis",
				detail: "نوع أساس احتساب الأيام المراد استخدامه."
			}
		}
	},
	ODDLYIELD: {
		description: "تُرجع هذه الدالة عائد ورقة مالية في الجزء الأخير من فترة كلية (قصيرة أو طويلة).",
		abstract: "تُرجع هذه الدالة عائد ورقة مالية في الجزء الأخير من فترة كلية (قصيرة أو طويلة).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/oddlyield-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			lastInterest: {
				name: "last_interest",
				detail: "مطلوب. تاريخ القسيمة الأخيرة للورقة المالية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. معدل فائدة الورقة المالية."
			},
			pr: {
				name: "pr",
				detail: "مطلوب. سعر الورقة المالية."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	PDURATION: {
		description: "تُرجع هذه الدالة عدد الفترات التي يتطلبها استثمار من أجل تحقيق قيمة محددة.",
		abstract: "تُرجع هذه الدالة عدد الفترات التي يتطلبها استثمار من أجل تحقيق قيمة محددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/pduration-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. السعر هو معدل الفائدة لكل فترة زمنية."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. Pv هي القيمة الحالية للاستثمار."
			},
			fv: {
				name: "fv",
				detail: "مطلوب. Fv هي القيمة المستقبلية المطلوبة للاستثمار."
			}
		}
	},
	PMT: {
		description: "تحسب الدالة PMT ، وهي إحدى الدالات المالية ، الدفعة لتسديد قرض استناداً إلى الدفعات الثابتة ونسبة فائدة ثابتة.",
		abstract: "تحسب الدالة PMT ، وهي إحدى الدالات المالية ، الدفعة لتسديد قرض استناداً إلى الدفعات الثابتة ونسبة فائدة ثابتة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/pmt-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الفائدة للقرض."
			},
			nper: {
				name: "nper",
				detail: "مطلوب. العدد الإجمالي لدفعات تسديد القرض."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. القيمة الحالية، أو المبلغ الإجمالي الذي تساويه سلسلة الدفعات المستقبلية الآن؛ وتُعرف أيضاً برأس المال."
			},
			fv: {
				name: "fv",
				detail: "الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف fv، فسيفترض أنها 0 (صفر)، أي أن القيمة المستقبلية لقرض مثلاً تساوي صفر."
			},
			type: {
				name: "type",
				detail: "الاختياري. الرقم 0 (صفر) أو 1 وهي تشير إلى موعد استحقاق الدفعات."
			}
		}
	},
	PPMT: {
		description: "تُرجع الدفعة لرأس المال لفترة استثمار معينة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.",
		abstract: "تُرجع الدفعة لرأس المال لفترة استثمار معينة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ppmt-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الفائدة لكل فترة زمنية."
			},
			per: {
				name: "per",
				detail: "مطلوب. تحدد الفترة ويجب أن تقع في النطاق بين 1 وقيمة nper."
			},
			nper: {
				name: "nper",
				detail: "مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. القيمة الحالية، أو المبلغ الإجمالي الذي تساويه سلسلة الدفعات المستقبلية الآن."
			},
			fv: {
				name: "fv",
				detail: "الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف fv، فسيفترض أنها 0 (صفر)، أي أن القيمة المستقبلية لقرض مثلاً تساوي صفر."
			},
			type: {
				name: "type",
				detail: "الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات."
			}
		}
	},
	PRICE: {
		description: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تستحق عنها فائدة دورية.",
		abstract: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تستحق عنها فائدة دورية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/price-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية."
			},
			yld: {
				name: "yld",
				detail: "مطلوب. العائد السنوي للورقة المالية."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	PRICEDISC: {
		description: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية ذات خصم.",
		abstract: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية ذات خصم.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/pricedisc-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			discount: {
				name: "discount",
				detail: "مطلوب. معدل الخصم على الورقة المالية."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	PRICEMAT: {
		description: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تُدفع فائدتها عند الاستحقاق.",
		abstract: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تُدفع فائدتها عند الاستحقاق.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/pricemat-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			issue: {
				name: "issue",
				detail: "مطلوب. تاريخ إصدار الورقة المالية، ويتم التعبير عنه برقم تاريخ تسلسلي."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. معدل فائدة الورقة المالية عند تاريخ الإصدار."
			},
			yld: {
				name: "yld",
				detail: "مطلوب. العائد السنوي للورقة المالية."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	PV: {
		description: "تحسب الدالة PV ، وهي إحدى الدالات المالية ، القيمة الحالية لقرض أو استثمار، وذلك استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام الدالة PV مع إما الدفعات الدورية الثابتة (مثل رهن أو أي قرض آخر) أو أية قيمة مستقبلية تشكل هدفك الاستثماري.",
		abstract: "تحسب الدالة PV ، وهي إحدى الدالات المالية ، القيمة الحالية لقرض أو استثمار، وذلك استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام الدالة PV مع إما الدفعات الدورية الثابتة (مثل رهن أو أي قرض آخر) أو أية قيمة مستقبلية تشكل هدفك الاستثماري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/pv-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الفائدة لكل فترة زمنية. على سبيل المثال، إذا حصلت على قرض لشراء سيارة بمعدل فائدة سنوية 10% وكان عليك تسديد الدفعات شهرياً، فسيكون معدل الفائدة لكل شهر 12/%10 أو %0,83. يمكنك إدخال 12/%10 أو %0,83 أو 0,0083 في الصيغة كمعدل الفائدة."
			},
			nper: {
				name: "nper",
				detail: "مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري. على سبيل المثال، إذا حصلت على قرض مدته 4 سنوات لشراء سيارة وكان عليك تسديد الدفعات شهرياً، فسيكون القرض عبارة عن 4*12 (أو 48) فترة زمنية. وعليك إدخال 48 في الصيغة للوسيطة nper."
			},
			pmt: {
				name: "pmt",
				detail: "مطلوب. الدفعة التي تم تسديدها في كل فترة ولا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي الوسيطة pmt عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى. على سبيل المثال، سيكون عليك تسديد دفعات شهرية قيمتها 263,33 ر.س. مقابل قرض قيمته 10000 ر.س. ومدته 4 سنوات لشراء سيارة بمعدل فائدة 12%. يمكنك إدخال -263.33 في الصيغة ك pmt. إذا تم حذف pmt، يجب تضمين الوسيطة fv."
			},
			fv: {
				name: "fv",
				detail: "الاختياري. القيمة المستقبلية أو الرصيد النقدي الذي تريد تحقيقه بعد إجراء الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيُفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي 0). على سبيل المثال، إذا كنت تريد ادخار مبلغ 50000 ر.س. لتدفعه لمشروع خاص خلال 18 عاماً، فتكون القيمة المستقبلية 50000 ر.س.. يمكنك حينئذٍ إجراء تخمين متحفظ في ما يتعلق بمعدل الفائدة وتحديد المبلغ الذي يجب أن تدّخره كل شهر. إذا تم حذف الوسيطة fv، فيجب تضمين الوسيطة pmt."
			},
			type: {
				name: "type",
				detail: "الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات."
			}
		}
	},
	RATE: {
		description: "إرجاع معدل الفائدة لكل فترة من فترات المرتب الدوري. يتم حساب RATE من خلال التكرار ويمكن أن يكون لها حلول صفرية أو أكثر. إذا كانت نتائج RATE المتتالية لا تتقارب إلى 0.0000001 بعد 20 مرة، تقوم RATE بإرجاع #NUM! قيمة الخطأ.",
		abstract: "إرجاع معدل الفائدة لكل فترة من فترات المرتب الدوري. يتم حساب RATE من خلال التكرار ويمكن أن يكون لها حلول صفرية أو أكثر. إذا كانت نتائج RATE المتتالية لا تتقارب إلى 0.0000001 بعد 20 مرة، تقوم RATE بإرجاع #NUM! قيمة الخطأ.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rate-function"
		}],
		functionParameter: {
			nper: {
				name: "nper",
				detail: "مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري."
			},
			pmt: {
				name: "pmt",
				detail: "مطلوب. الدفعة التي تم تسديدها في كل فترة ولا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي وسيطة الدفعة عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى. إذا تم حذف الوسيطة pmt، فيجب تضمين الوسيطة fv."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. القيمة الحالية، أو المبلغ الإجمالي الذي تساويه سلسلة الدفعات المستقبلية الآن."
			},
			fv: {
				name: "fv",
				detail: "الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي صفر). إذا تم حذف الوسيطة fv، فيجب تضمين الوسيطة pmt."
			},
			type: {
				name: "type",
				detail: "الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات."
			},
			guess: {
				name: "guess",
				detail: "الاختياري. تقديرك لقيمة المعدل. إذا تم حذف الوسيطة guess، فسيُفترض أنها 10 بالمئة. إذا لم تتقارب نتائج الدالة RATE، فحاول استخدام قيم مختلفة للوسيطة guess. تتقارب نتائج الدالة RATE عادةً إذا كانت قيمة guess بين 0 و1."
			}
		}
	},
	RECEIVED: {
		description: "تُرجع هذه الدالة المبلغ الذي يتم استلامه عند استحقاق ورقة مالية تم استثمارها بالكامل.",
		abstract: "تُرجع هذه الدالة المبلغ الذي يتم استلامه عند استحقاق ورقة مالية تم استثمارها بالكامل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/received-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			investment: {
				name: "investment",
				detail: "مطلوب. المبلغ المستثمر في الورقة المالية."
			},
			discount: {
				name: "discount",
				detail: "مطلوب. معدل الخصم على الورقة المالية."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	RRI: {
		description: "تُرجع هذه الدالة معدل فائدة يكون مكافئاً لنمو الاستثمار.",
		abstract: "تُرجع هذه الدالة معدل فائدة يكون مكافئاً لنمو الاستثمار.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rri-function"
		}],
		functionParameter: {
			nper: {
				name: "nper",
				detail: "مطلوب. Nper هو عدد فترات الاستثمار."
			},
			pv: {
				name: "pv",
				detail: "مطلوب. Pv هي القيمة الحالية للاستثمار."
			},
			fv: {
				name: "fv",
				detail: "مطلوب. Fv هي القيمة المستقبلية للاستثمار."
			}
		}
	},
	SLN: {
		description: "تُرجع هذه الدالة الإهلاك بالقسط الثابت لأحد الأصول لفترة واحدة.",
		abstract: "تُرجع هذه الدالة الإهلاك بالقسط الثابت لأحد الأصول لفترة واحدة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sln-function"
		}],
		functionParameter: {
			cost: {
				name: "cost",
				detail: "مطلوب. التكلفة الأولية للأصول."
			},
			salvage: {
				name: "salvage",
				detail: "مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول)."
			},
			life: {
				name: "life",
				detail: "مطلوب. عدد الفترات التي يتم فيها إهلاك الأصول (تسمى أحياناً فترة الانتفاع من الأصول)."
			}
		}
	},
	SYD: {
		description: "تُرجع هذه الدالة أرقام مجموع سنوات استهلاك أحد الأصول لفترة معيّنة.",
		abstract: "تُرجع هذه الدالة أرقام مجموع سنوات استهلاك أحد الأصول لفترة معيّنة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/syd-function"
		}],
		functionParameter: {
			cost: {
				name: "cost",
				detail: "مطلوب. التكلفة الأولية للأصول."
			},
			salvage: {
				name: "salvage",
				detail: "مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول)."
			},
			life: {
				name: "life",
				detail: "مطلوب. عدد الفترات التي يتم فيها إهلاك الأصول (تسمى أحياناً فترة الانتفاع من الأصول)."
			},
			per: {
				name: "per",
				detail: "مطلوب. الفترة ويجب أن تستخدم الوحدات نفسها التي يستخدمها العمر الإنتاجي."
			}
		}
	},
	TBILLEQ: {
		description: "تُرجع هذه الدالة العائد المساوي للسند لإذن الخزانة.",
		abstract: "تُرجع هذه الدالة العائد المساوي للسند لإذن الخزانة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tbilleq-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. تاريخ تسوية سند إذن الخزانة. تاريخ تسوية الورقة المالية هو التاريخ الذي يعقب تاريخ الإصدار عند منح سند إذن الخزانة للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. تاريخ استحقاق سند إذن الخزانة. تاريخ الاستحقاق هو تاريخ انتهاء سند إذن الخزانة."
			},
			discount: {
				name: "discount",
				detail: "مطلوب. معدل الخصم على سند إذن الخزانة."
			}
		}
	},
	TBILLPRICE: {
		description: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لسند الخزانة.",
		abstract: "تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لسند الخزانة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tbillprice-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. تاريخ تسوية سند إذن الخزانة. تاريخ تسوية الورقة المالية هو التاريخ الذي يعقب تاريخ الإصدار عند منح سند إذن الخزانة للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. تاريخ استحقاق سند إذن الخزانة. تاريخ الاستحقاق هو تاريخ انتهاء سند إذن الخزانة."
			},
			discount: {
				name: "discount",
				detail: "مطلوب. معدل الخصم على سند إذن الخزانة."
			}
		}
	},
	TBILLYIELD: {
		description: "تُرجع هذه الدالة العائد الخاص بإذن الخزانة.",
		abstract: "تُرجع هذه الدالة العائد الخاص بإذن الخزانة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tbillyield-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. تاريخ تسوية سند إذن الخزانة. تاريخ تسوية الورقة المالية هو التاريخ الذي يعقب تاريخ الإصدار عند منح سند إذن الخزانة للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. تاريخ استحقاق سند إذن الخزانة. تاريخ الاستحقاق هو تاريخ انتهاء سند إذن الخزانة."
			},
			pr: {
				name: "pr",
				detail: "مطلوب. سعر سند إذن الخزانة لكل قيمة اسمية قدرها 100 ر.س."
			}
		}
	},
	VDB: {
		description: "تُرجع هذه الدالة استهلاك أحد الأصول لأي فترة تحددها، بما فيها الفترات الجزئية، باستخدام أسلوب الرصيد المتناقص المزدوج أو أسلوب آخر تحدده. ترمز VDB إلى الرصيد المتناقص المتغير.",
		abstract: "تُرجع هذه الدالة استهلاك أحد الأصول لأي فترة تحددها، بما فيها الفترات الجزئية، باستخدام أسلوب الرصيد المتناقص المزدوج أو أسلوب آخر تحدده. ترمز VDB إلى الرصيد المتناقص المتغير.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/vdb-function"
		}],
		functionParameter: {
			cost: {
				name: "cost",
				detail: "مطلوب. التكلفة الأولية للأصول."
			},
			salvage: {
				name: "salvage",
				detail: "مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول). قد تكون هذه القيمة 0."
			},
			life: {
				name: "life",
				detail: "مطلوب. عدد الفترات التي يتم فيها إهلاك الأصول (تسمى أحياناً فترة الانتفاع من الأصول)."
			},
			startPeriod: {
				name: "start_period",
				detail: "مطلوب. الفترة التي تريد منها بدء حساب الإهلاك. يجب أن تستخدم Start_period الوحدات نفسها التي يستخدمها العمر الإنتاجي."
			},
			endPeriod: {
				name: "end_period",
				detail: "مطلوب. الفترة التي تريد عندها إنهاء حساب الإهلاك. يجب أن تستخدم End_period الوحدات نفسها التي يستخدمها العمر الإنتاجي."
			},
			factor: {
				name: "factor",
				detail: "الاختياري. المعدل الذي تتراجع عنده الميزانية. إذا تم حذف العامل، فسيتم افتراض أنه 2 (أسلوب الرصيد المتناقص المزدوج). غيّر العامل إذا كنت لا تريد استخدام أسلوب الرصيد المتناقص المزدوج. للحصول على وصف لأسلوب الرصيد المتناقص المزدوج، راجع DDB."
			},
			noSwitch: {
				name: "no_switch",
				detail: "الاختياري. قيمة منطقية تحدد إذا ما كان سيتم التبديل إلى الإهلاك الثابت عندما يكون الإهلاك أكبر من حساب الرصيد المتناقص. إذا كانت قيمة no_switch تساوي TRUE، لا يبدل Microsoft Excel إلى الإهلاك الثابت للموجودات حتى عندما يكون الإهلاك أكبر من حساب الرصيد المتناقص. إذا كانت قيمة no_switch تساوي FALSE أو محذوفة، يبدل Excel إلى الإهلاك الثابت للموجودات عندما يكون الإهلاك أكبر من حساب الرصيد المتناقص."
			}
		}
	},
	XIRR: {
		description: "تُرجع معدل العائد الداخلي لجدول تدفقات نقدية ليست بالضرورة دورية. لحساب معدل العائد الداخلي لسلسلة من التدفقات النقدية الدورية، استخدم الدالة IRR.",
		abstract: "تُرجع معدل العائد الداخلي لجدول تدفقات نقدية ليست بالضرورة دورية. لحساب معدل العائد الداخلي لسلسلة من التدفقات النقدية الدورية، استخدم الدالة IRR.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/xirr-function"
		}],
		functionParameter: {
			values: {
				name: "values",
				detail: "مطلوب. سلسلة من التدفقات النقدية التي تطابق جدول دفعات من حيث التواريخ. إن الدفعة الأولى اختيارية وتتطابق مع تكلفة أو دفعة تحدث عند بداية الاستثمار. إذا كانت القيمة الأولى تكلفة أو دفعة، فيجب أن تكون قيمة سالبة. يتم تطبيق خصم على كافة الدفعات التالية على أساس سنة مؤلفة من 365 يوماً. يجب أن تحتوي سلسلة القيم على قيمة واحدة موجبة وأخرى سالبة على الأقل."
			},
			dates: {
				name: "dates",
				detail: "مطلوب. جدول بتواريخ الدفعات مطابق لدفعات التدفقات النقدية. قد تحدث التواريخ بأي ترتيب. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص. ."
			},
			guess: {
				name: "guess",
				detail: "الاختياري. رقم تقدّر أنه قريب من نتيجة الدالة XIRR."
			}
		}
	},
	XNPV: {
		description: "تُرجع القيمة الحالية الصافية لجدول زمني من التدفقات النقدية لا يكون بالضرورة دورياً. لحساب القيمة الحالية الصافية لسلسلة من التدفقات النقدية الدورية، استخدم الدالة NPV.",
		abstract: "تُرجع القيمة الحالية الصافية لجدول زمني من التدفقات النقدية لا يكون بالضرورة دورياً. لحساب القيمة الحالية الصافية لسلسلة من التدفقات النقدية الدورية، استخدم الدالة NPV.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/xnpv-function"
		}],
		functionParameter: {
			rate: {
				name: "rate",
				detail: "مطلوب. معدل الخصم الذي تريد تطبيقه على التدفقات النقدية."
			},
			values: {
				name: "values",
				detail: "مطلوب. سلسلة من التدفقات النقدية التي تطابق جدول دفعات من حيث التواريخ. إن الدفعة الأولى اختيارية وتتطابق مع تكلفة أو دفعة تحدث عند بداية الاستثمار. إذا كانت القيمة الأولى تكلفة أو دفعة، فيجب أن تكون قيمة سالبة. يتم تطبيق خصم على كافة الدفعات التالية على أساس سنة مؤلفة من 365 يوماً. يجب أن تحتوي سلسلة القيم على قيمة موجبة وأخرى سالبة على الأقل."
			},
			dates: {
				name: "dates",
				detail: "مطلوب. جدول بتواريخ الدفعات مطابق لدفعات التدفقات النقدية. يشير تاريخ الدفعة الأولى إلى بداية جدول الدفعات. أما التواريخ الأخرى فيجب أن تقع بعد هذا التاريخ، ولكن قد تحدث بأي ترتيب."
			}
		}
	},
	YIELD: {
		description: "تُرجع هذه الدالة عائد ورقة مالية تستحق عنها فائدة دورية. استخدم YIELD لحساب عائد السند.",
		abstract: "تُرجع هذه الدالة عائد ورقة مالية تستحق عنها فائدة دورية. استخدم YIELD لحساب عائد السند.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/yield-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية."
			},
			pr: {
				name: "pr",
				detail: "مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			frequency: {
				name: "frequency",
				detail: "مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	YIELDDISC: {
		description: "تُرجع العائد السنوي لورقة مالية ذات خصم.",
		abstract: "تُرجع العائد السنوي لورقة مالية ذات خصم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/yielddisc-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			pr: {
				name: "pr",
				detail: "مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			redemption: {
				name: "redemption",
				detail: "مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	},
	YIELDMAT: {
		description: "تُرجع العائد السنوي لأوراق مالية تُدفع فائدتها في تاريخ الاستحقاق.",
		abstract: "تُرجع العائد السنوي لأوراق مالية تُدفع فائدتها في تاريخ الاستحقاق.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/yieldmat-function"
		}],
		functionParameter: {
			settlement: {
				name: "settlement",
				detail: "مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري."
			},
			maturity: {
				name: "maturity",
				detail: "مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية."
			},
			issue: {
				name: "issue",
				detail: "مطلوب. تاريخ إصدار الورقة المالية، ويتم التعبير عنه برقم تاريخ تسلسلي."
			},
			rate: {
				name: "rate",
				detail: "مطلوب. معدل فائدة الورقة المالية عند تاريخ الإصدار."
			},
			pr: {
				name: "pr",
				detail: "مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س."
			},
			basis: {
				name: "basis",
				detail: "الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/information/ar-SA.ts
const locale$8 = {
	CELL: {
		description: "تُرجع الدالة CELL معلومات حول تنسيق الخلية أو موقعها أو محتوياتها. على سبيل المثال، إذا أردت التحقق من أن إحدى الخلايا تحتوي على قيمة رقمية بدلاً من نص قبل إجراء عملية حسابية عليها، فبإمكانك استخدام الصيغة التالية:",
		abstract: "تُرجع الدالة CELL معلومات حول تنسيق الخلية أو موقعها أو محتوياتها. على سبيل المثال، إذا أردت التحقق من أن إحدى الخلايا تحتوي على قيمة رقمية بدلاً من نص قبل إجراء عملية حسابية عليها، فبإمكانك استخدام الصيغة التالية:",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cell-function"
		}],
		functionParameter: {
			infoType: {
				name: "info_type",
				detail: "وهي قيمة نصية تحدد نوع معلومات الخلية الذي تريد إرجاعه. تعرض القائمة التالية القيم المحتملة للوسيطة Info_type والنتائج المقابلة."
			},
			reference: {
				name: "reference",
				detail: "وهي الخلية التي تريد معلومات حولها. إذا تم حذفها، يتم إرجاع المعلومات المحددة في الوسيطة info_type للخلية المحددة في وقت الحساب. إذا كانت الوسيطة المرجعية عبارة عن نطاق خلايا، فترجع الدالة CELL معلومات الخلية النشطة في النطاق المحدد. الهامه: على الرغم من أن المرجع من الناحية الفنية اختياري، إلا أنه يتم تشجيع تضمينه في الصيغة، إلا إذا كنت تفهم تأثير غيابه على نتيجة الصيغة وتريد تطبيق هذا التأثير. لا يؤدي حذف الوسيطة المرجعية إلى إنتاج معلومات حول خلية معينة بشكل موثوق، للأسباب التالية: في وضع الحساب التلقائي، عند تعديل خلية من قبل مستخدم، قد يتم تشغيل العملية الحسابية قبل تقدم التحديد أو بعده، اعتمادا على النظام الأساسي الذي تستخدمه ل Excel. على سبيل المثال، يقوم Excel for Windows حاليا بتشغيل الحساب قبل تغيير التحديد، ولكن Excel على الويب تشغيله بعد ذلك. عند Co-Authoring مع مستخدم آخر يقوم بإجراء تحرير، ستقوم هذه الدالة بالإبلاغ عن الخلية النشطة بدلا من المحرر. ستؤدي أي إعادة حساب، على سبيل المثال الضغط على F9، إلى إرجاع الدالة نتيجة جديدة على الرغم من عدم حدوث أي تحرير للخلية."
			}
		}
	},
	ERROR_TYPE: {
		description: "تُرجع هذه الدالة رقماً يطابق إحدى قيم الخطأ في Microsoft Excel أو تُرجع الخطأ ‎#N/A في حال عدم وجود أي خطأ. يمكنك استخدام الدالة ERROR.TYPE في دالة IF لاختبار قيمة خطأ وإرجاع سلسلة نصية، كرسالة مثلاً، بدلاً من قيمة الخطأ.",
		abstract: "تُرجع هذه الدالة رقماً يطابق إحدى قيم الخطأ في Microsoft Excel أو تُرجع الخطأ ‎#N/A في حال عدم وجود أي خطأ. يمكنك استخدام الدالة ERROR.TYPE في دالة IF لاختبار قيمة خطأ وإرجاع سلسلة نصية، كرسالة مثلاً، بدلاً من قيمة الخطأ.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/error-type-function"
		}],
		functionParameter: { errorVal: {
			name: "error_val",
			detail: "مطلوب. قيمة الخطأ التي تريد البحث عن رقم التعريف الخاص بها. على الرغم من أن error_val قد تكون قيمة الخطأ الفعلية، فهي ستكون عادةً عبارة عن مرجع إلى خلية تحتوي على صيغة تريد اختبارها."
		} }
	},
	INFO: {
		description: "إرجاع معلومات حول بيئة التشغيل الحالية.",
		abstract: "إرجاع معلومات حول بيئة التشغيل الحالية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/info-function"
		}],
		functionParameter: { typeText: {
			name: "Type_text",
			detail: "مطلوب. نص يحدد نوع المعلومات التي تريد إرجاعها."
		} }
	},
	ISBETWEEN: {
		description: "تتحقق مما إذا كان الرقم المقدم يقع بين رقمين آخرين، بشكل شامل أو حصري.",
		abstract: "تتحقق مما إذا كان الرقم المقدم يقع بين رقمين آخرين، بشكل شامل أو حصري.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/10538337?hl=ar"
		}],
		functionParameter: {
			valueToCompare: {
				name: "value_to_compare",
				detail: "القيمة المراد اختبار وقوعها بين `lower_value` و`upper_value`."
			},
			lowerValue: {
				name: "lower_value",
				detail: "الحد الأدنى لنطاق القيم الذي يمكن أن تقع ضمنه `value_to_compare`."
			},
			upperValue: {
				name: "upper_value",
				detail: "الحد الأعلى لنطاق القيم الذي يمكن أن تقع ضمنه `value_to_compare`."
			},
			lowerValueIsInclusive: {
				name: "lower_value_is_inclusive",
				detail: "ما إذا كان نطاق القيم يتضمن `lower_value`. القيمة الافتراضية TRUE."
			},
			upperValueIsInclusive: {
				name: "upper_value_is_inclusive",
				detail: "ما إذا كان نطاق القيم يتضمن `upper_value`. القيمة الافتراضية TRUE."
			}
		}
	},
	ISBLANK: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISDATE: {
		description: "ترجع الدالة ISDATE ما إذا كانت القيمة تاريخاً.",
		abstract: "ترجع الدالة ISDATE ما إذا كانت القيمة تاريخاً.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/9061381?hl=ar"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "القيمة المطلوب التحقق من أنها تاريخ."
		} }
	},
	ISEMAIL: {
		description: "تتحقق الدالة ISEMAIL مما إذا كانت القيمة عنوان بريد إلكتروني صالحاً. فهي تتحقق من اتباع القيمة لتنسيق شائع لعناوين البريد الإلكتروني، لكنها لا تتحقق من وجود العنوان.",
		abstract: "تتحقق الدالة ISEMAIL مما إذا كانت القيمة عنوان بريد إلكتروني صالحاً. فهي تتحقق من اتباع القيمة لتنسيق شائع لعناوين البريد الإلكتروني، لكنها لا تتحقق من وجود العنوان.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/3256503?hl=ar"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "القيمة المطلوب التحقق من أنها عنوان بريد إلكتروني."
		} }
	},
	ISERR: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISERROR: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISEVEN: {
		description: "إرجاع القيمة TRUE إذا كان الرقم زوجياً، أو FALSE إذا كان الرقم فردياً.",
		abstract: "إرجاع القيمة TRUE إذا كان الرقم زوجياً، أو FALSE إذا كان الرقم فردياً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/iseven-function"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوبة. القيمة التي يجب اختبارها. إذا لم يكن الرقم عدداً صحيحاً، فسيتم اقتطاعه."
		} }
	},
	ISFORMULA: {
		description: "تتحقق هذه الدالة من وجود مرجع إلى خلية تحتوي على صيغة، وتُرجع TRUE أو FALSE.",
		abstract: "تتحقق هذه الدالة من وجود مرجع إلى خلية تحتوي على صيغة، وتُرجع TRUE أو FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/isformula-function"
		}],
		functionParameter: { reference: {
			name: "reference",
			detail: "مطلوب. المرجع هو مرجع إلى الخلية التي تريد اختبارها. يمكن أن يكون المرجع مرجع خلية أو صيغة أو اسما يشير إلى خلية."
		} }
	},
	ISLOGICAL: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISNA: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISNONTEXT: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISNUMBER: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISODD: {
		description: "إرجاع القيمة TRUE إذا كان الرقم فردياً أو FALSE إذا كان الرقم زوجياً.",
		abstract: "إرجاع القيمة TRUE إذا كان الرقم فردياً أو FALSE إذا كان الرقم زوجياً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/isodd-function"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوبة. القيمة التي يجب اختبارها. إذا لم تكن قيمة الوسيطة Number عدداً صحيحاً، فسيتم اقتطاعها."
		} }
	},
	ISOMITTED: {
		description: "التحقق من أن القيمة في LAMBDA مفقودة وإرجاع TRUE أو FALSE.",
		abstract: "التحقق من أن القيمة في LAMBDA مفقودة وإرجاع TRUE أو FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/isomitted-function"
		}],
		functionParameter: { argument: {
			name: "الوسيطه",
			detail: "القيمة التي تريد اختبارها، مثل معلمة LAMBDA."
		} }
	},
	ISREF: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISTEXT: {
		description: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		abstract: "تقوم كل دالة من هذه الدالات، ويشار إليها جميعاً بدالات IS ، بالتحقق من القيمة المحددة وإرجاع TRUE أو FALSE استناداً إلى النتائج. تقوم الدالة ISBLANK مثلاً بإرجاع القيمة المنطقية TRUE إذا كانت وسيطة القيمة مرجعاً إلى خلية فارغة، وبخلاف ذلك فإنها تقوم بإرجاع FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/is-functions"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. هي القيمة التي تريد اختبارها. يمكن لوسيطة القيمة أن تكون عبارة عن قيمة فارغة (خلية فارغة) أو قيمة خطأ أو قيمة منطقية أو نص أو رقم أو قيمة مرجعية أو اسم يشير إلى أي من هذه."
		} }
	},
	ISURL: {
		description: "تتحقق مما إذا كانت القيمة عنوان URL صالحاً.",
		abstract: "تتحقق مما إذا كانت القيمة عنوان URL صالحاً.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/3256501?hl=ar"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "القيمة المطلوب التحقق من أنها عنوان URL."
		} }
	},
	N: {
		description: "تُرجع هذه الدالة قيمة محوّلة إلى رقم.",
		abstract: "تُرجع هذه الدالة قيمة محوّلة إلى رقم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/n-function"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. القيمة التي تريد تحويلها. تحوّل الدالة N القيم المذكورة في الجدول التالي."
		} }
	},
	NA: {
		description: "تُرجع هذه الدالة قيمة الخطأ ‎#N/A. #N/A هي قيمة الخطأ التي تعني \"لا توجد قيمة متوفرة\". استخدم NA لوضع علامة على الخلايا الفارغة. عن طريق إدخال ‎#N/A في الخلايا ذات المعلومات الناقصة، يمكنك تفادي مشكلة تضمين خلايا فارغة في عملياتك الحسابية عن طريق الخطأ. (عندما تشير الصيغة إلى خلية تحتوي على ‎#N/A، تُرجع الصيغة قيمة الخطأ ‎#N/A.)",
		abstract: "تُرجع هذه الدالة قيمة الخطأ ‎#N/A. #N/A هي قيمة الخطأ التي تعني \"لا توجد قيمة متوفرة\". استخدم NA لوضع علامة على الخلايا الفارغة. عن طريق إدخال ‎#N/A في الخلايا ذات المعلومات الناقصة، يمكنك تفادي مشكلة تضمين خلايا فارغة في عملياتك الحسابية عن طريق الخطأ. (عندما تشير الصيغة إلى خلية تحتوي على ‎#N/A، تُرجع الصيغة قيمة الخطأ ‎#N/A.)",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/na-function"
		}],
		functionParameter: {}
	},
	SHEET: {
		description: "ترجع الدالة SHEET رقم الورقة للورقة المحددة أو مرجعا آخر.",
		abstract: "ترجع الدالة SHEET رقم الورقة للورقة المحددة أو مرجعا آخر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sheet-function"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "وسيطة اختيارية. استخدم هذا لتحديد اسم ورقة أو مرجع تريد الحصول على رقم الورقة له. وإلا، سترجع الدالة عدد الورقة التي تحتوي على الدالة SHEET."
		} }
	},
	SHEETS: {
		description: "تُرجع هذه الدالة عدد الأوراق في مرجع.",
		abstract: "تُرجع هذه الدالة عدد الأوراق في مرجع.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sheets-function"
		}],
		functionParameter: {}
	},
	TYPE: {
		description: "تُرجع هذه الدالة نوع القيمة. استخدم الدالة TYPE عندما يستند سلوك دالة أخرى إلى نوع القيمة في خلية محددة.",
		abstract: "تُرجع هذه الدالة نوع القيمة. استخدم الدالة TYPE عندما يستند سلوك دالة أخرى إلى نوع القيمة في خلية محددة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/type-function"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. يمكنها أن تكون أي قيمة من قيم Microsoft Excel، كرقم ونص وقيمة منطقية، وهكذا."
		} }
	}
};

//#endregion
//#region src/locale/function-list/logical/ar-SA.ts
const locale$7 = {
	AND: {
		description: "ترجع الدالة ‏AND‏ القيمة TRUE إذا تم تقييم كافة الوسيطات الخاصة بها بالقيمة TRUE، وترجع القيمة FALSE إذا تم تقييم واحدة أو أكثر من الوسيطات الخاصة بها بالقيمة FALSE.",
		abstract: "ترجع الدالة ‏AND‏ القيمة TRUE إذا تم تقييم كافة الوسيطات الخاصة بها بالقيمة TRUE، وترجع القيمة FALSE إذا تم تقييم واحدة أو أكثر من الوسيطات الخاصة بها بالقيمة FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/and-function"
		}],
		functionParameter: {
			logical1: {
				name: "logical1",
				detail: "الشرط الأول الذي تريد اختباره، ويمكن أن تكون نتيجته TRUE أو FALSE."
			},
			logical2: {
				name: "logical2",
				detail: "شروط إضافية تريد اختبارها، ويمكن أن تكون نتيجتها TRUE أو FALSE، بحد أقصى 255 شرطاً."
			}
		}
	},
	BYCOL: {
		description: "تطبيق LAMBDA على كل عمود وإرجاع صفيف من النتائج. على سبيل المثال، إذا كان الصفيف الأصلي 3 أعمدة في صفين، فإن الصفيف الذي يتم إرجاعه هو 3 أعمدة في صف واحد.",
		abstract: "تطبيق LAMBDA على كل عمود وإرجاع صفيف من النتائج. على سبيل المثال، إذا كان الصفيف الأصلي 3 أعمدة في صفين، فإن الصفيف الذي يتم إرجاعه هو 3 أعمدة في صف واحد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bycol-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "صفيف يُعالج عموداً بعمود."
			},
			lambda: {
				name: "lambda",
				detail: "دالة LAMBDA تأخذ عموداً كمعلمة واحدة وتحسب نتيجة واحدة. تأخذ LAMBDA معلمة واحدة: عموداً من array."
			}
		}
	},
	BYROW: {
		description: "تطبيق LAMBDA على كل صف وإرجاع صفيف من النتائج. على سبيل المثال، إذا كان الصفيف الأصلي 3 أعمدة في صفين، يكون الصفيف الذي تم إرجاعه عموداً واحداً في صفين.",
		abstract: "تطبيق LAMBDA على كل صف وإرجاع صفيف من النتائج. على سبيل المثال، إذا كان الصفيف الأصلي 3 أعمدة في صفين، يكون الصفيف الذي تم إرجاعه عموداً واحداً في صفين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/byrow-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "صفيف يُعالج صفاً بصف."
			},
			lambda: {
				name: "lambda",
				detail: "دالة LAMBDA تأخذ صفاً كمعلمة واحدة وتحسب نتيجة واحدة. تأخذ LAMBDA معلمة واحدة: صفاً من array."
			}
		}
	},
	FALSE: {
		description: "تُرجع القيمة المنطقية FALSE.",
		abstract: "تُرجع القيمة المنطقية FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/false-function"
		}],
		functionParameter: {}
	},
	IF: {
		description: "على سبيل المثال، تشير =IF(C2=\"Yes\",1,2) أنه إذا كان IF(C2 = نعم، يتم إرجاع 1، وبخلاف ذلك يتم إرجاع 2).",
		abstract: "على سبيل المثال، تشير =IF(C2=\"Yes\",1,2) أنه إذا كان IF(C2 = نعم، يتم إرجاع 1، وبخلاف ذلك يتم إرجاع 2).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/if-function"
		}],
		functionParameter: {
			logicalTest: {
				name: "logical_test",
				detail: "القيمة التي تريد اختبارها."
			},
			valueIfTrue: {
				name: "value_if_true",
				detail: "القيمة التي تريد إرجاعها إذا كانت نتيجة logical_test TRUE."
			},
			valueIfFalse: {
				name: "value_if_false",
				detail: "القيمة التي تريد إرجاعها إذا كانت نتيجة logical_test هي FALSE."
			}
		}
	},
	IFERROR: {
		description: "يمكنك استخدام الدالة IFERROR لمعالجة الأخطاء في صيغة. ترجع الدالة IFERROR قيمة تحددها إذا تم تقييم صيغة إلى خطأ؛ وإلا، فإنه يرجع نتيجة الصيغة.",
		abstract: "يمكنك استخدام الدالة IFERROR لمعالجة الأخطاء في صيغة. ترجع الدالة IFERROR قيمة تحددها إذا تم تقييم صيغة إلى خطأ؛ وإلا، فإنه يرجع نتيجة الصيغة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/iferror-function"
		}],
		functionParameter: {
			value: {
				name: "value",
				detail: "مطلوب. الوسيطة التي يتم فحصها بحثاً عن خطأ."
			},
			valueIfError: {
				name: "value_if_error",
				detail: "مطلوب. القيمة التي يجب إرجاعها إذا تم تقييم الصيغة إلى خطأ. يتم تقييم أنواع الخطأ التالية: ‎#N/A أو ‎#VALUE!‎ أو ‎#REF!‎ أو ‎#DIV/0!‎ أو ‎#NUM!‎ أو ‎#NAME?‎ أو ‎#NULL!‎."
			}
		}
	},
	IFNA: {
		description: "ترجع الدالة IFNA القيمة التي تحددها إذا كانت الصيغة ترجع قيمة الخطأ #N/A؛ وإلا فإنه يرجع نتيجة الصيغة.",
		abstract: "ترجع الدالة IFNA القيمة التي تحددها إذا كانت الصيغة ترجع قيمة الخطأ #N/A؛ وإلا فإنه يرجع نتيجة الصيغة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ifna-function"
		}],
		functionParameter: {
			value: {
				name: "value",
				detail: "الوسيطة التي تم التحقق منها لقيمة الخطأ #N/A."
			},
			valueIfNa: {
				name: "value_if_na",
				detail: "القيمة المراد إرجاعها إذا تم تقييم الصيغة إلى قيمة الخطأ #N/A."
			}
		}
	},
	IFS: {
		description: "تتحقق الدالة IFS مما إذا تم استيفاء شرط واحد أو أكثر، وتُرجع القيمة التي تتوافق مع شرط TRUE الأول. يمكن تستبدل IFS العديد من عبارات IF المتداخلة، وتكون القراءة أسهل بكثير مع الشروط المتعددة.",
		abstract: "تتحقق الدالة IFS مما إذا تم استيفاء شرط واحد أو أكثر، وتُرجع القيمة التي تتوافق مع شرط TRUE الأول. يمكن تستبدل IFS العديد من عبارات IF المتداخلة، وتكون القراءة أسهل بكثير مع الشروط المتعددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ifs-function"
		}],
		functionParameter: {
			logicalTest1: {
				name: "logical_test1",
				detail: "شرط نتيجته TRUE أو FALSE."
			},
			valueIfTrue1: {
				name: "value_if_true1",
				detail: "النتيجة التي تُرجع إذا كانت نتيجة logical_test1 هي TRUE. يمكن أن تكون فارغة."
			},
			logicalTest2: {
				name: "logical_test2",
				detail: "شرط نتيجته TRUE أو FALSE."
			},
			valueIfTrue2: {
				name: "value_if_true2",
				detail: "النتيجة التي تُرجع إذا كانت نتيجة logical_testN هي TRUE. يقابل كل value_if_trueN الشرط logical_testN، ويمكن أن تكون فارغة."
			}
		}
	},
	LAMBDA: {
		description: "يمكنك إنشاء دالة لصيغة شائعة الاستخدام، وإزالة الحاجة إلى نسخ ولصق هذه الصيغة (التي يمكن أن تكون عرضة للخطأ)، وإضافة وظائفك الخاصة بشكل فعال إلى مكتبة دالات Excel الأصلية. علاوة على ذلك، لا تتطلب دالة LAMBDA VBA أو وحدات الماكرو أو JavaScript، لذلك يمكن لغير المبرمجين أيضا الاستفادة من استخدامها.",
		abstract: "يمكنك إنشاء دالة لصيغة شائعة الاستخدام، وإزالة الحاجة إلى نسخ ولصق هذه الصيغة (التي يمكن أن تكون عرضة للخطأ)، وإضافة وظائفك الخاصة بشكل فعال إلى مكتبة دالات Excel الأصلية. علاوة على ذلك، لا تتطلب دالة LAMBDA VBA أو وحدات الماكرو أو JavaScript، لذلك يمكن لغير المبرمجين أيضا الاستفادة من استخدامها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/lambda-function"
		}],
		functionParameter: {
			parameter: {
				name: "parameter",
				detail: "قيمة تريد تمريرها إلى الدالة، مثل مرجع خلية أو سلسلة أو رقم. يمكنك إدخال ما يصل إلى 253 معلمة. هذه الوسيطة اختيارية."
			},
			calculation: {
				name: "calculation",
				detail: "الصيغة التي تريد تنفيذها والعودة كنتيجة للدالة. يجب أن تكون الوسيطة الأخيرة، ويجب أن تعيد نتيجة. هذه الوسيطة مطلوبة."
			}
		}
	},
	LET: {
		description: "تعين LET الدالة أسماء لنتائج الحساب. يسمح ذلك بتخزين القيم أو العمليات الحسابية الوسيطة أو تعريف الأسماء داخل صيغة. تنطبق هذه الأسماء فقط ضمن نطاق الدالة LET . على غرار المتغيرات في البرمجة، LET يتم إنجازها من خلال بناء جملة الصيغة الأصلية في Excel.",
		abstract: "تعين LET الدالة أسماء لنتائج الحساب. يسمح ذلك بتخزين القيم أو العمليات الحسابية الوسيطة أو تعريف الأسماء داخل صيغة. تنطبق هذه الأسماء فقط ضمن نطاق الدالة LET . على غرار المتغيرات في البرمجة، LET يتم إنجازها من خلال بناء جملة الصيغة الأصلية في Excel.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/let-function"
		}],
		functionParameter: {
			name1: {
				name: "name1",
				detail: "الاسم الأول المراد تعيينه. يجب أن يبدأ بحرف، وألا يكون ناتج صيغة أو متعارضاً مع صياغة النطاق."
			},
			nameValue1: {
				name: "name_value1",
				detail: "القيمة المعيّنة إلى name1."
			},
			calculationOrName2: {
				name: "calculation_or_name2",
				detail: "أحد الخيارين التاليين:\n1. عملية حسابية تستخدم كل الأسماء داخل LET. يجب أن تكون هذه الوسيطة الأخيرة في LET.\n2. اسم ثانٍ لتعيينه إلى name_value ثانٍ. إذا حُدّد اسم، تصبح name_value2 وcalculation_or_name3 مطلوبتين."
			},
			nameValue2: {
				name: "name_value2",
				detail: "القيمة المعيّنة إلى calculation_or_name2."
			},
			calculationOrName3: {
				name: "calculation_or_name3",
				detail: "أحد الخيارين التاليين:\n1. عملية حسابية تستخدم كل الأسماء داخل LET. يجب أن تكون الوسيطة الأخيرة في LET عملية حسابية.\n2. اسم ثالث لتعيينه إلى name_value ثالث. إذا حُدّد اسم، تصبح name_value3 وcalculation_or_name4 مطلوبتين."
			}
		}
	},
	MAKEARRAY: {
		description: "إرجاع صفيف محسوب لحجم صف وعمود محدد، عن طريق تطبيق دالة LAMBDA .",
		abstract: "إرجاع صفيف محسوب لحجم صف وعمود محدد، عن طريق تطبيق دالة LAMBDA .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/makearray-function"
		}],
		functionParameter: {
			number1: {
				name: "rows",
				detail: "عدد صفوف الصفيف. يجب أن يكون أكبر من صفر."
			},
			number2: {
				name: "cols",
				detail: "عدد أعمدة الصفيف. يجب أن يكون أكبر من صفر."
			},
			value3: {
				name: "lambda",
				detail: "دالة LAMBDA تُستدعى لإنشاء الصفيف. تأخذ LAMBDA معلمتين: row (فهرس صف الصفيف) وcol (فهرس عمود الصفيف)."
			}
		}
	},
	MAP: {
		description: "إرجاع صفيف تم تكوينه عن طريق تعيين كل قيمة في الصفيف (الصفيفات) إلى قيمة جديدة عن طريق تطبيق LAMBDA لإنشاء قيمة جديدة.",
		abstract: "إرجاع صفيف تم تكوينه عن طريق تعيين كل قيمة في الصفيف (الصفيفات) إلى قيمة جديدة عن طريق تطبيق LAMBDA لإنشاء قيمة جديدة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/map-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "الصفيف الأول المراد تعيينه."
			},
			array2: {
				name: "array2",
				detail: "الصفيف الثاني المراد تعيينه."
			},
			lambda: {
				name: "lambda",
				detail: "دالة LAMBDA يجب أن تكون الوسيطة الأخيرة، وأن تتضمن معلمة لكل صفيف مُمرَّر."
			}
		}
	},
	NOT: {
		description: "تعكس الدالة NOT قيمة الوسيطة الخاصة بها.",
		abstract: "تعكس الدالة NOT قيمة الوسيطة الخاصة بها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/not-function"
		}],
		functionParameter: { logical: {
			name: "logical",
			detail: "الشرط الذي تريد عكس منطقه، ويمكن أن تكون نتيجته TRUE أو FALSE."
		} }
	},
	OR: {
		description: "ترجع دالة OR القيمة TRUE إذا كان تقييم أي من وسيطاتها TRUE، وترجع FALSE إذا كان تقييم أي من وسيطاتها FALSE.",
		abstract: "ترجع دالة OR القيمة TRUE إذا كان تقييم أي من وسيطاتها TRUE، وترجع FALSE إذا كان تقييم أي من وسيطاتها FALSE.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/or-function"
		}],
		functionParameter: {
			logical1: {
				name: "logical1",
				detail: "الشرط الأول الذي تريد اختباره، ويمكن أن تكون نتيجته TRUE أو FALSE."
			},
			logical2: {
				name: "logical2",
				detail: "شروط إضافية تريد اختبارها، ويمكن أن تكون نتيجتها TRUE أو FALSE، بحد أقصى 255 شرطاً."
			}
		}
	},
	REDUCE: {
		description: "تختزل مصفوفة إلى قيمة متراكمة بتطبيق LAMBDA على كل قيمة وإرجاع القيمة الإجمالية في المُجمّع.",
		abstract: "تختزل مصفوفة إلى قيمة متراكمة بتطبيق LAMBDA على كل قيمة وإرجاع القيمة الإجمالية في المُجمّع.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/reduce-function"
		}],
		functionParameter: {
			initialValue: {
				name: "initial_value",
				detail: "يحدد قيمة البداية للمُجمّع."
			},
			array: {
				name: "array",
				detail: "صفيف المراد اختزاله."
			},
			lambda: {
				name: "lambda",
				detail: "دالة LAMBDA تُستدعى لاختزال الصفيف. تأخذ LAMBDA ثلاث معلمات: 1. القيمة المتراكمة التي تُرجع كنتيجة نهائية. 2. القيمة الحالية من الصفيف. 3. العملية الحسابية المطبقة على كل عنصر في الصفيف."
			}
		}
	},
	SCAN: {
		description: "يقوم بفحص صفيف عن طريق تطبيق LAMBDA على كل قيمة وإرجاع صفيف يحتوي على كل قيمة وسيطة.",
		abstract: "يقوم بفحص صفيف عن طريق تطبيق LAMBDA على كل قيمة وإرجاع صفيف يحتوي على كل قيمة وسيطة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/scan-function"
		}],
		functionParameter: {
			initialValue: {
				name: "initial_value",
				detail: "يحدد قيمة البداية للمُجمّع."
			},
			array: {
				name: "array",
				detail: "صفيف المراد فحصه."
			},
			lambda: {
				name: "lambda",
				detail: "دالة LAMBDA تُستدعى لفحص الصفيف. تأخذ LAMBDA ثلاث معلمات: 1. القيمة المتراكمة. 2. القيمة الحالية من الصفيف. 3. العملية الحسابية المطبقة على كل عنصر في الصفيف."
			}
		}
	},
	SWITCH: {
		description: "تقيّم تعبيراً مقابل قائمة قيم وترجع النتيجة المقابلة لأول قيمة مطابقة. وإذا لم توجد مطابقة، فقد ترجع قيمة افتراضية اختيارية.",
		abstract: "تقيّم تعبيراً مقابل قائمة قيم وترجع النتيجة المقابلة لأول قيمة مطابقة. وإذا لم توجد مطابقة، فقد ترجع قيمة افتراضية اختيارية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/switch-function"
		}],
		functionParameter: {
			expression: {
				name: "expression",
				detail: "القيمة (مثل رقم أو تاريخ أو نص) التي ستُقارن بـ value1 إلى value126."
			},
			value1: {
				name: "value1",
				detail: "قيمة تُقارن بـ expression."
			},
			result1: {
				name: "result1",
				detail: "القيمة التي تُرجع عندما تطابق وسيطة valueN المقابلة expression. يجب توفير resultN لكل وسيطة valueN مقابلة."
			},
			defaultOrValue2: {
				name: "default_or_value2",
				detail: "القيمة التي تُرجع إذا لم يُعثر على تطابق في تعبيرات valueN. تُعرَّف وسيطة Default بعدم وجود تعبير resultN مقابل لها، ويجب أن تكون الوسيطة الأخيرة في الدالة."
			},
			result2: {
				name: "result2",
				detail: "القيمة التي تُرجع عندما تطابق وسيطة valueN المقابلة expression. يجب توفير resultN لكل وسيطة valueN مقابلة."
			}
		}
	},
	TRUE: {
		description: "إرجاع القيمة المنطقية TRUE. يمكنك استخدام هذه الدالة عندما تريد إرجاع القيمة TRUE استنادا إلى شرط. على سبيل المثال:",
		abstract: "إرجاع القيمة المنطقية TRUE. يمكنك استخدام هذه الدالة عندما تريد إرجاع القيمة TRUE استنادا إلى شرط. على سبيل المثال:",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/true-function"
		}],
		functionParameter: {}
	},
	XOR: {
		description: "ترجع الدالة XOR قيمة حصرية منطقية أو لكافة الوسيطات.",
		abstract: "ترجع الدالة XOR قيمة حصرية منطقية أو لكافة الوسيطات.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/xor-function"
		}],
		functionParameter: {
			logical1: {
				name: "logical1",
				detail: "الشرط الأول الذي تريد اختباره، ويمكن أن تكون نتيجته TRUE أو FALSE."
			},
			logical2: {
				name: "logical2",
				detail: "شروط إضافية تريد اختبارها، ويمكن أن تكون نتيجتها TRUE أو FALSE، بحد أقصى 255 شرطاً."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/lookup/ar-SA.ts
const locale$6 = {
	ADDRESS: {
		description: "يمكنك استخدام الدالة ADDRESS للحصول على عنوان إحدى الخلايا في ورقة العمل، عند معرفة رقم صف ورقم عمود محددين. على سبيل المثال، ترجع ADDRESS(2,3) $C$2 . كمثال آخر، ترجع ADDRESS(77,300) $KN$77 . وتستطيع استخدام دالات أخرى، مثل الدالتين ROW و COLUMN ، لتوفير وسيطتي رقم الصف ورقم العمود للدالة ADDRESS .",
		abstract: "يمكنك استخدام الدالة ADDRESS للحصول على عنوان إحدى الخلايا في ورقة العمل، عند معرفة رقم صف ورقم عمود محددين. على سبيل المثال، ترجع ADDRESS(2,3) $C$2 . كمثال آخر، ترجع ADDRESS(77,300) $KN$77 . وتستطيع استخدام دالات أخرى، مثل الدالتين ROW و COLUMN ، لتوفير وسيطتي رقم الصف ورقم العمود للدالة ADDRESS .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/address-function"
		}],
		functionParameter: {
			row_num: {
				name: "row number",
				detail: "مطلوب. وهي قيمة رقمية تحدد رقم الصف المراد استخدامه في مرجع الخلية."
			},
			column_num: {
				name: "column number",
				detail: "مطلوب. وهي قيمة رقمية تحدد رقم العمود المراد استخدامه في مرجع الخلية."
			},
			abs_num: {
				name: "type of reference",
				detail: "الاختياري. وهي قيمة رقمية تحدد نوع المرجع المراد إرجاعه."
			},
			a1: {
				name: "style of reference",
				detail: "الاختياري. وهي قيمة منطقية تحدد نمط المرجع A1 أو R1C1. في النمط A1، تتم تسمية الأعمدة أبجدياً، وتتم تسمية الصفوف رقمياً. وفي نمط المرجع R1C1، تتم تسمية كل من الأعمدة والصفوف رقمياً. إذا كانت الوسيطة A1 تساوي TRUE أو تم إهمالها، فستُرجع الدالة ADDRESS مرجعاً بنمط A1، وإذا كانت تساوي FALSE، فستُرجع الدالة ADDRESS مرجعاً بنمط R1C1. ملاحظة لتغيير نمط المرجع الذي يستخدمه Excel، انقر فوق علامة التبويب ملف ، وانقر فوق خيارات ، ثم انقر فوق الصيغ . وضمن استخدام الصيغ ، حدد خانة الاختيار نمط المرجع R1C1 أو قم بإلغاء تحديدها."
			},
			sheet_text: {
				name: "worksheet name",
				detail: "الاختياري. وهي قيمة نصية تحدد اسم ورقة العمل المراد استخدامها كمرجع خارجي. على سبيل المثال، ترجع الصيغة =ADDRESS(1,1,,,\"Sheet2\") Sheet2!$A$1 . إذا تم حذف الوسيطة sheet_text ، فلن يتم استخدام أي اسم ورقة، ويشير العنوان الذي تم إرجاعه بواسطة الدالة إلى خلية على الورقة الحالية."
			}
		}
	},
	AREAS: {
		description: "تُرجع عدد النواحي في مرجع. تعد الناحية نطاقاً من الخلايا المتجاورة أو خلية مفردة.",
		abstract: "تُرجع عدد النواحي في مرجع. تعد الناحية نطاقاً من الخلايا المتجاورة أو خلية مفردة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/areas-function"
		}],
		functionParameter: { reference: {
			name: "reference",
			detail: "مطلوب. وهي مرجع لخلية أو نطاق خلايا ويمكن أن تشير إلى نواحٍ متعددة. إذا كنت تريد تحديد عدة مراجع كوسيطة مفردة، فعليك تضمين مجموعات إضافية من الأقواس حتى لا يفسر Microsoft Excel الفاصلة على أنها فاصل حقول. انظر المثال التالي."
		} }
	},
	CHOOSE: {
		description: "تستخدم index_num لإرجاع قيمة من قائمة وسيطات القيم. استخدم CHOOSE لتحديد قيمة من القيم الـ 254 استناداً إلى رقم الفهرس. على سبيل المثال، إذا كانت القيم من value1 إلى value7 تمثل أيام الأسبوع، فتُرجع CHOOSE أحد الأيام عند استخدام رقم بين 1 و7 كـ index_num.",
		abstract: "تستخدم index_num لإرجاع قيمة من قائمة وسيطات القيم. استخدم CHOOSE لتحديد قيمة من القيم الـ 254 استناداً إلى رقم الفهرس. على سبيل المثال، إذا كانت القيم من value1 إلى value7 تمثل أيام الأسبوع، فتُرجع CHOOSE أحد الأيام عند استخدام رقم بين 1 و7 كـ index_num.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/choose-function"
		}],
		functionParameter: {
			indexNum: {
				name: "index_num",
				detail: "يحدد وسيطة القيمة المختارة. يجب أن يكون index_num رقماً بين 1 و254، أو صيغة أو مرجعاً إلى خلية تحتوي على رقم بين 1 و254.\nإذا كان index_num يساوي 1، تُرجع CHOOSE value1؛ وإذا كان 2 تُرجع value2، وهكذا.\nإذا كان index_num أقل من 1 أو أكبر من رقم آخر قيمة في القائمة، تُرجع CHOOSE الخطأ #VALUE!.\nإذا كان index_num كسراً، فيُقتطع إلى أصغر عدد صحيح قبل استخدامه."
			},
			value1: {
				name: "value1",
				detail: "تختار CHOOSE قيمة أو إجراءً لتنفيذه استناداً إلى index_num. يمكن أن تكون الوسيطات أرقاماً أو مراجع خلايا أو أسماء معرفة أو صيغاً أو دالات أو نصاً."
			},
			value2: {
				name: "value2",
				detail: "من 1 إلى 254 وسيطة قيمة."
			}
		}
	},
	CHOOSECOLS: {
		description: "يتم إرجاع الأعمدة المُحدَّدة من صفيف.",
		abstract: "يتم إرجاع الأعمدة المُحدَّدة من صفيف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/choosecols-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف الذي يحتوي على الأعمدة التي سيتم إرجاعها في الصفيف الجديد. مطلوبة."
			},
			colNum1: {
				name: "col_num1",
				detail: "العمود الأول الذي سيتم إرجاعه. مطلوبة."
			},
			colNum2: {
				name: "col_num2",
				detail: "أعمدة إضافية سيتم إرجاعها. اختيارية."
			}
		}
	},
	CHOOSEROWS: {
		description: "يتم إرجاع الصفوف المحددة من صفيف.",
		abstract: "يتم إرجاع الصفوف المحددة من صفيف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chooserows-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف الذي يحتوي على الأعمدة التي سيتم إرجاعها في الصفيف الجديد. مطلوبة."
			},
			rowNum1: {
				name: "row_num1",
				detail: "رقم الصف الأول الذي سيتم إرجاعه. مطلوبة."
			},
			rowNum2: {
				name: "row_num2",
				detail: "أرقام صفوف إضافية سيتم إرجاعها. اختيارية."
			}
		}
	},
	COLUMN: {
		description: "ترجع الدالة COLUMN رقم العمود لمرجع الخلية المحدد. على سبيل المثال، ترجع الصيغة =COLUMN(D10) 4، لأن العمود D هو العمود الرابع.",
		abstract: "ترجع الدالة COLUMN رقم العمود لمرجع الخلية المحدد. على سبيل المثال، ترجع الصيغة =COLUMN(D10) 4، لأن العمود D هو العمود الرابع.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/column-function"
		}],
		functionParameter: { reference: {
			name: "reference",
			detail: "الخلية أو نطاق الخلايا الذي تريد إرجاع رقم عموده."
		} }
	},
	COLUMNS: {
		description: "إرجاع عدد الأعمدة في صفيف أو مرجع.",
		abstract: "إرجاع عدد الأعمدة في صفيف أو مرجع.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/columns-function"
		}],
		functionParameter: { array: {
			name: "array",
			detail: "مطلوب. صفيف أو صيغة صفيف، أو مرجع لنطاق خلايا تريد عدد الأعمدة له."
		} }
	},
	DROP: {
		description: "يستثني عددا محددا من الصفوف أو الأعمدة من بداية الصفيف أو نهايته. قد تجد هذه الدالة مفيدة لإزالة الرؤوس والتذييلات في تقرير Excel لإرجاع البيانات فقط.",
		abstract: "يستثني عددا محددا من الصفوف أو الأعمدة من بداية الصفيف أو نهايته. قد تجد هذه الدالة مفيدة لإزالة الرؤوس والتذييلات في تقرير Excel لإرجاع البيانات فقط.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/drop-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف الذي سيتم إسقاط الصفوف أو الأعمدة منه."
			},
			rows: {
				name: "rows",
				detail: "عدد الصفوف التي يجب إسقاطها. يتم إسقاط قيمة سالبة من نهاية الصفيف."
			},
			columns: {
				name: "columns",
				detail: "عدد الأعمدة المراد استبعادها. يتم إسقاط قيمة سالبة من نهاية الصفيف."
			}
		}
	},
	EXPAND: {
		description: "توسيع صفيف أو لوحته لأبعاد الصفوف والأعمدة المحددة.",
		abstract: "توسيع صفيف أو لوحته لأبعاد الصفوف والأعمدة المحددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/expand-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف المراد توسيعه."
			},
			rows: {
				name: "rows",
				detail: "عدد الصفوف في الصفيف الموسع. إذا كان مفقودًا، فلن يتم توسيع الصفوف."
			},
			columns: {
				name: "columns",
				detail: "عدد الأعمدة في الصفيف الموسع. إذا كان مفقودًا، فلن يتم توسيع الأعمدة."
			},
			padWith: {
				name: "pad_with",
				detail: "القيمة التي سيتم لوحة بها. الإعداد الافتراضي هو #N/A."
			}
		}
	},
	FILTER: {
		description: "في المثال التالي استخدمنا الصيغة =FILTER(A5:D20,C5:C20=H2,\"\") لإرجاع كافة سجلات Apple، كما هو محدد في الخلية H2، وإذا لم تكن هناك تفاح، فسترجع سلسلة فارغة (\"\").",
		abstract: "في المثال التالي استخدمنا الصيغة =FILTER(A5:D20,C5:C20=H2,\"\") لإرجاع كافة سجلات Apple، كما هو محدد في الخلية H2، وإذا لم تكن هناك تفاح، فسترجع سلسلة فارغة (\"\").",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/filter-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف، أو النطاق المطلوب فرزه"
			},
			include: {
				name: "include",
				detail: "صفيف \"منطقي\" يكون ارتفاعه أو عرضه مثل الصفيف"
			},
			ifEmpty: {
				name: "if_empty",
				detail: "القيمة المطلوب إرجاعها إذا كانت كل القيم في الصفيف المضمن فارغة (لا يقوم عامل التصفية بإرجاع أي شيء)"
			}
		}
	},
	FORMULATEXT: {
		description: "تُرجع هذه الدالة الصيغة كسلسلة.",
		abstract: "تُرجع هذه الدالة الصيغة كسلسلة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/formulatext-function"
		}],
		functionParameter: { reference: {
			name: "reference",
			detail: "مطلوب. مرجع إلى خلية أو نطاق خلايا."
		} }
	},
	GETPIVOTDATA: {
		description: "تُرجع البيانات المرئية المخزنة في PivotTable.",
		abstract: "تُرجع البيانات المرئية المخزنة في PivotTable.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/getpivotdata-function"
		}],
		functionParameter: {
			dataField: {
				name: "dataField",
				detail: "اسم حقل PivotTable الذي يحتوي على البيانات التي تريد استردادها. يجب أن يكون هذا في علامات اقتباس. مثال: =GETPIVOTDATA(\"Sales\", A3). هنا، \"المبيعات\" هو حقل القيم الذي نريد استرداده. نظرا لعدم تحديد أي حقل آخر، ترجع GETPIVOTDATA إجمالي مبلغ المبيعات."
			},
			pivotTable: {
				name: "pivotTable",
				detail: "مرجع إلى أي خلية أو نطاق من الخلايا أو نطاق مسمى من الخلايا في PivotTable. يتم استخدام هذه المعلومات لتحديد أي PivotTable يحتوي على البيانات التي تريد استردادها. مثال: =GETPIVOTDATA(\"Sales\", A3). هنا، A3 هو مرجع داخل PivotTable ويخبر الصيغة التي PivotTable لاستخدامها."
			},
			field1: {
				name: "field1",
				detail: "أزواج أسماء الحقول وأسماء العناصر من 1 حتى 126 التي تصف البيانات التي تريد استردادها. يمكن وضع الأزواج بأي ترتيب. يجب تضمين أسماء الحقول وأسماء العناصر بخلاف التواريخ والأرقام بين علامات اقتباس. مثال: =GETPIVOTDATA(\"Sales\", A3, \"Month\", \"Mar\"). هنا، \"Month\" هو الحقل و\"Mar\" هو العنصر. لتحديد عناصر متعددة لحقل، قم بإحاطتها بأقواس متعرجة (على سبيل المثال: {\"Mar\"، \"Apr\"}). بالنسبة ل OLAP PivotTables ، يمكن أن تحتوي العناصر على الاسم المصدر للبعد وكذلك اسم مصدر العنصر. قد يظهر زوج حقل وعنصر PivotTable لـ OLAP، كما يلي: \"[المنتج]\"،\"[المنتج].[كافة المنتجات].[الأطعمة].[المنتجات المخبوزة]\""
			},
			item1: {
				name: "item1",
				detail: "أزواج أسماء الحقول وأسماء العناصر من 1 حتى 126 التي تصف البيانات التي تريد استردادها. يمكن وضع الأزواج بأي ترتيب. يجب تضمين أسماء الحقول وأسماء العناصر بخلاف التواريخ والأرقام بين علامات اقتباس. مثال: =GETPIVOTDATA(\"Sales\", A3, \"Month\", \"Mar\"). هنا، \"Month\" هو الحقل و\"Mar\" هو العنصر. لتحديد عناصر متعددة لحقل، قم بإحاطتها بأقواس متعرجة (على سبيل المثال: {\"Mar\"، \"Apr\"}). بالنسبة ل OLAP PivotTables ، يمكن أن تحتوي العناصر على الاسم المصدر للبعد وكذلك اسم مصدر العنصر. قد يظهر زوج حقل وعنصر PivotTable لـ OLAP، كما يلي: \"[المنتج]\"،\"[المنتج].[كافة المنتجات].[الأطعمة].[المنتجات المخبوزة]\""
			}
		}
	},
	HLOOKUP: {
		description: "يبحث عن قيمة في الصف العلوي من جدول أو صفيف من القيم، ثم يرجع قيمة في العمود نفسه من صف تحدده في الجدول أو الصفيف. استخدم HLOOKUP عندما تكون قيم المقارنة موجودة في أحد الصفوف أعلى جدول بيانات، وتريد البحث من أعلى إلى أسفل في عدد معين من الصفوف. استخدم VLOOKUP عندما تكون قيم المقارنة موجودة في عمود إلى يمين البيانات التي تريد البحث عنها.",
		abstract: "يبحث عن قيمة في الصف العلوي من جدول أو صفيف من القيم، ثم يرجع قيمة في العمود نفسه من صف تحدده في الجدول أو الصفيف. استخدم HLOOKUP عندما تكون قيم المقارنة موجودة في أحد الصفوف أعلى جدول بيانات، وتريد البحث من أعلى إلى أسفل في عدد معين من الصفوف. استخدم VLOOKUP عندما تكون قيم المقارنة موجودة في عمود إلى يمين البيانات التي تريد البحث عنها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hlookup-function"
		}],
		functionParameter: {
			lookupValue: {
				name: "lookup_value",
				detail: "مطلوب. قيمة يجب البحث عنها في الصف الأول من الجدول. يمكن أن تكون Lookup_value قيمة أو مرجعاً أو سلسلة نصية."
			},
			tableArray: {
				name: "table_array",
				detail: "مطلوب. جدول من المعلومات يتم البحث فيه عن البيانات. استخدم مرجعاً لنطاق أو اسم نطاق. يمكن أن تكون القيم في الصف الأول من table_array نصاً أو أرقاماً أو قيماً منطقية. إذا كانت قيمة range_lookup تساوي TRUE، فيجب وضع القيم في الصف الأول من table_array بترتيب تصاعدي: ... -2، -1، 0، 1، 2، ...، أ-ي، FALSE،‏ TRUE؛ وإلا فقد لا تُرجع الدالة HLOOKUP القيمة الصحيحة. إذا كانت قيمة range_lookup تساوي FALSE، فلا حاجة لإجراء فرز في table_array. إن النصوص ذات الأحرف الكبيرة مكافئة للنصوص ذات الأحرف الصغيرة. يمكنك فرز القيم بترتيب تصاعدي، من اليمين إلى اليسار. لمزيد من المعلومات، راجع فرز البيانات في نطاق أو جدول ."
			},
			rowIndexNum: {
				name: "row_index_num",
				detail: "مطلوب. رقم الصف في table_array التي سيتم إرجاع القيمة المطابقة منها. ترجع row_index_num من 1 قيمة الصف الأول في table_array، row_index_num من 2 ترجع قيمة الصف الثاني في table_array، وهكذا. إذا كان row_index_num أقل من 1، فترجع الدالة HLOOKUP #VALUE! قيمة الخطأ؛ إذا كان row_index_num أكبر من عدد الصفوف في table_array، فترجع الدالة HLOOKUP #REF! وهي قيمة خطأ."
			},
			rangeLookup: {
				name: "range_lookup",
				detail: "الاختياري. قيمة منطقية تحدد ما إذا كنت تريد من HLOOKUP البحث عن مطابقة تامة أم مطابقة تقريبية. إذا كانت هذه القيمة تساوي TRUE أو محذوفة، فيتم إرجاع مطابقة تقريبية. وبعبارة أخرى، في حالة عدم وجود مطابقة تامة، يتم إرجاع القيمة الكبرى التالية الأصغر من lookup_value. إذا كانت هذه القيمة تساوي FALSE، فتبحث الدالة HLOOKUP عن مطابقة تامة. وإذا لم يتم العثور على واحدة، فيتم إرجاع قيمة الخطأ ‎#N/A."
			}
		}
	},
	HSTACK: {
		description: "إلحاق الصفائف أفقياً وبتسلسل لإرجاع صفيف أكبر.",
		abstract: "إلحاق الصفائف أفقياً وبتسلسل لإرجاع صفيف أكبر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hstack-function"
		}],
		functionParameter: {
			array1: {
				name: "array",
				detail: "الصفائف المراد إلحاقها."
			},
			array2: {
				name: "array",
				detail: "الصفائف المراد إلحاقها."
			}
		}
	},
	HYPERLINK: {
		description: "تنشئ ارتباطاً تشعبياً داخل خلية.",
		abstract: "تنشئ ارتباطاً تشعبياً داخل خلية.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/3093313?hl=ar"
		}],
		functionParameter: {
			url: {
				name: "url",
				detail: "عنوان URL الكامل لموضع الارتباط، بين علامتي اقتباس، أو مرجع إلى خلية تحتوي على هذا العنوان. لا تُسمح إلا بأنواع ارتباط معينة: http:// وhttps:// وmailto: وaim: وftp:// وgopher:// وtelnet:// وnews://. إذا استُخدم بروتوكول آخر، يظهر link_label في الخلية دون ارتباط تشعبي. وإذا لم يُحدد بروتوكول، يُفترض http:// ويُضاف إلى url."
			},
			linkLabel: {
				name: "link_label",
				detail: "[اختياري — url افتراضياً] النص المعروض في الخلية كارتباط، بين علامتي اقتباس، أو مرجع إلى خلية تحتوي على تلك التسمية. إذا كان link_label مرجعاً إلى خلية فارغة، يُعرض url كرابط إذا كان صالحاً، أو كنص عادي في غير ذلك. إذا كان link_label سلسلة فارغة (\"\"), تبدو الخلية فارغة مع بقاء الارتباط متاحاً بالنقر أو بالانتقال إلى الخلية."
			}
		}
	},
	IMAGE: {
		description: "تدرج الدالة IMAGE الصور في خلايا من موقع مصدر إلى جانب النص البديل. يمكنك بعد ذلك نقل الخلايا وتغيير حجمها وفرزها وتصفيتها واستخدام الصور ضمن جدول Excel. استخدم هذه الدالة لتحسين قوائم البيانات بشكل مرئي مثل قوائم المخزون والألعاب والموظفين والمفاهيم الرياضية.",
		abstract: "تدرج الدالة IMAGE الصور في خلايا من موقع مصدر إلى جانب النص البديل. يمكنك بعد ذلك نقل الخلايا وتغيير حجمها وفرزها وتصفيتها واستخدام الصور ضمن جدول Excel. استخدم هذه الدالة لتحسين قوائم البيانات بشكل مرئي مثل قوائم المخزون والألعاب والموظفين والمفاهيم الرياضية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/image-function"
		}],
		functionParameter: {
			source: {
				name: "source",
				detail: "مسار URL لملف الصورة باستخدام بروتوكول \"https\"."
			},
			altText: {
				name: "alt_text",
				detail: "نص بديل يصف الصورة لأغراض إمكانية الوصول."
			},
			sizing: {
				name: "sizing",
				detail: "يحدد أبعاد الصورة."
			},
			height: {
				name: "height",
				detail: "الارتفاع المخصص للصورة بالبكسل."
			},
			width: {
				name: "width",
				detail: "العرض المخصص للصورة بالبكسل."
			}
		}
	},
	INDEX: {
		description: "إرجاع قيمة عنصر في جدول أو صفيف، تم تحديده بواسطة فهارس أرقام الصفوف والأعمدة.",
		abstract: "إرجاع قيمة عنصر في جدول أو صفيف، تم تحديده بواسطة فهارس أرقام الصفوف والأعمدة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/index-function"
		}],
		functionParameter: {
			reference: {
				name: "reference",
				detail: "مرجع إلى نطاق خلية واحد أو أكثر."
			},
			rowNum: {
				name: "row_num",
				detail: "رقم الصف في reference الذي سيُرجع مرجعاً منه."
			},
			columnNum: {
				name: "column_num",
				detail: "رقم العمود في reference الذي سيُرجع مرجعاً منه."
			},
			areaNum: {
				name: "area_num",
				detail: "يختار نطاقاً في reference يُرجع منه تقاطع row_num وcolumn_num."
			}
		}
	},
	INDIRECT: {
		description: "إرجاع المرجع المحدد بواسطة سلسلة نصية. يتم تقييم المراجع مباشرةً لعرض محتوياتها. استخدم INDIRECT عندما تريد تغيير مرجع إلى خلية داخل صيغة دون تغيير الصيغة نفسها.",
		abstract: "إرجاع المرجع المحدد بواسطة سلسلة نصية. يتم تقييم المراجع مباشرةً لعرض محتوياتها. استخدم INDIRECT عندما تريد تغيير مرجع إلى خلية داخل صيغة دون تغيير الصيغة نفسها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/indirect-function"
		}],
		functionParameter: {
			refText: {
				name: "ref_text",
				detail: "مطلوب. مرجع لخلية تحتوي على مرجع نمط A1، مرجع نمط R1C1، اسم معرف كمرجع، أو مرجع لخلية كسلسلة نصية. إذا لم تكن الوسيطة ref_text مرجع خلية صحيحة، فسترجع الدالة INDIRECT قيمة الخطأ #REF!. إذا كانت الوسيطة ref_text تشير إلى مصنف آخر (مرجع خارجي)، يجب أن يكون المصنف الآخر مفتوحاً. إذا لم يكن المصنف المصدر مفتوحاً، فسترجع الدالة INDIRECT قيمة الخطأ #REF!. ملاحظة المراجع الخارجية غير معتمدة في Excel Web App. إذا كانت الوسيطة ref_text تشير إلى نطاق خلايا خارج حد الصف 1048576 أو حد العمود 16384 (XFD)، ترجع INDIRECT قيمة الخطأ #REF!."
			},
			a1: {
				name: "a1",
				detail: "الاختياري. قيمة منطقية تحدد نوع المرجع الذى تم احتواؤه فى الخلية ref_text. إذا كانت a1 تساوي TRUE أو تم حذفها، يتم تفسير ref_text كمرجع نمط A1. إذا كانت a1 تساوي FALSE، يتم تفسير ref_text كمرجع نمط R1C1."
			}
		}
	},
	LOOKUP: {
		description: "يبحث نموذج الخط المتجه للدالة LOOKUP في نطاق صف واحد أو عمود واحد (ويُعرف ذلك بالخط المتجه) عن قيمة ما ويرجع قيمة من الموضع نفسه في نطاق ثانٍ من صف واحد أو عمود واحد.",
		abstract: "يبحث نموذج الخط المتجه للدالة LOOKUP في نطاق صف واحد أو عمود واحد (ويُعرف ذلك بالخط المتجه) عن قيمة ما ويرجع قيمة من الموضع نفسه في نطاق ثانٍ من صف واحد أو عمود واحد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/lookup-function"
		}],
		functionParameter: {
			lookupValue: {
				name: "lookup_value",
				detail: "قيمة تبحث LOOKUP عنها في المتجه الأول. يمكن أن تكون lookup_value رقماً أو نصاً أو قيمة منطقية أو اسماً أو مرجعاً يشير إلى قيمة."
			},
			lookupVectorOrArray: {
				name: "lookup_vectorOrArray",
				detail: "نطاق لا يحتوي إلا على صف واحد أو عمود واحد."
			},
			resultVector: {
				name: "result_vector",
				detail: "نطاق لا يحتوي إلا على صف واحد أو عمود واحد. يجب أن تكون وسيطة result_vector بالحجم نفسه لـ lookup_vector."
			}
		}
	},
	MATCH: {
		description: "تبحث الدالة مطابقة عن عنصر محدد في نطاق من الخلايا، ثم تُرجع الموضع النسبي لذلك العنصر في النطاق. على سبيل المثال، إذا احتوى النطاق A1:A3 على القيم 5 و25 و38، فستُرجع الصيغة ‎=MATCH(25,A1:A3,0)‎ الرقم 2، لأن 25 هو العنصر الثاني في النطاق.",
		abstract: "تبحث الدالة مطابقة عن عنصر محدد في نطاق من الخلايا، ثم تُرجع الموضع النسبي لذلك العنصر في النطاق. على سبيل المثال، إذا احتوى النطاق A1:A3 على القيم 5 و25 و38، فستُرجع الصيغة ‎=MATCH(25,A1:A3,0)‎ الرقم 2، لأن 25 هو العنصر الثاني في النطاق.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/match-function"
		}],
		functionParameter: {
			lookupValue: {
				name: "lookup_value",
				detail: "يعثر MATCH على أكبر قيمة أقل من أو تساوي lookup_value . يجب وضع القيم الموجودة في الوسيطة lookup_array بترتيب تصاعدي، على سبيل المثال: ...-2، -1، 0، 1، 2، ...، A-Z، FALSE، TRUE."
			},
			lookupArray: {
				name: "lookup_array",
				detail: "يعثر MATCH على القيمة الأولى التي تساوي تماما lookup_value . يمكن أن تكون القيم الموجودة في الوسيطة lookup_array بأي ترتيب."
			},
			matchType: {
				name: "match_type",
				detail: "يعثر MATCH على أصغر قيمة أكبر من أو تساوي lookup_value . يجب وضع القيم في الوسيطة lookup_array بترتيب تنازلي، على سبيل المثال: TRUE، FALSE، Z-A، ... 2 و1 و0 و-1 و-2 و...وما إلى ذلك."
			}
		}
	},
	OFFSET: {
		description: "تُرجع هذه الدالة مرجعاً إلى نطاق يتكوّن من عدد معين من الصفوف والأعمدة من خلية أو نطاق من الخلايا. يكون المرجع الذي يتم إرجاعه عبارة عن خلية واحدة أو نطاق من الخلايا. ويمكنك تحديد عدد الصفوف وعدد الأعمدة التي سيتم إرجاعها.",
		abstract: "تُرجع هذه الدالة مرجعاً إلى نطاق يتكوّن من عدد معين من الصفوف والأعمدة من خلية أو نطاق من الخلايا. يكون المرجع الذي يتم إرجاعه عبارة عن خلية واحدة أو نطاق من الخلايا. ويمكنك تحديد عدد الصفوف وعدد الأعمدة التي سيتم إرجاعها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/offset-function"
		}],
		functionParameter: {
			reference: {
				name: "reference",
				detail: "مطلوب. المرجع الذي تريد إنشاء الإزاحة منه. يجب أن يشير المرجع إلى خلية أو نطاق من الخلايا المتجاورة؛ وإلا، ترجع الدالة OFFSET #VALUE! وهي قيمة خطأ."
			},
			rows: {
				name: "rows",
				detail: "مطلوب. عدد الصفوف، للأعلى أو للأسفل، التي تريد أن تشير إليها الخلية العلوية اليمنى. يؤدي استخدام 5 كوسيطة الصفوف إلى تعيين وقوع الخلية العلوية اليمنى في المرجع أسفل المرجع بخمسة صفوف. من الممكن أن تكون قيمة وسيطة الصفوف موجبة (أي أسفل مرجع البدء) أو سالبة (أي أعلى مرجع البدء)."
			},
			cols: {
				name: "columns",
				detail: "مطلوب. عدد الأعمدة، إلى اليمين أو اليسار، التي تريد أن تشير الخلية العلوية اليمنى من النتيجة إليها. يؤدي استخدام 5 كوسيطة الأعمدة إلى تعيين وقوع الخلية العلوية اليمنى في المرجع إلى يسار المرجع بمقدار خمسة صفوف. من الممكن أن تكون قيمة وسيطة الأعمدة موجبة (أي إلى يسار مرجع البدء) أو سالبة (أي إلى يمين مرجع البدء)."
			},
			height: {
				name: "height",
				detail: "الاختياري. الارتفاع، في عدد الصفوف، الذي تريده للمرجع الذي يتم إرجاعه. يجب أن تكون قيمة الارتفاع رقماً موجباً."
			},
			width: {
				name: "width",
				detail: "الاختياري. العرض، في عدد الأعمدة، الذي تريده للمرجع الذي يتم إرجاعه. يجب أن تكون قيمة العرض رقماً موجباً."
			}
		}
	},
	ROW: {
		description: "تُرجع هذه الدالة رقم صف المرجع.",
		abstract: "تُرجع هذه الدالة رقم صف المرجع.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/row-function"
		}],
		functionParameter: { reference: {
			name: "reference",
			detail: "الاختياري. الخلية أو نطاق الخلايا التي تريد إرجاع رقم صفها. إذا تم حذف الوسيطة reference، فسيُفتراض أنها مرجع الخلية حيث تظهر الدالة ROW. إذا كان المرجع عبارة عن نطاق من الخلايا، وإذا تم إدخال ROW كصفيف عمودي، فترجع ROW أرقام صفوف المرجع كصفيف عمودي. لا يمكن للوسيطة Reference أن تشير إلى نواحٍ متعددة."
		} }
	},
	ROWS: {
		description: "إرجاع عدد الصفوف في مرجع أو صفيف.",
		abstract: "إرجاع عدد الصفوف في مرجع أو صفيف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rows-function"
		}],
		functionParameter: { array: {
			name: "array",
			detail: "مطلوب. صفيف أو صيغة صفيف أو مرجع لنطاق خلايا تريد عدد الصفوف له."
		} }
	},
	RTD: {
		description: "تقوم باسترداد بيانات الوقت الحقيقي من برنامج يعتمد التنفيذ التلقائي لـ COM.",
		abstract: "تقوم باسترداد بيانات الوقت الحقيقي من برنامج يعتمد التنفيذ التلقائي لـ COM.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rtd-function"
		}],
		functionParameter: {
			progId: {
				name: "progId",
				detail: "مطلوب. اسم ProgID للوظيفة الإضافية أتمتة COM المسجلة التي تم تثبيتها على الكمبيوتر المحلي. ضع الاسم بين علامتي اقتباس."
			},
			server: {
				name: "server",
				detail: "مطلوب. وهي عبارة عن اسم الخادم الذي يجب تشغيل الوظيفة الإضافية عليه. وإذا لم يكن هناك أي خادم، وكان البرنامج قيد التشغيل محلياً، فاترك الوسيطة فارغة. وإلا، فأدخل علامتي اقتباس (\"\") حول اسم الخادم. أما عند استخدام الدالة RTD داخل Visual Basic for Applications (VBA)‎، فمن الضروري استخدام علامات اقتباس مزدوجة أو الخاصية NullString الموجودة في VBA للخادم، حتى إذا كان هذا الخادم قيد التشغيل محلياً."
			},
			topic1: {
				name: "topic1",
				detail: "Topic1 مطلوب، والمواضيع اللاحقة اختيارية. وهي معلمات من 1 إلى 253 تمثل معاً جزءاً فريداً من بيانات الوقت الحقيقي."
			},
			topic2: {
				name: "topic2",
				detail: "Topic1 مطلوب، والمواضيع اللاحقة اختيارية. وهي معلمات من 1 إلى 253 تمثل معاً جزءاً فريداً من بيانات الوقت الحقيقي."
			}
		}
	},
	SORT: {
		description: "في هذا المثال، نقوم بالفرز حسب المنطقة ومندوب المبيعات والمنتج بشكل فردي باستخدام = SORT (A2: A17)، التي يتم نسخها عبر الخلايا F2 وH2 وJ2.",
		abstract: "في هذا المثال، نقوم بالفرز حسب المنطقة ومندوب المبيعات والمنتج بشكل فردي باستخدام = SORT (A2: A17)، التي يتم نسخها عبر الخلايا F2 وH2 وJ2.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sort-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "نطاق أو صفيف لإجراء الفرز"
			},
			sortIndex: {
				name: "sort_index",
				detail: "رقم يشير إلى الصف أو العمود للفرز حسب"
			},
			sortOrder: {
				name: "sort_order",
				detail: "رقم يشير إلى ترتيب الفرز المطلوب 1 لترتيب تصاعدي (افتراضي)، -1 لترتيب تنازلي"
			},
			byCol: {
				name: "by_col",
				detail: "قيمة منطقية تشير إلى اتجاه الفرز المطلوب؛ FALSE للفرز حسب الصف (افتراضي)، TRUE للفرز حسب العمود"
			}
		}
	},
	SORTBY: {
		description: "في هذا المثال، قمنا بفرز قائمة بأسماء الأشخاص حسب عمرهم، بترتيب تصاعدي.",
		abstract: "في هذا المثال، قمنا بفرز قائمة بأسماء الأشخاص حسب عمرهم، بترتيب تصاعدي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sortby-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف أو النطاق المطلوب فرزه"
			},
			byArray1: {
				name: "by_array1",
				detail: "الصفيف أو النطاق المطلوب فرزه"
			},
			sortOrder1: {
				name: "sort_order1",
				detail: "الترتيب المطلوب استخدامه للفرز. 1 للتصاعدي، -1 للتنازلي. الافتراضي تصاعدي."
			},
			byArray2: {
				name: "by_array2",
				detail: "الصفيف أو النطاق المطلوب فرزه"
			},
			sortOrder2: {
				name: "sort_order2",
				detail: "الترتيب المطلوب استخدامه للفرز. 1 للتصاعدي، -1 للتنازلي. الافتراضي تصاعدي."
			}
		}
	},
	TAKE: {
		description: "إرجاع عدد محدد من الصفوف أو الأعمدة المتجاورة من بداية الصفيف أو نهايته.",
		abstract: "إرجاع عدد محدد من الصفوف أو الأعمدة المتجاورة من بداية الصفيف أو نهايته.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/take-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف الذي يجب أخذ الصفوف أو الأعمدة منه."
			},
			rows: {
				name: "rows",
				detail: "عدد الصفوف التي يجب أخذها. تأخذ القيمة السالبة من نهاية الصفيف."
			},
			columns: {
				name: "columns",
				detail: "عدد الأعمدة التي يجب أخذها. تأخذ القيمة السالبة من نهاية الصفيف."
			}
		}
	},
	TOCOL: {
		description: "إرجاع ARRAY في عمود واحد.",
		abstract: "إرجاع ARRAY في عمود واحد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tocol-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف أو المرجع المراد إرجاعه كعمود."
			},
			ignore: {
				name: "ignore",
				detail: "ما إذا كان يجب تجاهل أنواع معينة من القيم. افتراضياً لا تُتجاهل أي قيم. حدد أحد الآتي:\n0 الاحتفاظ بكل القيم (افتراضي)\n1 تجاهل الخلايا الفارغة\n2 تجاهل الأخطاء\n3 تجاهل الخلايا الفارغة والأخطاء"
			},
			scanByColumn: {
				name: "scan_by_column",
				detail: "يفحص الصفيف حسب العمود. افتراضياً يُفحص الصفيف حسب الصف. يحدد الفحص ما إذا كانت القيم مرتبة حسب الصف أو العمود."
			}
		}
	},
	TOROW: {
		description: "إرجاع الصفيف في صفٍ واحد.",
		abstract: "إرجاع الصفيف في صفٍ واحد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/torow-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف أو المرجع المراد إرجاعه كصف."
			},
			ignore: {
				name: "ignore",
				detail: "ما إذا كان يجب تجاهل أنواع معينة من القيم. افتراضياً لا تُتجاهل أي قيم. حدد أحد الآتي:\n0 الاحتفاظ بكل القيم (افتراضي)\n1 تجاهل الخلايا الفارغة\n2 تجاهل الأخطاء\n3 تجاهل الخلايا الفارغة والأخطاء"
			},
			scanByColumn: {
				name: "scan_by_column",
				detail: "يفحص الصفيف حسب العمود. افتراضياً يُفحص الصفيف حسب الصف. يحدد الفحص ما إذا كانت القيم مرتبة حسب الصف أو العمود."
			}
		}
	},
	TRANSPOSE: {
		description: "في بعض الأحيان ترغب في تبديل الخلايا أو تدويرها. يمكنك إجراء ذلك عن طريق نسخ خيار تبديل الموضع ولصقه واستخدامه . لكن القيام بذلك سيؤدي إلى إنشاء بيانات مكررة. وإذا لم تكن ترغب في ذلك، يمكنك كتابة صيغة بدلاً من ذلك باستخدام الدالة TRANSPOSE. على سبيل المثال، في الصور التالية، تأخذ الصيغة =TRANSPOSE‏(A1:B4)‏ الخلايا من A1 إلى B4 وتقوم بترتيبها أفقياً.",
		abstract: "في بعض الأحيان ترغب في تبديل الخلايا أو تدويرها. يمكنك إجراء ذلك عن طريق نسخ خيار تبديل الموضع ولصقه واستخدامه . لكن القيام بذلك سيؤدي إلى إنشاء بيانات مكررة. وإذا لم تكن ترغب في ذلك، يمكنك كتابة صيغة بدلاً من ذلك باستخدام الدالة TRANSPOSE. على سبيل المثال، في الصور التالية، تأخذ الصيغة =TRANSPOSE‏(A1:B4)‏ الخلايا من A1 إلى B4 وتقوم بترتيبها أفقياً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/transpose-function"
		}],
		functionParameter: { array: {
			name: "array",
			detail: "نطاق خلايا أو صفيف في ورقة عمل."
		} }
	},
	UNIQUE: {
		description: "إرجاع أسماء فريدة من قائمة الأسماء",
		abstract: "إرجاع أسماء فريدة من قائمة الأسماء",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/unique-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "النطاق أو الصفيف الذي سيتم إرجاع صفوف أو أعمدة فريدة منه"
			},
			byCol: {
				name: "by_col",
				detail: "الوسيطة by_col هي قيمة منطقية تشير إلى كيفية المقارنة. سيقوم TRUE بمقارنة الأعمدة مقابل بعضها البعض وإرجاع الأعمدة الفريدة سيقوم FALSE (أو تم حذفه) بمقارنة الصفوف مقابل بعضها البعض وإرجاع الصفوف الفريدة"
			},
			exactlyOnce: {
				name: "exactly_once",
				detail: "الوسيطة exactly_once هي قيمة منطقية ستعيد الصفوف أو الأعمدة التي تحدث مرة واحدة بالضبط في النطاق أو الصفيف. هذا هو مفهوم قاعدة البيانات الفريد. سيعيد TRUE جميع الصفوف أو الأعمدة المميزة التي تحدث مرة واحدة بالضبط من النطاق أو الصفيف سيعيد FALSE (أو تم حذفه) جميع الصفوف أو الأعمدة المميزة من النطاق أو الصفيف"
			}
		}
	},
	VLOOKUP: {
		description: "استخدام الدالة VLOOKUP للبحث عن قيمة في جدول.",
		abstract: "استخدام الدالة VLOOKUP للبحث عن قيمة في جدول.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/vlookup-function"
		}],
		functionParameter: {
			lookupValue: {
				name: "lookup_value",
				detail: "القيمة التي تريد البحث عنها. يجب أن تكون في العمود الأول من نطاق الخلايا المحدد في table_array."
			},
			tableArray: {
				name: "table_array",
				detail: "نطاق الخلايا الذي تبحث فيه VLOOKUP عن lookup_value وقيمة الإرجاع. يمكنك استخدام نطاق مسمى أو جدول، كما يمكنك استخدام أسماء بدلاً من مراجع الخلايا."
			},
			colIndexNum: {
				name: "col_index_num",
				detail: "رقم العمود الذي يحتوي على قيمة الإرجاع، بدءاً من 1 للعمود الموجود في أقصى يسار table_array."
			},
			rangeLookup: {
				name: "range_lookup",
				detail: "قيمة منطقية تحدد ما إذا كانت VLOOKUP تبحث عن تطابق تقريبي أو تام: تطابق تقريبي — 1/TRUE، وتطابق تام — 0/FALSE."
			}
		}
	},
	VSTACK: {
		description: "تلحق الصفائف عمودياً وبتسلسل لترجع صفيفاً أكبر.",
		abstract: "تلحق الصفائف عمودياً وبتسلسل لترجع صفيفاً أكبر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/vstack-function"
		}],
		functionParameter: {
			array1: {
				name: "array",
				detail: "الصفائف المراد إلحاقها."
			},
			array2: {
				name: "array",
				detail: "الصفائف المراد إلحاقها."
			}
		}
	},
	WRAPCOLS: {
		description: "التفاف صف أو عمود القيم المقدم بواسطة الأعمدة بعد عدد محدد من العناصر.",
		abstract: "التفاف صف أو عمود القيم المقدم بواسطة الأعمدة بعد عدد محدد من العناصر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/wrapcols-function"
		}],
		functionParameter: {
			vector: {
				name: "vector",
				detail: "المتجه أو المرجع المراد التفافه."
			},
			wrapCount: {
				name: "wrap_count",
				detail: "الحد الأقصى لعدد القيم لكل عمود."
			},
			padWith: {
				name: "pad_with",
				detail: "القيمة التي سيتم لوحة بها. الإعداد الافتراضي هو #N/A."
			}
		}
	},
	WRAPROWS: {
		description: "يلف الصف أو العمود المتوفر للقيم حسب الصفوف بعد عدد محدد من العناصر لتكوين صفيف جديد.",
		abstract: "يلف الصف أو العمود المتوفر للقيم حسب الصفوف بعد عدد محدد من العناصر لتكوين صفيف جديد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/wraprows-function"
		}],
		functionParameter: {
			vector: {
				name: "vector",
				detail: "المتجه أو المرجع المراد التفافه."
			},
			wrapCount: {
				name: "wrap_count",
				detail: "الحد الأقصى لعدد القيم لكل صف."
			},
			padWith: {
				name: "pad_with",
				detail: "القيمة التي سيتم لوحة بها. الإعداد الافتراضي هو #N/A."
			}
		}
	},
	XLOOKUP: {
		description: "استخدم الدالة XLOOKUP للعثور على الأشياء في جدول أو نطاق حسب الصف. على سبيل المثال، ابحث عن سعر جزء السيارات حسب رقم الجزء، أو ابحث عن اسم موظف استنادا إلى معرف الموظف الخاص به. باستخدام XLOOKUP، يمكنك البحث في عمود واحد عن مصطلح بحث وإرجاع نتيجة من الصف نفسه في عمود آخر، بغض النظر عن الجانب الذي يعمل عليه عمود الإرجاع.",
		abstract: "استخدم الدالة XLOOKUP للعثور على الأشياء في جدول أو نطاق حسب الصف. على سبيل المثال، ابحث عن سعر جزء السيارات حسب رقم الجزء، أو ابحث عن اسم موظف استنادا إلى معرف الموظف الخاص به. باستخدام XLOOKUP، يمكنك البحث في عمود واحد عن مصطلح بحث وإرجاع نتيجة من الصف نفسه في عمود آخر، بغض النظر عن الجانب الذي يعمل عليه عمود الإرجاع.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/xlookup-function"
		}],
		functionParameter: {
			lookupValue: {
				name: "lookup_value",
				detail: "القيمة التي يجب البحث عنها *إذا تم حذفه، ترجع XLOOKUP الخلايا الفارغة التي يعثر عليها في lookup_array ."
			},
			lookupArray: {
				name: "lookup_array",
				detail: "الصفيف أو النطاق المراد البحث فيه"
			},
			returnArray: {
				name: "return_array",
				detail: "الصفيف أو النطاق المراد إرجاعه"
			},
			ifNotFound: {
				name: "if_not_found",
				detail: "في حالة عدم العثور على تطابق صحيح، قم بإعادة النص [if_not_found] الذي توفره. إذا لم يتم العثور على تطابق صالح، وكان [if_not_found] مفقودا، يتم إرجاع #N/A ."
			},
			matchMode: {
				name: "match_mode",
				detail: "حدد نوع المطابقة: 0 - المطابقة الدقيقة. إذا لم يتم العثور على أي منها، فارجع #N/A. هذا هو الإعداد الافتراضي. -1 - التطابق الدقيق. إذا لم يتم العثور على أي عنصر، فسترجع العنصر الأصغر التالي. 1 - التطابق الدقيق. إذا لم يتم العثور على أي عنصر، فسترجع العنصر الأكبر التالي. 2 - تطابق أحرف البدل حيث *و?و ~ لها معنى خاص ."
			},
			searchMode: {
				name: "search_mode",
				detail: "حدد وضع البحث لاستخدامه: 1 - إجراء بحث بدءا من العنصر الأول. هذا هو الإعداد الافتراضي. -1 - إجراء بحث عكسي بدءا من العنصر الأخير. 2 - إجراء بحث ثنائي يعتمد على lookup_array يتم فرزها بترتيب تصاعدي . إذا لم يتم فرزها، فسيتم إرجاع نتائج غير صالحة. -2 - إجراء بحث ثنائي يعتمد على lookup_array يتم فرزها بترتيب تنازلي . إذا لم يتم فرزها، فسيتم إرجاع نتائج غير صالحة."
			}
		}
	},
	XMATCH: {
		description: "افترض أن لدينا قائمة بالمنتجات في الخلايا من C3 إلى C7 ونرغب في تحديد مكان وجود المنتج من الخلية E3 في القائمة. هنا، سنستخدم XMATCH لتحديد موضع العنصر داخل قائمة.",
		abstract: "افترض أن لدينا قائمة بالمنتجات في الخلايا من C3 إلى C7 ونرغب في تحديد مكان وجود المنتج من الخلية E3 في القائمة. هنا، سنستخدم XMATCH لتحديد موضع العنصر داخل قائمة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/xmatch-function"
		}],
		functionParameter: {
			lookupValue: {
				name: "lookup_value",
				detail: "قيمة البحث"
			},
			lookupArray: {
				name: "lookup_array",
				detail: "الصفيف أو النطاق المراد البحث فيه"
			},
			matchMode: {
				name: "match_mode",
				detail: "حدد نوع المطابقة: 0 - المطابقة الدقيقة (افتراضي) -1 - مطابقة تامة أو أصغر عنصر تالية 1 - المطابقة الدقيقة أو العنصر الأكبر التالي 2 - تطابق أحرف البدل حيث *و?و ~ لها معنى خاص ."
			},
			searchMode: {
				name: "search_mode",
				detail: "حدد نوع البحث: 1 - البحث من الأول إلى الأخير (افتراضي) -1 - البحث من الأخير إلى الأول (البحث العكسي). 2 - إجراء بحث ثنائي يعتمد على lookup_array يتم فرزها بترتيب تصاعدي . إذا لم يتم فرزها، فسيتم إرجاع نتائج غير صالحة. -2 - إجراء بحث ثنائي يعتمد على lookup_array يتم فرزها بترتيب تنازلي . إذا لم يتم فرزها، فسيتم إرجاع نتائج غير صالحة."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/math/ar-SA.ts
const locale$5 = {
	ABS: {
		description: "تُرجع القيمة المطلقة لرقم. والقيمة المطلقة لرقم هي الرقم بدون العلامة الخاصة به.",
		abstract: "تُرجع القيمة المطلقة لرقم. والقيمة المطلقة لرقم هي الرقم بدون العلامة الخاصة به.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/abs-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي الرقم الحقيقي الذي تريد قيمته المطلقة."
		} }
	},
	ACOS: {
		description: "تُرجع قوس جيب التمام أو جيب التمام العكسي لرقم. إن قوس جيب التمام هو زاوية جيب تمامها عبارة عن رقم . ويتم تعيين الزاوية التي يتم إرجاعها بالتقدير الدائري في النطاق من 0 (صفر) إلى باي.",
		abstract: "تُرجع قوس جيب التمام أو جيب التمام العكسي لرقم. إن قوس جيب التمام هو زاوية جيب تمامها عبارة عن رقم . ويتم تعيين الزاوية التي يتم إرجاعها بالتقدير الدائري في النطاق من 0 (صفر) إلى باي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/acos-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي جيب تمام الزاوية الذي تريده ويجب أن يكون من 1- إلى 1."
		} }
	},
	ACOSH: {
		description: "تُرجع جيب التمام العكسي للقطع الزائد لأحد الأرقام. يجب أن يكون الرقم أكبر من أو يساوي 1. ويعد جيب التمام العكسي للقطع الزائد عبارة عن القيمة التي يكون جيب تمام القطع الزائد الخاص بها عبارة عن رقم ، بحيث تساوي ACOSH(COSH(number))‎ رقماً .",
		abstract: "تُرجع جيب التمام العكسي للقطع الزائد لأحد الأرقام. يجب أن يكون الرقم أكبر من أو يساوي 1. ويعد جيب التمام العكسي للقطع الزائد عبارة عن القيمة التي يكون جيب تمام القطع الزائد الخاص بها عبارة عن رقم ، بحيث تساوي ACOSH(COSH(number))‎ رقماً .",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/acosh-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي أي رقم حقيقي يساوي أو أكبر من 1."
		} }
	},
	ACOT: {
		description: "تُرجع هذه الدالة القيمة الأساسية لقوس ظل تمام الزاوية أو ظل التمام العكسي لرقم.",
		abstract: "تُرجع هذه الدالة القيمة الأساسية لقوس ظل تمام الزاوية أو ظل التمام العكسي لرقم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/acot-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم هو ظل الزاوية التي تريدها. يجب أن يكون هذا رقما حقيقيا."
		} }
	},
	ACOTH: {
		description: "تُرجع ظل التمام الزائدي العكسي لرقم.",
		abstract: "تُرجع ظل التمام الزائدي العكسي لرقم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/acoth-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "يجب أن تكون القيمة المطلقة للعدد Number أكبر من 1."
		} }
	},
	AGGREGATE: {
		description: "تُرجع هذه الدالة مجموعاً في قائمة أو قاعدة بيانات. يمكن أن تقوم الدالة AGGREGATE بتطبيق دالات تجميعية مختلفة على قائمة أو قاعدة بيانات مع توفير خيار تجاهل الصفوف المخفية وقيم الخطأ.",
		abstract: "تُرجع هذه الدالة مجموعاً في قائمة أو قاعدة بيانات. يمكن أن تقوم الدالة AGGREGATE بتطبيق دالات تجميعية مختلفة على قائمة أو قاعدة بيانات مع توفير خيار تجاهل الصفوف المخفية وقيم الخطأ.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/aggregate-function"
		}],
		functionParameter: {
			functionNum: {
				name: "function_num",
				detail: "مطلوب. رقم من 1 إلى 19 يحدد الدالة المراد استخدامها."
			},
			options: {
				name: "options",
				detail: "مطلوب. قيمة رقمية تحدد القيم المُراد تجاهلها في نطاق التقييم للدالة. ملاحظة لن تتجاهل الدالة الصفوف المخفية أو الإجماليات الفرعية المتداخلة أو التجميعات المتداخلة إذا كانت وسيطة الصفيف تتضمن عملية حسابية، على سبيل المثال: =AGGREGATE(14,3,A1:A100*(A1:A100>0),1)"
			},
			ref1: {
				name: "ref1",
				detail: "مطلوب. وهي الوسيطة الرقمية الأولى للدالات التي تضم وسيطات رقمية متعددة تريد القيمة التجميعية لها."
			},
			ref2: {
				name: "ref2",
				detail: "الاختياري. وهي الوسيطات الرقمية من 2 حتى 253 التي تريد القيمة التجميعية لها. بالنسبة إلى الدالات التي تضم صفيفاً، تكون ref1 عبارة عن صفيف أو صيغة صفيف أو مرجع لنطاق من الخلايا التي تريد القيمة التجميعية لها. وتعتبر Ref2 وسيطة ثانية مطلوبة لدالات معينة. تتطلب الدالات التالية الوسيطة ref2:"
			}
		}
	},
	ARABIC: {
		description: "تحويل رقم روماني إلى رقم عربي.",
		abstract: "تحويل رقم روماني إلى رقم عربي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/arabic-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. سلسلة محاطة بعلامات اقتباس أو سلسلة فارغة (\"\") أو مرجع إلى خلية تحتوي على نص."
		} }
	},
	ASIN: {
		description: "تُرجع قوس جيب الزاوية أو الجيب العكسي لأحد الأرقام. إن قوس الجيب هو الزاوية التي يكون الجيب الخاص بها عبارة عن رقم . يتم تعيين الزاوية التي يتم إرجاعها بالتقدير الدائري في النطاق من -pi/2 إلى pi/2.",
		abstract: "تُرجع قوس جيب الزاوية أو الجيب العكسي لأحد الأرقام. إن قوس الجيب هو الزاوية التي يكون الجيب الخاص بها عبارة عن رقم . يتم تعيين الزاوية التي يتم إرجاعها بالتقدير الدائري في النطاق من -pi/2 إلى pi/2.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/asin-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي جيب الزاوية الذي تريده ويجب أن يتراوح بين 1- و1."
		} }
	},
	ASINH: {
		description: "تُرجع جيب الزاوية العكسي للقطع الزائد لأحد الأرقام. إن جيب الزاوية العكسي للقطع الزائد هو القيمة التي يكون جيب زاوية القطع الزائد الخاص بها عبارة عن رقم ، بحيث تساوي ASINH(SINH(number))‎ ‏ رقماً .",
		abstract: "تُرجع جيب الزاوية العكسي للقطع الزائد لأحد الأرقام. إن جيب الزاوية العكسي للقطع الزائد هو القيمة التي يكون جيب زاوية القطع الزائد الخاص بها عبارة عن رقم ، بحيث تساوي ASINH(SINH(number))‎ ‏ رقماً .",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/asinh-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. أي رقم حقيقي."
		} }
	},
	ATAN: {
		description: "تُرجع قوس ظل الزاوية أو المماس المعكوس لأحد الأرقام. إن قوس ظل الزاوية هو الزاوية التي يكون المماس الخاص بها عبارة عن رقم . ويتم تعيين الزاوية التي يتم إرجاعها بالتقدير الدائري في النطاق من -pi/2 إلى pi/2.",
		abstract: "تُرجع قوس ظل الزاوية أو المماس المعكوس لأحد الأرقام. إن قوس ظل الزاوية هو الزاوية التي يكون المماس الخاص بها عبارة عن رقم . ويتم تعيين الزاوية التي يتم إرجاعها بالتقدير الدائري في النطاق من -pi/2 إلى pi/2.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/atan-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. مماس الزاوية التي تريدها."
		} }
	},
	ATAN2: {
		description: "تُرجع قوس ظل الزاوية أو المماس المعكوس للإحداثيين المحددين س وص. إن قوس ظل الزاوية هو الزاوية من المحور \"س\" إلى خط يحتوي على نقطة الأصل (0، 0) والنقطة ذات الإحداثيين (x_num وy_num). يتم تعيين الزاوية بالتقدير الدائري بين -pi وpi، مع استثناء -pi.",
		abstract: "تُرجع قوس ظل الزاوية أو المماس المعكوس للإحداثيين المحددين س وص. إن قوس ظل الزاوية هو الزاوية من المحور \"س\" إلى خط يحتوي على نقطة الأصل (0، 0) والنقطة ذات الإحداثيين (x_num وy_num). يتم تعيين الزاوية بالتقدير الدائري بين -pi وpi، مع استثناء -pi.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/atan2-function"
		}],
		functionParameter: {
			xNum: {
				name: "x_num",
				detail: "مطلوب. وهي الإحداثي س للنقطة."
			},
			yNum: {
				name: "y_num",
				detail: "مطلوب. وهي الإحداثي ص للنقطة."
			}
		}
	},
	ATANH: {
		description: "تُرجع الظل العكسي لقطع زائد لأحد الأرقام. يجب أن يكون الرقم بين -1 و1 (باستثناء -1 و1). إن الظل العكسي للقطع الزائد هو القيمة التي يكون ظل الزاوية للقطع الزائد الخاص بها عبارة عن رقم ، وبذلك فإن ATANH(TANH(number))‎ تساوي رقماً .",
		abstract: "تُرجع الظل العكسي لقطع زائد لأحد الأرقام. يجب أن يكون الرقم بين -1 و1 (باستثناء -1 و1). إن الظل العكسي للقطع الزائد هو القيمة التي يكون ظل الزاوية للقطع الزائد الخاص بها عبارة عن رقم ، وبذلك فإن ATANH(TANH(number))‎ تساوي رقماً .",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/atanh-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. أي رقم حقيقي بين 1 و-1."
		} }
	},
	BASE: {
		description: "تحوّل رقماً إلى تمثيل نصي باستخدام الجذر (الأساس).",
		abstract: "تحوّل رقماً إلى تمثيل نصي باستخدام الجذر (الأساس).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/base-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الذي تريد تحويله. يجب أن يكون عددا صحيحا أكبر من أو يساوي 0 وأقل من 2^53."
			},
			radix: {
				name: "radix",
				detail: "مطلوب. radix الأساسي الذي تريد تحويل الرقم إليه. يجب أن يكون عددا صحيحا أكبر من أو يساوي 2 وأقل من أو يساوي 36."
			},
			minLength: {
				name: "min_length",
				detail: "الاختياري. الحد الأدنى لطول السلسلة التي تم إرجاعها. يجب أن يكون عددا صحيحا أكبر من أو يساوي 0."
			}
		}
	},
	CEILING: {
		description: "تُرجع رقماً تم تقريبه للأعلى، بعيداً عن الصفر، إلى أقرب مضاعف للوسيطة significance. على سبيل المثال، إذا كنت تريد تجنب استخدام السنت في الأسعار وكان سعر المنتج 4,42 ر.س.، فاستخدم الصيغة ‎=CEILING(4,42,0,05)‎ لتقريب السعر للأعلى إلى أقرب مبلغ صحيح.",
		abstract: "تُرجع رقماً تم تقريبه للأعلى، بعيداً عن الصفر، إلى أقرب مضاعف للوسيطة significance. على سبيل المثال، إذا كنت تريد تجنب استخدام السنت في الأسعار وكان سعر المنتج 4,42 ر.س.، فاستخدم الصيغة ‎=CEILING(4,42,0,05)‎ لتقريب السعر للأعلى إلى أقرب مبلغ صحيح.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ceiling-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. وهي القيمة التي تريد تقريبها."
			},
			significance: {
				name: "significance",
				detail: "مطلوب. وهي المضاعف الذي تريد التقريب إليه."
			}
		}
	},
	CEILING_MATH: {
		description: "السقف. تقوم الدالة MATH بتقريب رقم إلى الأعلى إلى أقرب عدد صحيح أو اختياريا إلى أقرب مضاعف ذي أهمية.",
		abstract: "السقف. تقوم الدالة MATH بتقريب رقم إلى الأعلى إلى أقرب عدد صحيح أو اختياريا إلى أقرب مضاعف ذي أهمية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ceiling-math-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوب. (يجب أن يكون بين -2.229E-308.و9.99E+307.)"
			},
			significance: {
				name: "significance",
				detail: "الاختياري. هذا هو عدد الأرقام الهامة بعد الفاصلة العشرية التي سيتم تقريب الرقم إليها."
			},
			mode: {
				name: "mode",
				detail: "الاختياري. يتحكم هذا في ما إذا كان يتم تقريب الأرقام السالبة نحو الصفر أو بعيدا عنه."
			}
		}
	},
	CEILING_PRECISE: {
		description: "إرجاع رقم تم تقريبه إلى الأعلى إلى أقرب رقم صحيح أو إلى أقرب مضاعف من مضاعفات significance. ويتم تقريب الرقم إلى الأعلى بغض النظر عن علامته. ولكن إذا كانت قيمة الوسيطة Number أو significance عبارة عن صفر، فيتم إرجاع الصفر.",
		abstract: "إرجاع رقم تم تقريبه إلى الأعلى إلى أقرب رقم صحيح أو إلى أقرب مضاعف من مضاعفات significance. ويتم تقريب الرقم إلى الأعلى بغض النظر عن علامته. ولكن إذا كانت قيمة الوسيطة Number أو significance عبارة عن صفر، فيتم إرجاع الصفر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ceiling-precise-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. وهي القيمة المراد تقريبها."
			},
			significance: {
				name: "significance",
				detail: "الاختياري. وهي المضاعف المراد تقريب الرقم إليه. إذا تم حذف الوسيطة significance، فتكون قيمتها الافتراضية 1."
			}
		}
	},
	COMBIN: {
		description: "تُرجع عدد التوافقيات لعدد معين من العناصر. استخدم COMBIN لتحديد إجمالي عدد المجموعات المحتملة لعدد معين من العناصر.",
		abstract: "تُرجع عدد التوافقيات لعدد معين من العناصر. استخدم COMBIN لتحديد إجمالي عدد المجموعات المحتملة لعدد معين من العناصر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/combin-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. وهي عدد العناصر."
			},
			numberChosen: {
				name: "number_chosen",
				detail: "مطلوب. وهي عدد العناصر الموجودة في كل توافقية."
			}
		}
	},
	COMBINA: {
		description: "تُرجع هذه الدالة عدد التركيبات (مع التكرارات) لعدد معين من العناصر.",
		abstract: "تُرجع هذه الدالة عدد التركيبات (مع التكرارات) لعدد معين من العناصر.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/combina-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. يجب أن يكون أكبر من أو يساوي 0، وأكبر من أو يساوي Number_chosen. يتم اقتطاع القيم غير الصحيحة."
			},
			numberChosen: {
				name: "number_chosen",
				detail: "مطلوب. يجب أن يكون أكبر من أو يساوي 0. يتم اقتطاع القيم غير الصحيحة."
			}
		}
	},
	COS: {
		description: "إرجاع جيب تمام الزاوية المحددة.",
		abstract: "إرجاع جيب تمام الزاوية المحددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cos-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي الزاوية بالتقدير الدائري التي تريد معرفة جيب التمام الخاص بها."
		} }
	},
	COSH: {
		description: "إرجاع جيب تمام القطع الزائد لأحد الأرقام.",
		abstract: "إرجاع جيب تمام القطع الزائد لأحد الأرقام.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cosh-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي أي رقم حقيقي تريد العثور على جيب تمام القطع الزائد الخاص به."
		} }
	},
	COT: {
		description: "إرجاع ظل التمام لزاوية محددة بالتقدير الدائري.",
		abstract: "إرجاع ظل التمام لزاوية محددة بالتقدير الدائري.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/cot-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الزاوية بالتقدير الدائري التي تريد التمام لها."
		} }
	},
	COTH: {
		description: "إرجاع التمام الزائدي لزاوية تشعبية.",
		abstract: "إرجاع التمام الزائدي لزاوية تشعبية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/coth-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة."
		} }
	},
	CSC: {
		description: "إرجاع قاطع تمام الزاوية المحددة بالتقدير الدائري.",
		abstract: "إرجاع قاطع تمام الزاوية المحددة بالتقدير الدائري.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/csc-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة."
		} }
	},
	CSCH: {
		description: "إرجاع قاطع التمام الزائدي للزاوية المحددة بالتقدير الدائري.",
		abstract: "إرجاع قاطع التمام الزائدي للزاوية المحددة بالتقدير الدائري.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/csch-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة."
		} }
	},
	DECIMAL: {
		description: "تحول التمثيل النصي لرقم في أساس معين إلى رقم عشري.",
		abstract: "تحول التمثيل النصي لرقم في أساس معين إلى رقم عشري.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/decimal-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "مطلوبة."
			},
			radix: {
				name: "radix",
				detail: "مطلوب. يجب أن تكون قيمة الوسيطة Radix عدد صحيح."
			}
		}
	},
	DEGREES: {
		description: "تحويل التقدير الدائري إلى درجات.",
		abstract: "تحويل التقدير الدائري إلى درجات.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/degrees-function"
		}],
		functionParameter: { angle: {
			name: "angle",
			detail: "مطلوب. الزاوية بالتقدير الدائري التي تريد تحويلها."
		} }
	},
	EVEN: {
		description: "تُرجع رقماً تم تقريبه للأعلى إلى أقرب رقم صحيح زوجي. يمكنك استخدام هذه الدالة لمعالجة السلع الزوجية. على سبيل المثال، يتّسع صندوق سلع لصفوف من سلعة واحدة أو سلعتين. ويمتلئ الصندوق عندما يتوافق عدد السلع، بعد تقريبه للأعلى إلى أقرب عدد زوجي، مع سعة الصندوق.",
		abstract: "تُرجع رقماً تم تقريبه للأعلى إلى أقرب رقم صحيح زوجي. يمكنك استخدام هذه الدالة لمعالجة السلع الزوجية. على سبيل المثال، يتّسع صندوق سلع لصفوف من سلعة واحدة أو سلعتين. ويمتلئ الصندوق عندما يتوافق عدد السلع، بعد تقريبه للأعلى إلى أقرب عدد زوجي، مع سعة الصندوق.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/even-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. القيمة التي يجب تقريبها."
		} }
	},
	EXP: {
		description: "تُرجع هذه الدالة e مرفوعة إلى أس. يساوي الثابت e القيمة 2,71828182845904، أساس اللوغاريتم الطبيعي.",
		abstract: "تُرجع هذه الدالة e مرفوعة إلى أس. يساوي الثابت e القيمة 2,71828182845904، أساس اللوغاريتم الطبيعي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/exp-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الأس المُطبّق على الأساس e."
		} }
	},
	FACT: {
		description: "تُرجع عامل الضرب لرقم. يساوي عامل الضرب لرقمٍ ما 1*2*3*...* الرقم.",
		abstract: "تُرجع عامل الضرب لرقم. يساوي عامل الضرب لرقمٍ ما 1*2*3*...* الرقم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/fact-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم غير السالب الذي تريد الحصول على عامل الضرب الخاص به. إذا لم يكن الرقم عبارة عن عدد صحيح، فسيتم اقتطاعه."
		} }
	},
	FACTDOUBLE: {
		description: "تُرجع العامل المزدوج لرقم.",
		abstract: "تُرجع العامل المزدوج لرقم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/factdouble-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. القيمة التي تريد إرجاع العامل المزدوج لها. إذا لم يكن الرقم عبارة عن عدد صحيح، فيتم اقتطاعه."
		} }
	},
	FLOOR: {
		description: "تقوم الدالة FLOOR في Excel بتقريب رقم محدد لأسفل إلى أقرب مضاعف محدد للأهمية. يتم تقريب الأرقام السالبة لأسفل (سالبة أخرى) إلى أقرب مضاعف كامل أقل من الصفر.",
		abstract: "تقوم الدالة FLOOR في Excel بتقريب رقم محدد لأسفل إلى أقرب مضاعف محدد للأهمية. يتم تقريب الأرقام السالبة لأسفل (سالبة أخرى) إلى أقرب مضاعف كامل أقل من الصفر.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/floor-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. تمثل القيمة الرقمية التي تريد تقريبها."
			},
			significance: {
				name: "significance",
				detail: "مطلوب. وهي المضاعف الذي تريد التقريب إليه."
			}
		}
	},
	FLOOR_MATH: {
		description: "تقرّب هذه الدالة رقماً إلى الأدنى وصولاً إلى أقرب عدد صحيح أو إلى أقرب مضاعف ذي أهمية.",
		abstract: "تقرّب هذه الدالة رقماً إلى الأدنى وصولاً إلى أقرب عدد صحيح أو إلى أقرب مضاعف ذي أهمية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/floor-math-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم المطلوب تقريبه لأسفل."
			},
			significance: {
				name: "significance",
				detail: "الاختياري. وهي المضاعف الذي تريد التقريب إليه."
			},
			mode: {
				name: "mode",
				detail: "الاختياري. الاتجاه (نحو أو بعيدا عن 0) لتقريب الأرقام السالبة."
			}
		}
	},
	FLOOR_PRECISE: {
		description: "تُرجع رقماً تم تقريبه إلى الأدنى إلى أقرب عدد صحيح أو إلى أقرب مضاعف لقيمة الوسيطة significance. ويتم تقريب الرقم إلى الأدنى بغض النظر عن علامته. ولكن إذا كانت الوسيطة number أو significance عبارة عن صفر، فسيتم إرجاع الصفر.",
		abstract: "تُرجع رقماً تم تقريبه إلى الأدنى إلى أقرب عدد صحيح أو إلى أقرب مضاعف لقيمة الوسيطة significance. ويتم تقريب الرقم إلى الأدنى بغض النظر عن علامته. ولكن إذا كانت الوسيطة number أو significance عبارة عن صفر، فسيتم إرجاع الصفر.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/floor-precise-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. وهي القيمة المراد تقريبها."
			},
			significance: {
				name: "significance",
				detail: "الاختياري. وهي المضاعف المراد تقريب الرقم إليه. إذا تم حذف الوسيطة significance، فتكون قيمتها الافتراضية 1."
			}
		}
	},
	GCD: {
		description: "تُرجع عامل القسمة المشترك الأكبر لعددين صحيحين أو أكثر. إن عامل القسمة المشترك الأكبر هو العدد الصحيح الأكبر الذي يقسم number1 وnumber2 بدون قيمة باقية.",
		abstract: "تُرجع عامل القسمة المشترك الأكبر لعددين صحيحين أو أكثر. إن عامل القسمة المشترك الأكبر هو العدد الصحيح الأكبر الذي يقسم number1 وnumber2 بدون قيمة باقية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gcd-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. تتوفر القيم من 1 إلى 255. إذا لم تكن إحدى القيم عبارة عن عدد صحيح، فيتم اقتطاعها."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. تتوفر القيم من 1 إلى 255. إذا لم تكن إحدى القيم عبارة عن عدد صحيح، فيتم اقتطاعها."
			}
		}
	},
	INT: {
		description: "تقريب رقم إلى أقرب عدد صحيح أصغر منه.",
		abstract: "تقريب رقم إلى أقرب عدد صحيح أصغر منه.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/int-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. العدد الحقيقي الذي تريد تقريبه إلى عدد صحيح أصغر منه."
		} }
	},
	ISO_CEILING: {
		description: "إرجاع رقم تم تقريبه إلى الأعلى إلى أقرب رقم صحيح أو إلى أقرب مضاعف من مضاعفات significance. ويتم تقريب الرقم إلى الأعلى بغض النظر عن علامته. ولكن إذا كانت قيمة الوسيطة Number أو significance عبارة عن صفر، فيتم إرجاع الصفر.",
		abstract: "إرجاع رقم تم تقريبه إلى الأعلى إلى أقرب رقم صحيح أو إلى أقرب مضاعف من مضاعفات significance. ويتم تقريب الرقم إلى الأعلى بغض النظر عن علامته. ولكن إذا كانت قيمة الوسيطة Number أو significance عبارة عن صفر، فيتم إرجاع الصفر.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/iso-ceiling-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. وهي القيمة المراد تقريبها."
			},
			significance: {
				name: "significance",
				detail: "الاختياري. وهي المضاعف المراد تقريب الرقم إليه. إذا تم حذف الوسيطة significance، فتكون قيمتها الافتراضية 1."
			}
		}
	},
	LCM: {
		description: "تُرجع هذه الدالة أقل مضاعف مشترك بين الأعداد الصحيحة. إن أقل مضاعف مشترك هو أصغر الأعداد الصحيحة الموجبة وهو مضاعف كل وسيطات الأعداد الصحيحة مثل number1،‏ number2، وهكذا. استخدم الدالة LCM لإضافة كسور ذات مقامات مختلفة.",
		abstract: "تُرجع هذه الدالة أقل مضاعف مشترك بين الأعداد الصحيحة. إن أقل مضاعف مشترك هو أصغر الأعداد الصحيحة الموجبة وهو مضاعف كل وسيطات الأعداد الصحيحة مثل number1،‏ number2، وهكذا. استخدم الدالة LCM لإضافة كسور ذات مقامات مختلفة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/lcm-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. القيم من 1 إلى 255 التي تريد حساب أقل مضاعف مشترك لها. إذا لم تكن القيمة عبارة عن عدد صحيح، فسيتم اقتطاعها."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. القيم من 1 إلى 255 التي تريد حساب أقل مضاعف مشترك لها. إذا لم تكن القيمة عبارة عن عدد صحيح، فسيتم اقتطاعها."
			}
		}
	},
	LN: {
		description: "تُرجع هذه الدالة اللوغاريتم الطبيعي لرقم. تستند اللوغاريتمات الطبيعية إلى الثابت e ‏(2,71828182845904)‎.",
		abstract: "تُرجع هذه الدالة اللوغاريتم الطبيعي لرقم. تستند اللوغاريتمات الطبيعية إلى الثابت e ‏(2,71828182845904)‎.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/ln-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. رقم حقيقي موجب تريد إيجاد اللوغاريتم الطبيعي له."
		} }
	},
	LOG: {
		description: "تُرجع هذه الدالة لوغاريتم رقم إلى الأساس الذي تحدده.",
		abstract: "تُرجع هذه الدالة لوغاريتم رقم إلى الأساس الذي تحدده.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/log-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. هو الرقم الحقيقي الموجب الذي تريد معرفة اللوغاريتم له."
			},
			base: {
				name: "base",
				detail: "الاختياري. أساس اللوغاريتم. إذا تم حذف الوسيطة base، فسيتم افتراض أنها 10."
			}
		}
	},
	LOG10: {
		description: "تُرجع هذه الدالة اللوغاريتم العشري لرقم.",
		abstract: "تُرجع هذه الدالة اللوغاريتم العشري لرقم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/log10-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم الحقيقي الموجب الذي تريد حساب اللوغاريتم العشري له."
		} }
	},
	MDETERM: {
		description: "تُرجع هذه الدالة محدد المصفوفة لصفيف.",
		abstract: "تُرجع هذه الدالة محدد المصفوفة لصفيف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mdeterm-function"
		}],
		functionParameter: { array: {
			name: "array",
			detail: "مطلوب. صفيف رقمي يحتوي على عدد متساوٍ من الصفوف والأعمدة."
		} }
	},
	MINVERSE: {
		description: "ترجع الدالة MINVERSE المصفوفة العكسية لمصفوفة مخزنة في صفيف.",
		abstract: "ترجع الدالة MINVERSE المصفوفة العكسية لمصفوفة مخزنة في صفيف.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/minverse-function"
		}],
		functionParameter: { array: {
			name: "array",
			detail: "مطلوب. صفيف رقمي يحتوي على عدد متساوٍ من الصفوف والأعمدة."
		} }
	},
	MMULT: {
		description: "ترجع الدالة MMULT منتج مصفوفة صفيفين. تكون النتيجة عبارة عن صفيف يتألف من عدد الصفوف نفسه في array1 وعدد الأعمدة نفسه في array 2.",
		abstract: "ترجع الدالة MMULT منتج مصفوفة صفيفين. تكون النتيجة عبارة عن صفيف يتألف من عدد الصفوف نفسه في array1 وعدد الأعمدة نفسه في array 2.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mmult-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "المصفوفتان المراد ضربهما."
			},
			array2: {
				name: "array2",
				detail: "المصفوفتان المراد ضربهما."
			}
		}
	},
	MOD: {
		description: "إرجاع الباقي بعد قسمة رقم على القاسم. ويحتوي الناتج على علامة القاسم نفسها.",
		abstract: "إرجاع الباقي بعد قسمة رقم على القاسم. ويحتوي الناتج على علامة القاسم نفسها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mod-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الذي تريد إيجاد الباقي له."
			},
			divisor: {
				name: "divisor",
				detail: "مطلوب. الرقم الذي تريد قسمة رقم ما عليه."
			}
		}
	},
	MROUND: {
		description: "يعمل MROUND على إرجاع رقم مقرب إلى المضاعف المطلوب.",
		abstract: "يعمل MROUND على إرجاع رقم مقرب إلى المضاعف المطلوب.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mround-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. القيمة التي يجب تقريبها."
			},
			multiple: {
				name: "multiple",
				detail: "مطلوب. المضاعف الذي تريد تقريب الرقم إليه."
			}
		}
	},
	MULTINOMIAL: {
		description: "تُرجع هذه الدالة نسبة مضروب مجموع من القيم إلى حاصل ضرب مضروباتها.",
		abstract: "تُرجع هذه الدالة نسبة مضروب مجموع من القيم إلى حاصل ضرب مضروباتها.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/multinomial-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. القيم من 1 إلى 255 التي تريد الحصول على التسمية المتعددة لها."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. القيم من 1 إلى 255 التي تريد الحصول على التسمية المتعددة لها."
			}
		}
	},
	MUNIT: {
		description: "ترجع الدالة MUNIT مصفوفة الوحدة للبعد المحدد.",
		abstract: "ترجع الدالة MUNIT مصفوفة الوحدة للبعد المحدد.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/munit-function"
		}],
		functionParameter: { dimension: {
			name: "dimension",
			detail: "عدد صحيح يحدد بُعد مصفوفة الوحدة التي تريد إرجاعها. ترجع الدالة مصفوفة، ويجب أن يكون البُعد أكبر من صفر."
		} }
	},
	ODD: {
		description: "تُرجع هذه الدالة رقماً تم تقريبه إلى الأعلى وصولاً إلى أقرب عدد صحيح فردي.",
		abstract: "تُرجع هذه الدالة رقماً تم تقريبه إلى الأعلى وصولاً إلى أقرب عدد صحيح فردي.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/odd-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوب. القيمة التي يجب تقريبها."
		} }
	},
	PI: {
		description: "تُرجع هذه الدالة الرقم 3,14159265358979، وهو الثابت الرياضي pi، بدقة تصل إلى 15رقماً.",
		abstract: "تُرجع هذه الدالة الرقم 3,14159265358979، وهو الثابت الرياضي pi، بدقة تصل إلى 15رقماً.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/pi-function"
		}],
		functionParameter: {}
	},
	POWER: {
		description: "تُرجع هذه الدالة نتيجة رقم مرفوع إلى أس.",
		abstract: "تُرجع هذه الدالة نتيجة رقم مرفوع إلى أس.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/power-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الأساسي. ويمكن أن يكون أي رقم حقيقي."
			},
			power: {
				name: "power",
				detail: "مطلوب. الأس الذي يُرفع الرقم الأساسي إليه."
			}
		}
	},
	PRODUCT: {
		description: "تضرب الدالة PRODUCT كافة الأرقام المحددة كوسيطات وتُرجع الناتج. على سبيل المثال، إذا احتوت الخلايا A1 وA2 على أرقام، فيمكنك استخدام الصيغة =PRODUCT(A1، A2) لضرب هذين الرقمين معا. ويمكنك أيضاً إجراء العملية نفسها باستخدام العامل الرياضي الخاص بالضرب ( * )، مثلاً ‎=A1 * A2‎ .",
		abstract: "تضرب الدالة PRODUCT كافة الأرقام المحددة كوسيطات وتُرجع الناتج. على سبيل المثال، إذا احتوت الخلايا A1 وA2 على أرقام، فيمكنك استخدام الصيغة =PRODUCT(A1، A2) لضرب هذين الرقمين معا. ويمكنك أيضاً إجراء العملية نفسها باستخدام العامل الرياضي الخاص بالضرب ( * )، مثلاً ‎=A1 * A2‎ .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/product-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. الرقم أو النطاق الأول الذي تريد ضربه."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. الأرقام أو النطاقات الإضافية التي تريد ضربها، ويمكن استخدام لغاية 255 وسيطة كحد أقصى."
			}
		}
	},
	QUOTIENT: {
		description: "تُرجع هذه الدالة جزء العدد الصحيح لقسمة. استخدم هذه الدالة عندما تريد إهمال باقي القسمة.",
		abstract: "تُرجع هذه الدالة جزء العدد الصحيح لقسمة. استخدم هذه الدالة عندما تريد إهمال باقي القسمة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/quotient-function"
		}],
		functionParameter: {
			numerator: {
				name: "numerator",
				detail: "مطلوب. المقسوم."
			},
			denominator: {
				name: "denominator",
				detail: "مطلوب. القاسم."
			}
		}
	},
	RADIANS: {
		description: "تحوّل هذه الدالة الدرجات إلى التقدير الدائري.",
		abstract: "تحوّل هذه الدالة الدرجات إلى التقدير الدائري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/radians-function"
		}],
		functionParameter: { angle: {
			name: "angle",
			detail: "مطلوب. الزاوية بالدرجات التي تريد تحويلها."
		} }
	},
	RAND: {
		description: "RAND إرجاع عدد حقيقي عشوائي موزع بشكل متساوٍ أكبر من أو يساوي 0 وأصغر من 1. يتم إرجاع عدد حقيقي عشوائي جديد كل مرة يتم فيها حساب ورقة العمل .",
		abstract: "RAND إرجاع عدد حقيقي عشوائي موزع بشكل متساوٍ أكبر من أو يساوي 0 وأصغر من 1. يتم إرجاع عدد حقيقي عشوائي جديد كل مرة يتم فيها حساب ورقة العمل .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rand-function"
		}],
		functionParameter: {}
	},
	RANDARRAY: {
		description: "في المثال الآتي، أنشأنا صفيفًا بطول 5 صفوف وعرض 3 أعمدة. يُرجع الأول مجموعة عشوائية من القيم بين 0 و1، وذلك هو السلوك الافتراضي للدالة RANDARRAY. ويُرجع الثاني سلسلة من القيم العشرية العشوائية بين 1 و100. وأخيراً، يُرجع المثال الثالث سلسلة من الأعداد الصحيحة بين 1 و100.",
		abstract: "في المثال الآتي، أنشأنا صفيفًا بطول 5 صفوف وعرض 3 أعمدة. يُرجع الأول مجموعة عشوائية من القيم بين 0 و1، وذلك هو السلوك الافتراضي للدالة RANDARRAY. ويُرجع الثاني سلسلة من القيم العشرية العشوائية بين 1 و100. وأخيراً، يُرجع المثال الثالث سلسلة من الأعداد الصحيحة بين 1 و100.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/randarray-function"
		}],
		functionParameter: {
			rows: {
				name: "rows",
				detail: "عدد الصفوف التي سيتم إرجاعها"
			},
			columns: {
				name: "columns",
				detail: "عدد الأعمدة المراد إرجاعها"
			},
			min: {
				name: "min",
				detail: "أدنى عدد تريد إرجاعه"
			},
			max: {
				name: "max",
				detail: "أقصى عدد تريد إرجاعه"
			},
			wholeNumber: {
				name: "whole_number",
				detail: "إرجاع عدد صحيح أو قيمة عشرية TRUE لعدد صحيح FALSE لرقم عشري"
			}
		}
	},
	RANDBETWEEN: {
		description: "تُرجع هذه الدالة عدداً صحيحاً عشوائياً بين الأرقام التي تحددها. يتم إرجاع عدد صحيح عشوائي جديد في كل مرة يتم فيها حساب ورقة العمل.",
		abstract: "تُرجع هذه الدالة عدداً صحيحاً عشوائياً بين الأرقام التي تحددها. يتم إرجاع عدد صحيح عشوائي جديد في كل مرة يتم فيها حساب ورقة العمل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/randbetween-function"
		}],
		functionParameter: {
			bottom: {
				name: "bottom",
				detail: "مطلوب. أصغر عدد صحيح تُرجعه الدالة RANDBETWEEN."
			},
			top: {
				name: "top",
				detail: "مطلوب. أكبر عدد صحيح تُرجعه الدالة RANDBETWEEN."
			}
		}
	},
	ROMAN: {
		description: "تحوّل هذه الدالة أرقاماً عربية إلى أرقام رومانية كنص.",
		abstract: "تحوّل هذه الدالة أرقاماً عربية إلى أرقام رومانية كنص.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/roman-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم العربي الذي تريد تحويله."
			},
			form: {
				name: "form",
				detail: "الاختياري. رقم يحدد نوع الرقم الروماني الذي تريده. يتراوح نمط الرقم الروماني من \"كلاسيكي\" إلى \"مبسّط\"، ويكون أكثر إيجازاً كلما ارتفعت قيمة الوسيطة form. انظر المثال التالي ROMAN(499,0) أدناه."
			}
		}
	},
	ROUND: {
		description: "تقرّب الدالة ROUND رقماً إلى عدد معين من الأرقام. على سبيل المثال، إذا كانت الخلية A1 تحتوي على الرقم 23.7825، وكنت تريد تقريب هذه القيمة إلى منزلتين عشريتين، فيمكنك استخدام الصيغة التالية:",
		abstract: "تقرّب الدالة ROUND رقماً إلى عدد معين من الأرقام. على سبيل المثال، إذا كانت الخلية A1 تحتوي على الرقم 23.7825، وكنت تريد تقريب هذه القيمة إلى منزلتين عشريتين، فيمكنك استخدام الصيغة التالية:",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/round-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوب. الرقم الذي تريد تقريبه."
			},
			numDigits: {
				name: "num_digits",
				detail: "مطلوب. عدد الأرقام التي تريد تقريب الوسيطة number إليها."
			}
		}
	},
	ROUNDBANK: {
		description: "تقرّب رقماً باستخدام أسلوب التقريب المصرفي.",
		abstract: "تقرّب رقماً باستخدام أسلوب التقريب المصرفي.",
		links: [{
			title: "Instruction",
			url: ""
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "الرقم الذي تريد تقريبه باستخدام التقريب المصرفي."
			},
			numDigits: {
				name: "num_digits",
				detail: "عدد المنازل التي تريد التقريب إليها باستخدام التقريب المصرفي."
			}
		}
	},
	ROUNDDOWN: {
		description: "تقرّب هذه الدالة رقماً إلى الأدنى، باتجاه الصفر.",
		abstract: "تقرّب هذه الدالة رقماً إلى الأدنى، باتجاه الصفر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rounddown-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. أي رقم حقيقي تريد تقريبه إلى الأدنى."
			},
			numDigits: {
				name: "num_digits",
				detail: "مطلوب. عدد الأرقام التي تريد تقريب الرقم إليها."
			}
		}
	},
	ROUNDUP: {
		description: "تقرّب هذه الدالة رقماً إلى الأعلى، بعيداً عن 0 (صفر).",
		abstract: "تقرّب هذه الدالة رقماً إلى الأعلى، بعيداً عن 0 (صفر).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/roundup-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. أي رقم حقيقي تريد تقريبه إلى الأعلى."
			},
			numDigits: {
				name: "num_digits",
				detail: "مطلوب. عدد الأرقام التي تريد تقريب الرقم إليها."
			}
		}
	},
	SEC: {
		description: "تُرجع هذه الدالة قاطع المنحنى لزاوية.",
		abstract: "تُرجع هذه الدالة قاطع المنحنى لزاوية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sec-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "الزاوية بالراديان التي تريد حساب قاطعها."
		} }
	},
	SECH: {
		description: "تُرجع هذه الدالة قاطع المنحنى الزائدي لزاوية.",
		abstract: "تُرجع هذه الدالة قاطع المنحنى الزائدي لزاوية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sech-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "الزاوية بالراديان التي تريد حساب قاطعها الزائدي."
		} }
	},
	SERIESSUM: {
		description: "يمكن مقاربة عدد من الدالات بواسطة توسيع سلسلة أس.",
		abstract: "يمكن مقاربة عدد من الدالات بواسطة توسيع سلسلة أس.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/seriessum-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. قيمة إدخال سلسلة الأس."
			},
			n: {
				name: "n",
				detail: "مطلوبة. الأس الأولي الذي تريد رفع x إليه."
			},
			m: {
				name: "m",
				detail: "مطلوبة. الخطوة التي يتم اتخاذها لزيادة n لكل طرف في السلسلة."
			},
			coefficients: {
				name: "coefficients",
				detail: "مطلوب. مجموعة من المعاملات التي يتم ضرب كل أس لاحق لـ x بها. يحدد عدد القيم في الوسيطة coefficients عدد الأطراف في سلسلة الأس. على سبيل المثال، إذا كان هناك ثلاث قيم في الوسيطة coefficients، فسيكون هناك ثلاثة أطراف في سلسلة الأس."
			}
		}
	},
	SEQUENCE: {
		description: "أنشأنا في المثال التالي صفيفاً بطول 4 صفوف مضروباً في 5 أعمدة واسع مع =SEQUENCE(4,5) .",
		abstract: "أنشأنا في المثال التالي صفيفاً بطول 4 صفوف مضروباً في 5 أعمدة واسع مع =SEQUENCE(4,5) .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sequence-function"
		}],
		functionParameter: {
			rows: {
				name: "rows",
				detail: "عدد الصفوف التي سيتم إرجاعها"
			},
			columns: {
				name: "columns",
				detail: "عدد الأعمدة التي سيتم إرجاعها"
			},
			start: {
				name: "start",
				detail: "الرقم الأول في التسلسل"
			},
			step: {
				name: "step",
				detail: "مقدار الزيادة لكل قيمة لاحقة في الصفيف"
			}
		}
	},
	SIGN: {
		description: "تحدد هذه الدالة علامة الرقم. تُرجع هذه الدالة 1 إذا كان الرقم موجباً، وصفراً (0) إذا كان الرقم 0، و 1- إذا كان الرقم سالباً.",
		abstract: "تحدد هذه الدالة علامة الرقم. تُرجع هذه الدالة 1 إذا كان الرقم موجباً، وصفراً (0) إذا كان الرقم 0، و 1- إذا كان الرقم سالباً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sign-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. أي رقم حقيقي."
		} }
	},
	SIN: {
		description: "تُرجع هذه الدالة جيب الزاوية المحددة.",
		abstract: "تُرجع هذه الدالة جيب الزاوية المحددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sin-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الزاوية المحسوبة بالتقدير الدائري التي تريد جيب الزاوية الخاص بها."
		} }
	},
	SINH: {
		description: "تُرجع هذه الدالة جيب الزاوية للقطع الزائد لأحد الأرقام.",
		abstract: "تُرجع هذه الدالة جيب الزاوية للقطع الزائد لأحد الأرقام.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sinh-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. أي رقم حقيقي."
		} }
	},
	SQRT: {
		description: "إرجاع جذر تربيعي موجب.",
		abstract: "إرجاع جذر تربيعي موجب.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sqrt-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم الذي تريد حساب جذره التربيعي."
		} }
	},
	SQRTPI: {
		description: "إرجاع الجذر التربيعي لـ (number * pi).",
		abstract: "إرجاع الجذر التربيعي لـ (number * pi).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sqrtpi-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم الذي يتم ضرب pi به."
		} }
	},
	SUBTOTAL: {
		description: "تُرجع هذه الدالة إجمالي فرعي في قائمة أو قاعدة بيانات. بوجه عام، من السهل إنشاء قائمة تتضمّن إجماليات فرعية باستخدام الأمر إجمالي فرعي في المجموعة مخطط تفصيلي ضمن علامة التبويب بيانات . بعد إنشاء قائمة الإجماليات الفرعية، يمكنك تعديلها بتحرير الدالة SUBTOTAL.",
		abstract: "تُرجع هذه الدالة إجمالي فرعي في قائمة أو قاعدة بيانات. بوجه عام، من السهل إنشاء قائمة تتضمّن إجماليات فرعية باستخدام الأمر إجمالي فرعي في المجموعة مخطط تفصيلي ضمن علامة التبويب بيانات . بعد إنشاء قائمة الإجماليات الفرعية، يمكنك تعديلها بتحرير الدالة SUBTOTAL.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/subtotal-function"
		}],
		functionParameter: {
			functionNum: {
				name: "function_num",
				detail: "مطلوب. وهي أحد الأرقام من 1 إلى 11 أو من 101 إلى 111 الذي يحدد الدالة المطلوب استخدامها للحصول على الإجمالي الفرعي. يقوم الرقم من 1 إلى 11 بتضمين الصفوف المخفية يدوياً، بينما يقوم الرقم من 101 إلى 111 باستبعادها؛ يتم دوماً استبعاد الخلايا المُصفاة."
			},
			ref1: {
				name: "ref1",
				detail: "مطلوب. النطاق أو المرجع المسمى الأول الذي تريد حساب الإجمالي الفرعي له."
			},
			ref2: {
				name: "ref2",
				detail: "الاختياري. النطاقات أو المراجع المسماة من 2 إلى 254 التي تريد حساب الإجمالي الفرعي لها."
			}
		}
	},
	SUM: {
		description: "تضيف الدالة SUM قيما. يمكنك إضافة قيم فردية أو مراجع خلايا أو نطاقات أو خليط من الثلاثة.",
		abstract: "تضيف الدالة SUM قيما. يمكنك إضافة قيم فردية أو مراجع خلايا أو نطاقات أو خليط من الثلاثة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sum-function"
		}],
		functionParameter: {
			number1: {
				name: "Number 1",
				detail: "الرقم الأول الذي تريد جمعه. يمكن أن يكون الرقم مثل 4 أو مرجع خلية مثل B6 أو نطاق خلايا مثل B2:B8."
			},
			number2: {
				name: "Number 2",
				detail: "هذا هو الرقم الثاني الذي تريد جمعه. يمكنك تحديد ما يصل إلى 255 رقماً بهذه الطريقة."
			}
		}
	},
	SUMIF: {
		description: "يمكنك استخدام الدالة SUMIF لجمع القيم في نطاق يفي بالمعايير التي تحددها. على سبيل المثال، بفرض أن عمود يتضمن أرقاماً، وتريد جمع القيم الأكبر من 5 فقط. يمكنك استخدام الصيغة التالية: =SUMIF(B2:B25,\">5\")",
		abstract: "يمكنك استخدام الدالة SUMIF لجمع القيم في نطاق يفي بالمعايير التي تحددها. على سبيل المثال، بفرض أن عمود يتضمن أرقاماً، وتريد جمع القيم الأكبر من 5 فقط. يمكنك استخدام الصيغة التالية: =SUMIF(B2:B25,\">5\")",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sumif-function"
		}],
		functionParameter: {
			range: {
				name: "range",
				detail: "مطلوب. نطاق الخلايا التي تريد تقييمها حسب المعايير. يجب أن تكون الخلايا في كل نطاق أرقاما أو أسماء أو صفائف أو مراجع تحتوي على أرقام. ويتم تجاهل القيم الفارغة والنصية. قد يحتوي النطاق المحدد على تواريخ بتنسيق Excel القياسي (الأمثلة أدناه)."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. المعايير الموجودة على شكل رقم أو تعبير أو مرجع خلية أو نص أو دالة تحدد الخلايا التي سيتم جمعها. يمكن تضمين أحرف البدل - علامة استفهام (؟) لمطابقة أي حرف واحد، علامة نجمية (*) لمطابقة أي تسلسل من الأحرف. إذا كنت تريد العثور على علامة استفهام أو علامة نجمية فعلية، فاكتب tilde ( ~ ) يسبق الحرف. على سبيل المثال، يمكن التعبير عن المعايير على أنها 32 أو \">32\" أو B5 أو \"3؟\" أو \"apple*\" أو \"*~?\"\" أو TODAY(). هام يجب تضمين أي معيار نصي أو أي معايير تحتوي على رموز منطقية أو رياضية بين علامتي اقتباس مزدوجتين ( \" ). إذا كانت المعايير رقمية، فلا حاجة إلى وضع علامتي اقتباس مزدوجتين."
			},
			sumRange: {
				name: "sum_range",
				detail: "الاختياري. الخلايا الفعلية المراد إضافتها، إذا كنت تريد إضافة خلايا أخرى غير تلك المحددة في وسيطة النطاق . إذا تم حذف الوسيطة sum_range ، فسيضيف Excel الخلايا المحددة في وسيطة النطاق (الخلايا نفسها التي يتم تطبيق المعايير عليها). يجب أن يكون Sum_range بنفس حجم النطاق وشكله. إذا لم يكن كذلك، فقد يعاني الأداء، وستحصل الصيغة على نطاق من الخلايا يبدأ بالخلية الأولى في sum_range ولكن له نفس أبعاد النطاق . على سبيل المثال: نطاق Sum_range الخلايا الفعلية التي تم جمعها A1:A5 B1:B5 B1:B5 A1:A5 B1:K5 B1:B5"
			}
		}
	},
	SUMIFS: {
		description: "تعمل الدالة SUMIFS، وهي إحدى الدالات الرياضية والمثلثية ، على جمع كل وسيطاتها التي تفي بمعايير متعددة. على سبيل المثال، يمكنك استخدام SUMIFS لجمع عدد بائعي التجزئة في البلد الذين (1) يقيمون ضمن رمز بريدي واحد و(2) الذين تتجاوز أرباحهم قيمة الريال السعودي المحددة.",
		abstract: "تعمل الدالة SUMIFS، وهي إحدى الدالات الرياضية والمثلثية ، على جمع كل وسيطاتها التي تفي بمعايير متعددة. على سبيل المثال، يمكنك استخدام SUMIFS لجمع عدد بائعي التجزئة في البلد الذين (1) يقيمون ضمن رمز بريدي واحد و(2) الذين تتجاوز أرباحهم قيمة الريال السعودي المحددة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sumifs-function"
		}],
		functionParameter: {
			sumRange: {
				name: "sum_range",
				detail: "نطاق الخلايا المطلوب جمعها."
			},
			criteriaRange1: {
				name: "criteria_range1",
				detail: "النطاق الذي يتم اختباره باستخدام Criteria1 . Criteria_range1 و Criteria1 إعداد زوج بحث حيث يتم البحث عن نطاق لمعايير محددة. بمجرد العثور على العناصر في النطاق، تتم إضافة القيم المقابلة لها في Sum_range ."
			},
			criteria1: {
				name: "criteria1",
				detail: "المعايير التي تحدد الخلايا الموجودة في Criteria_range1 التي ستتم إضافتها. على سبيل المثال، يمكن إدخال المعايير على أنها 32 أو \">32\" أو B4 أو \"تفاح\" أو \"32\"."
			},
			criteriaRange2: {
				name: "criteriaRange2",
				detail: "النطاقات الإضافية والمعايير المقترنة بها. يمكنك إدخال ما يصل إلى 127 زوج من النطاقات/المعايير."
			},
			criteria2: {
				name: "criteria2",
				detail: "النطاقات الإضافية والمعايير المقترنة بها. يمكنك إدخال ما يصل إلى 127 زوج من النطاقات/المعايير."
			}
		}
	},
	SUMPRODUCT: {
		description: "ترجع الدالة SUMPRODUCT مجموع منتجات النطاقات أو الصفائف المقابلة. العملية الافتراضية هي الضرب، ولكن من الممكن أيضا الجمع والطرح والقسمة.",
		abstract: "ترجع الدالة SUMPRODUCT مجموع منتجات النطاقات أو الصفائف المقابلة. العملية الافتراضية هي الضرب، ولكن من الممكن أيضا الجمع والطرح والقسمة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sumproduct-function"
		}],
		functionParameter: {
			array1: {
				name: "array",
				detail: "وسيطة الصفيف الأول التي ترغب في ضرب مكوناتها ثم جمعها."
			},
			array2: {
				name: "array",
				detail: "وسيطات الصفيف من 2 إلى 255 التي ترغب في ضرب مكوناتها ثم جمعها."
			}
		}
	},
	SUMSQ: {
		description: "تُرجع هذه الدالة مجموع مربعات الوسيطات.",
		abstract: "تُرجع هذه الدالة مجموع مربعات الوسيطات.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sumsq-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب. الأرقام اللاحقة اختيارية. يمكن أن يكون هناك ما يصل إلى 255 وسيطة تريد جمع المربعات لها."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب. الأرقام اللاحقة اختيارية. يمكن أن يكون هناك ما يصل إلى 255 وسيطة تريد جمع المربعات لها."
			}
		}
	},
	SUMX2MY2: {
		description: "ترجع دالة Excel هذه مجموع الفرق بين مربعات القيم المقابلة في صفيفين.",
		abstract: "ترجع دالة Excel هذه مجموع الفرق بين مربعات القيم المقابلة في صفيفين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sumx2my2-function"
		}],
		functionParameter: {
			arrayX: {
				name: "array_x",
				detail: "مطلوب. الصفيف أو نطاق القيم الأول."
			},
			arrayY: {
				name: "array_y",
				detail: "مطلوب. الصفيف أو نطاق القيم الثاني."
			}
		}
	},
	SUMX2PY2: {
		description: "تُرجع هذه الدالة المجموع الخاص بمجموع مربعات قيم مناظرة في صفيفين. ويُعد المجموع الخاص بمجموع المربعات تعبيراً شائعاً في العديد من الحسابات الإحصائية.",
		abstract: "تُرجع هذه الدالة المجموع الخاص بمجموع مربعات قيم مناظرة في صفيفين. ويُعد المجموع الخاص بمجموع المربعات تعبيراً شائعاً في العديد من الحسابات الإحصائية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sumx2py2-function"
		}],
		functionParameter: {
			arrayX: {
				name: "array_x",
				detail: "مطلوب. الصفيف أو نطاق القيم الأول."
			},
			arrayY: {
				name: "array_y",
				detail: "مطلوب. الصفيف أو نطاق القيم الثاني."
			}
		}
	},
	SUMXMY2: {
		description: "ترجع الدالة SUMXMY2 مجموع مربعات الاختلافات للقيم المقابلة في صفيفين.",
		abstract: "ترجع الدالة SUMXMY2 مجموع مربعات الاختلافات للقيم المقابلة في صفيفين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/sumxmy2-function"
		}],
		functionParameter: {
			arrayX: {
				name: "array_x",
				detail: "الصفيف الأول أو نطاق القيم. مطلوبة."
			},
			arrayY: {
				name: "array_y",
				detail: "الصفيف الثاني أو نطاق القيم. مطلوبة."
			}
		}
	},
	TAN: {
		description: "تُرجع هذه الدالة ظل الزاوية المعيّنة.",
		abstract: "تُرجع هذه الدالة ظل الزاوية المعيّنة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tan-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الزاوية بالتقدير الدائري التي تريد ظلها."
		} }
	},
	TANH: {
		description: "إرجاع ظل الزاوية الزائدي لأحد الأرقام.",
		abstract: "إرجاع ظل الزاوية الزائدي لأحد الأرقام.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/tanh-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. أي رقم حقيقي."
		} }
	},
	TRUNC: {
		description: "تقوم دالات TRUNC باقتطاع رقم إلى عدد صحيح عن طريق إزالة الجزء الكسري من الرقم.",
		abstract: "تقوم دالات TRUNC باقتطاع رقم إلى عدد صحيح عن طريق إزالة الجزء الكسري من الرقم.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/trunc-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الذي ترغب في اقتطاعه."
			},
			numDigits: {
				name: "num_digits",
				detail: "الاختياري. رقم يحدد دقة الاقتطاع. القيمة الافتراضية لـ num_digits هي 0 (صفر)."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/statistical/ar-SA.ts
const locale$4 = {
	AVEDEV: {
		description: "تُرجع متوسط الانحرافات المطلقة لنقاط البيانات من الوسط الخاص بها. تُعد الدالة AVEDEV مقياساً لقابلية التغير في مجموعة بيانات.",
		abstract: "تُرجع متوسط الانحرافات المطلقة لنقاط البيانات من الوسط الخاص بها. تُعد الدالة AVEDEV مقياساً لقابلية التغير في مجموعة بيانات.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/avedev-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي تريد الحصول على متوسط الانحرافات المطلقة لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي تريد الحصول على متوسط الانحرافات المطلقة لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	AVERAGE: {
		description: "تُرجع متوسط الوسيطات (الوسط الحسابي). على سبيل المثال، إذا كان النطاق A1:A20 يحتوي على أرقام، فإن الصيغة =AVERAGE(A1:A20) ترجع متوسط هذه الأرقام.",
		abstract: "تُرجع متوسط الوسيطات (الوسط الحسابي). على سبيل المثال، إذا كان النطاق A1:A20 يحتوي على أرقام، فإن الصيغة =AVERAGE(A1:A20) ترجع متوسط هذه الأرقام.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/average-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. الرقم الأول أو مرجع الخلية أو النطاق الذي تريد المتوسط له."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وهي الأرقام أو مراجع الخلايا أو النطاقات الإضافية التي تريد الحصول على المتوسط الخاص بها، وتصل إلى 255 كحد أقصى."
			}
		}
	},
	AVERAGE_WEIGHTED: {
		description: "تحسب الدالة AVERAGE.WEIGHTED المتوسط المرجح لمجموعة من القيم باستخدام القيم والأوزان المقابلة لها.",
		abstract: "تحسب الدالة AVERAGE.WEIGHTED المتوسط المرجح لمجموعة من القيم باستخدام القيم والأوزان المقابلة لها.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/9084098?hl=ar"
		}],
		functionParameter: {
			values: {
				name: "القيم",
				detail: "القيم المطلوب حساب متوسطها. يمكن أن تكون نطاق خلايا أو القيم نفسها."
			},
			weights: {
				name: "الأوزان",
				detail: "قائمة الأوزان المقابلة المطلوب تطبيقها. يمكن أن تكون الأوزان صفراً ولكن لا يجوز أن تكون سالبة، ويجب أن يكون وزن واحد على الأقل موجباً. يجب أن يطابق نطاق الأوزان نطاق القيم في عدد الصفوف والأعمدة."
			},
			additionalValues: {
				name: "القيم_الإضافية",
				detail: "قيم إضافية اختيارية مطلوب حساب متوسطها."
			},
			additionalWeights: {
				name: "الأوزان_الإضافية",
				detail: "أوزان إضافية اختيارية. يجب أن تتبع كل قيمة_إضافية قيمة وزن_إضافي واحدة بالضبط."
			}
		}
	},
	AVERAGEA: {
		description: "ترجع متوسط وسيطاتها، بما في ذلك الأرقام والنصوص والقيم المنطقية.",
		abstract: "ترجع متوسط وسيطاتها، بما في ذلك الأرقام والنصوص والقيم المنطقية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/averagea-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "الرقم الأول أو مرجع الخلية أو النطاق الذي تريد حساب متوسطه."
			},
			value2: {
				name: "value2",
				detail: "أرقام أو مراجع خلايا أو نطاقات إضافية تريد حساب متوسطها، بحد أقصى 255."
			}
		}
	},
	AVERAGEIF: {
		description: "ترجع هذه الدالة المتوسط (الوسط الحسابي) لكافة الخلايا الموجودة في نطاق يفي بمعايير معينة.",
		abstract: "ترجع هذه الدالة المتوسط (الوسط الحسابي) لكافة الخلايا الموجودة في نطاق يفي بمعايير معينة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/averageif-function"
		}],
		functionParameter: {
			range: {
				name: "range",
				detail: "مطلوب. هي واحدة أو أكثر من الخلايا المراد حساب المتوسط لها، بما في ذلك الأرقام أو الأسماء أو الصفائف أو المراجع التي تحتوي على أرقام."
			},
			criteria: {
				name: "criteria",
				detail: "مطلوب. هي المعايير الموجودة على شكل رقم أو تعبير أو مرجع خلية أو نص لتعريف الخلايا التي سيتم حساب المتوسط لها. على سبيل المثال، يمكن التعبير عن المعايير على أنها 32 أو \"32\" أو \">32\" أو \"تفاح\" أو B4."
			},
			averageRange: {
				name: "average_range",
				detail: "الاختياري. هي مجموعة الخلايا الفعلية المراد حساب المتوسط لها. وإذا تم حذفها، فيتم استخدام الوسيطة range."
			}
		}
	},
	AVERAGEIFS: {
		description: "تُرجع هذه الالة المتوسط (الوسط الحسابي) لكافة الخلايا التي تطابق معايير متعددة.",
		abstract: "تُرجع هذه الالة المتوسط (الوسط الحسابي) لكافة الخلايا التي تطابق معايير متعددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/averageifs-function"
		}],
		functionParameter: {
			averageRange: {
				name: "average_range",
				detail: "مطلوب. هي واحدة أو أكثر من الخلايا المراد حساب المتوسط لها، بما في ذلك الأرقام أو الأسماء أو الصفائف أو المراجع التي تحتوي على أرقام."
			},
			criteriaRange1: {
				name: "criteria_range1",
				detail: "إن الوسيطة Criteria_range1 مطلوبة، أما وسائط criteria_range التالية فهي اختيارية. النطاقات من 1 إلى 127 التي يتم فيها تقييم المعايير المقترنة بها."
			},
			criteria1: {
				name: "criteria1",
				detail: "Criteria1 مطلوب، المعايير اللاحقة اختيارية. المعايير من 1 إلى 127 على شكل رقم أو تعبير أو مرجع خلية أو نص لتعريف الخلايا التي سيتم حساب المتوسط لها. على سبيل المثال، يمكن التعبير عن المعايير على أنها 32 أو \"32\" أو \">32\" أو \"تفاح\" أو B4."
			},
			criteriaRange2: {
				name: "criteria_range2",
				detail: "إن الوسيطة Criteria_range1 مطلوبة، أما وسائط criteria_range التالية فهي اختيارية. النطاقات من 1 إلى 127 التي يتم فيها تقييم المعايير المقترنة بها."
			},
			criteria2: {
				name: "criteria2",
				detail: "Criteria1 مطلوب، المعايير اللاحقة اختيارية. المعايير من 1 إلى 127 على شكل رقم أو تعبير أو مرجع خلية أو نص لتعريف الخلايا التي سيتم حساب المتوسط لها. على سبيل المثال، يمكن التعبير عن المعايير على أنها 32 أو \"32\" أو \">32\" أو \"تفاح\" أو B4."
			}
		}
	},
	BETA_DIST: {
		description: "يتم بشكلٍ عام استخدام توزيع بيتا لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل فترات اليوم التي يقضيها الأشخاص في مشاهدة التلفزيون.",
		abstract: "يتم بشكلٍ عام استخدام توزيع بيتا لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل فترات اليوم التي يقضيها الأشخاص في مشاهدة التلفزيون.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/beta-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة بين A وB التي يتم تقييم الدالة عندها."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. وهي القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة cumulative تساوي TRUE، فإن BETA.DIST تُرجع دالة التوزيع التراكمي، وإذا كانت تساوي FALSE، فإنها تُرجع دالة كثافة الاحتمال."
			},
			A: {
				name: "A",
				detail: "وهي حد أدنى للفاصل الزمني x."
			},
			B: {
				name: "B",
				detail: "اختياري. وهي حد أعلى للفاصل الزمني x."
			}
		}
	},
	BETA_INV: {
		description: "إذا كانت probability = BETA.DIST(x,...TRUE)‎، فعندئذٍ تكون BETA.INV(probability,...) = x. يمكن استخدام توزيع بيتا في تخطيط المشاريع لتخطيط مواعيد الانتهاء المحتملة عند تعيين الوقت المتوقع للإنهاء وقابلية التغيير.",
		abstract: "إذا كانت probability = BETA.DIST(x,...TRUE)‎، فعندئذٍ تكون BETA.INV(probability,...) = x. يمكن استخدام توزيع بيتا في تخطيط المشاريع لتخطيط مواعيد الانتهاء المحتملة عند تعيين الوقت المتوقع للإنهاء وقابلية التغيير.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/beta-inv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. وهي الاحتمال المقترن بتوزيع بيتا."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. وهي معلمة التوزيع."
			},
			A: {
				name: "A",
				detail: "وهي حد أدنى للفاصل الزمني x."
			},
			B: {
				name: "B",
				detail: "اختياري. وهي حد أعلى للفاصل الزمني x."
			}
		}
	},
	BINOM_DIST: {
		description: "تُرجع المصطلح الفردي لاحتمال التوزيع ذي الحدين. استخدم BINOM.DIST في المشاكل ذات العدد الثابت من الاختبارات أو التجارب، عندما تكون نتائج أي تجربة هي نجاح أو فشل فقط، وعندما تكون التجارب مستقلة، وعندما يكون احتمال النجاح ثابتاً في كافة مراحل التجربة. على سبيل المثال، بإمكان BINOM.DIST حساب احتمال أن يكون اثنان من المواليد الثلاثة القادمين من الذكور.",
		abstract: "تُرجع المصطلح الفردي لاحتمال التوزيع ذي الحدين. استخدم BINOM.DIST في المشاكل ذات العدد الثابت من الاختبارات أو التجارب، عندما تكون نتائج أي تجربة هي نجاح أو فشل فقط، وعندما تكون التجارب مستقلة، وعندما يكون احتمال النجاح ثابتاً في كافة مراحل التجربة. على سبيل المثال، بإمكان BINOM.DIST حساب احتمال أن يكون اثنان من المواليد الثلاثة القادمين من الذكور.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/binom-dist-function"
		}],
		functionParameter: {
			numberS: {
				name: "number_s",
				detail: "مطلوب. وهي عدد مرات النجاح في التجارب."
			},
			trials: {
				name: "trials",
				detail: "مطلوب. وهي عدد التجارب المستقلة."
			},
			probabilityS: {
				name: "probability_s",
				detail: "مطلوب. وهي احتمال النجاح في كل تجربة."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. وهي القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة cumulative تساوي TRUE، فإن BINOM.DIST تُرجع دالة التوزيع التراكمي، وهي الاحتمال بوجود number_s لعدد مرات النجاح على الأكثر، وإذا كانت تساوي FALSE، فإنها تُرجع دالة الاحتمالات غير التراكمية، وهي الاحتمال بوجود number_s لعدد مرات النجاح بالضبط."
			}
		}
	},
	BINOM_DIST_RANGE: {
		description: "ترجع احتمالية نتيجة محاولة باستخدام توزيع ذي حدين.",
		abstract: "ترجع احتمالية نتيجة محاولة باستخدام توزيع ذي حدين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/binom-dist-range-function"
		}],
		functionParameter: {
			trials: {
				name: "trials",
				detail: "مطلوب. وهي عدد التجارب المستقلة. يجب أن يكون أكبر من أو يساوي 0."
			},
			probabilityS: {
				name: "probability_s",
				detail: "مطلوب. احتمال النجاح في كل تجربة. يجب أن يكون أكبر من أو يساوي 0 وأقل من أو يساوي 1."
			},
			numberS: {
				name: "number_s",
				detail: "مطلوب. وهي عدد مرات النجاح في التجارب. يجب أن يكون أكبر من أو يساوي 0 وأقل من أو يساوي المحاكمات."
			},
			numberS2: {
				name: "number_s2",
				detail: "الاختياري. إذا تم توفيرها، فترجع احتمالية أن يقع عدد التجارب الناجحة بين Number_s number_s2. يجب أن يكون أكبر من أو يساوي Number_s وأقل من أو يساوي المحاكمات."
			}
		}
	},
	BINOM_INV: {
		description: "إرجاع أصغر قيمة يكون التوزيع التراكمي ذو الحدين الخاص بها أكبر من قيمة المعيار أو مساوياً لها.",
		abstract: "إرجاع أصغر قيمة يكون التوزيع التراكمي ذو الحدين الخاص بها أكبر من قيمة المعيار أو مساوياً لها.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/binom-inv-function"
		}],
		functionParameter: {
			trials: {
				name: "trials",
				detail: "مطلوب. وهي عدد تجارب Bernoulli."
			},
			probabilityS: {
				name: "probability_s",
				detail: "مطلوب. وهي احتمال النجاح في كل تجربة."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. وهي قيمة المعيار."
			}
		}
	},
	CHISQ_DIST: {
		description: "تُرجع توزيع كاي تربيع.",
		abstract: "تُرجع توزيع كاي تربيع.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chisq-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة التي تريد تقييم التوزيع عندها."
			},
			degFreedom: {
				name: "deg_freedom",
				detail: "مطلوب. وهي عدد درجات الحرية."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. وهي القيمة المنطقية التي تحدد تركيبة الدالة. إذا كانت قيمة cumulative تساوي TRUE، فتُرجع CHISQ.DIST دالة التوزيع التراكمي؛ وإذا كانت تساوي FALSE، فإنها تُرجع دالة كثافة الاحتمال."
			}
		}
	},
	CHISQ_DIST_RT: {
		description: "يقترن توزيع χ2 باختبار χ2. استخدم اختبار χ2 لمقارنة القيم التي تمت ملاحظتها بالقيم المتوقعة. على سبيل المثال، قد تفترض إحدى التجارب الجينية أن الجيل التالي من النباتات سيحمل مجموعة معينة من الألوان. يمكنك تحديد ما إذا كانت فرضيتك الأصلية صحيحة من خلال مقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة.",
		abstract: "يقترن توزيع χ2 باختبار χ2. استخدم اختبار χ2 لمقارنة القيم التي تمت ملاحظتها بالقيم المتوقعة. على سبيل المثال، قد تفترض إحدى التجارب الجينية أن الجيل التالي من النباتات سيحمل مجموعة معينة من الألوان. يمكنك تحديد ما إذا كانت فرضيتك الأصلية صحيحة من خلال مقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chisq-dist-rt-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة التي تريد تقييم التوزيع عندها."
			},
			degFreedom: {
				name: "deg_freedom",
				detail: "مطلوب. وهي عدد درجات الحرية."
			}
		}
	},
	CHISQ_INV: {
		description: "يتم بشكلٍ عام استخدام توزيع كاي تربيع لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل الفترات التي يقضيها الأشخاص في اليوم في مشاهدة التلفزيون.",
		abstract: "يتم بشكلٍ عام استخدام توزيع كاي تربيع لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل الفترات التي يقضيها الأشخاص في اليوم في مشاهدة التلفزيون.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chisq-inv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. وهي احتمال مقترن بتوزيع كاي تربيع."
			},
			degFreedom: {
				name: "deg_freedom",
				detail: "مطلوب. وهي عدد درجات الحرية."
			}
		}
	},
	CHISQ_INV_RT: {
		description: "تُرجع عكس الاحتمال ذي الطرف الأيمن لتوزيع كاي تربيع.",
		abstract: "تُرجع عكس الاحتمال ذي الطرف الأيمن لتوزيع كاي تربيع.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chisq-inv-rt-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. وهي احتمال مقترن بتوزيع كاي تربيع."
			},
			degFreedom: {
				name: "deg_freedom",
				detail: "مطلوب. وهي عدد درجات الحرية."
			}
		}
	},
	CHISQ_TEST: {
		description: "ترجع اختبار الاستقلالية.",
		abstract: "ترجع اختبار الاستقلالية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/chisq-test-function"
		}],
		functionParameter: {
			actualRange: {
				name: "actual_range",
				detail: "نطاق البيانات الذي يحتوي على الملاحظات المراد اختبارها مقابل القيم المتوقعة."
			},
			expectedRange: {
				name: "expected_range",
				detail: "نطاق البيانات الذي يحتوي على نسبة حاصل ضرب إجماليات الصفوف والأعمدة إلى الإجمالي الكلي."
			}
		}
	},
	CONFIDENCE_NORM: {
		description: "يعد فاصل الثقة عبارة عن نطاق من القيم. يوجد وسط العينة x في وسط هذا النطاق الذي يكون عبارة عن x‎ ± CONFIDENCE.NORM. على سبيل المثال، إذا كان x هو وسط العينة لعدد مرات تسليم المنتجات المطلوبة عبر البريد، فسيكون x‎ ± CONFIDENCE.NORM هو نطاق أوساط المحتوى. بالنسبة لأي وسط محتوى μ0 في هذا النطاق، يكون احتمال الحصول على وسط عينة أبعد من μ0 عن x أكبر من alpha؛ وبالنسبة لأي وسط محتوى μ0 غير موجود في هذا النطاق، يكون احتمال الحصول على وسط عينة أبعد من μ0 عن x أقل من alpha. بعبارة أخرى، افترض أننا نستخدم x وstandard_dev وsize لإنشاء اختبار ثنائي الطرف على مستوى الدلالة alpha بفرضية أن وسط المحتوى هو μ0. لن نرفض حينئذٍ هذه الفرضية إذا كان μ0 في فاصل الثقة وسنرفض هذه الفرضية إذا لم يكن μ0 في فاصل الثقة. لا يسمح لنا فاصل الثقة بالاستنتاج بأنه هناك الاحتمال ‎1 – alpha الذي يشير إلى أن الحزمة التالية ستستغرق وقتاً للتسليم معيناً في فاصل الثقة.",
		abstract: "يعد فاصل الثقة عبارة عن نطاق من القيم. يوجد وسط العينة x في وسط هذا النطاق الذي يكون عبارة عن x‎ ± CONFIDENCE.NORM. على سبيل المثال، إذا كان x هو وسط العينة لعدد مرات تسليم المنتجات المطلوبة عبر البريد، فسيكون x‎ ± CONFIDENCE.NORM هو نطاق أوساط المحتوى. بالنسبة لأي وسط محتوى μ0 في هذا النطاق، يكون احتمال الحصول على وسط عينة أبعد من μ0 عن x أكبر من alpha؛ وبالنسبة لأي وسط محتوى μ0 غير موجود في هذا النطاق، يكون احتمال الحصول على وسط عينة أبعد من μ0 عن x أقل من alpha. بعبارة أخرى، افترض أننا نستخدم x وstandard_dev وsize لإنشاء اختبار ثنائي الطرف على مستوى الدلالة alpha بفرضية أن وسط المحتوى هو μ0. لن نرفض حينئذٍ هذه الفرضية إذا كان μ0 في فاصل الثقة وسنرفض هذه الفرضية إذا لم يكن μ0 في فاصل الثقة. لا يسمح لنا فاصل الثقة بالاستنتاج بأنه هناك الاحتمال ‎1 – alpha الذي يشير إلى أن الحزمة التالية ستستغرق وقتاً للتسليم معيناً في فاصل الثقة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/confidence-norm-function"
		}],
		functionParameter: {
			alpha: {
				name: "alpha",
				detail: "مطلوب. مستوى الدلالة المُستخدم لحساب مستوى الثقة. يساوي مستوى الثقة ‎100*(1 - alpha)%‎، أو بعبارة أخرى، تشير alpha ذات القيمة 0,05 إلى مستوى ثقة بنسبة 95 في المئة."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري للمحتوى الخاص بنطاق البيانات والذي من المفترض أن يكون معروفاً."
			},
			size: {
				name: "size",
				detail: "مطلوب. حجم العينة."
			}
		}
	},
	CONFIDENCE_T: {
		description: "إرجاع فاصل الثقة لوسط محتوى باستخدام توزيع t للطالب.",
		abstract: "إرجاع فاصل الثقة لوسط محتوى باستخدام توزيع t للطالب.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/confidence-t-function"
		}],
		functionParameter: {
			alpha: {
				name: "alpha",
				detail: "مطلوب. مستوى الدلالة المُستخدم لحساب مستوى الثقة. يساوي مستوى الثقة ‎100*(1 - alpha)%‎، أو بعبارة أخرى، تشير alpha ذات القيمة 0,05 إلى مستوى ثقة بنسبة 95 في المئة."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري للمحتوى الخاص بنطاق البيانات والذي من المفترض أن يكون معروفاً."
			},
			size: {
				name: "size",
				detail: "مطلوب. حجم العينة."
			}
		}
	},
	CORREL: {
		description: "ترجع الدالة CORREL معامل الارتباط لنطاقين من الخلايا. استخدم معامل الارتباط لتحديد العلاقة بين خاصيتين. على سبيل المثال، يمكنك فحص العلاقة بين متوسط درجة الحرارة في مكان ما واستخدام مكيفات الهواء.",
		abstract: "ترجع الدالة CORREL معامل الارتباط لنطاقين من الخلايا. استخدم معامل الارتباط لتحديد العلاقة بين خاصيتين. على سبيل المثال، يمكنك فحص العلاقة بين متوسط درجة الحرارة في مكان ما واستخدام مكيفات الهواء.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/correl-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. نطاق من قيم الخلايا."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. نطاق ثان من قيم الخلايا."
			}
		}
	},
	COUNT: {
		description: "تعمل الدالة COUNT على حساب عدد الخلايا التي تحتوي على أرقام وحساب الأرقام ضمن قائمة من الوسيطات. استخدم الدالة COUNT لمعرفة عدد الإدخالات في حقل رقمي ضمن نطاق أو صفيف من الأرقام. على سبيل المثال، يمكنك إدخال الصيغة التالية لحساب عدد الأرقام في النطاق A1:A20: =COUNT(A1:A20) . في هذا المثال، إذا كان هناك خمس خلايا من النطاق تحتوي على أرقام، فسيكون الناتج 5 .",
		abstract: "تعمل الدالة COUNT على حساب عدد الخلايا التي تحتوي على أرقام وحساب الأرقام ضمن قائمة من الوسيطات. استخدم الدالة COUNT لمعرفة عدد الإدخالات في حقل رقمي ضمن نطاق أو صفيف من الأرقام. على سبيل المثال، يمكنك إدخال الصيغة التالية لحساب عدد الأرقام في النطاق A1:A20: =COUNT(A1:A20) . في هذا المثال، إذا كان هناك خمس خلايا من النطاق تحتوي على أرقام، فسيكون الناتج 5 .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/count-function"
		}],
		functionParameter: {
			value1: {
				name: "value 1",
				detail: "مطلوب. وهي العنصر أو مرجع الخلية أو النطاق الأول الذي تريد حساب الأرقام الموجودة بداخله."
			},
			value2: {
				name: "value 2",
				detail: "الاختياري. وهي العناصر الإضافية أو مراجع الخلايا أو النطاقات التي تريد حساب الأرقام الموجودة بداخلها ويصل عددها إلى 255."
			}
		}
	},
	COUNTA: {
		description: "تحسب الدالة COUNTA عدد الخلايا غير الفارغة في نطاق.",
		abstract: "تحسب الدالة COUNTA عدد الخلايا غير الفارغة في نطاق.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/counta-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "الرقم الأول أو مرجع الخلية أو النطاق الذي تريد حساب متوسطه."
			},
			value2: {
				name: "value2",
				detail: "أرقام أو مراجع خلايا أو نطاقات إضافية تريد حساب متوسطها، بحد أقصى 255."
			}
		}
	},
	COUNTBLANK: {
		description: "استخدم الدالة COUNTBLANK ، إحدى الدالات الإحصائية ، لحساب عدد الخلايا الفارغة في نطاق من الخلايا.",
		abstract: "استخدم الدالة COUNTBLANK ، إحدى الدالات الإحصائية ، لحساب عدد الخلايا الفارغة في نطاق من الخلايا.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/countblank-function"
		}],
		functionParameter: { range: {
			name: "range",
			detail: "مطلوب. وهي النطاق الذي تريد حساب الخلايا الفارغة منه."
		} }
	},
	COUNTIF: {
		description: "يمكنك استخدام COUNTIF، وهي إحدى الدالات الإحصائية ، لحساب عدد الخلايا التي تفي بمعيار معين؛ على سبيل المثال، لحساب عدد المرات التي تظهر فيها مدينة معينة في قائمة عملاء.",
		abstract: "يمكنك استخدام COUNTIF، وهي إحدى الدالات الإحصائية ، لحساب عدد الخلايا التي تفي بمعيار معين؛ على سبيل المثال، لحساب عدد المرات التي تظهر فيها مدينة معينة في قائمة عملاء.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/use-the-countif-function-in-microsoft-excel"
		}],
		functionParameter: {
			range: {
				name: "range",
				detail: "مجموعة الخلايا التي تريد حسابها. يمكن أن يحتوي النطاق على أرقام أو صفائف أو نطاق مسمى أو مراجع تحتوي على أرقام. ويتم تجاهل القيم الفارغة والنصية. تعرّف على كيفية تحديد النطاقات في ورقة عمل ."
			},
			criteria: {
				name: "criteria",
				detail: "رقم أو تعبير أو مرجع خلية أو سلسلة نصية تحدد الخلايا التي سيتم حساب عددها. على سبيل المثال، يمكنك استخدام رقم مثل 32 أو مقارنة مثل \">32\" أو خلية مثل B4 أو كلمة مثل \"تفاح\". تستخدم COUNTIF معياراً واحداً فقط. لذلك، استخدم COUNTIFS إذا كنت تريد استخدام معايير متعددة."
			}
		}
	},
	COUNTIFS: {
		description: "تطبق الدالة COUNTIFS المعايير على الخلايا عبر نطاقات متعددة وتحسب عدد المرات التي يتم فيها استيفاء جميع المعايير.",
		abstract: "تطبق الدالة COUNTIFS المعايير على الخلايا عبر نطاقات متعددة وتحسب عدد المرات التي يتم فيها استيفاء جميع المعايير.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/countifs-function"
		}],
		functionParameter: {
			criteriaRange1: {
				name: "criteria_range1",
				detail: "مطلوب. وتمثل النطاق الأول الذي سيتم فيه تقييم المعايير المقترنة."
			},
			criteria1: {
				name: "criteria1",
				detail: "مطلوب. وهي المعايير الموجودة على شكل رقم أو تعبير أو مرجع خلية أو نص والتي تحدد الخلايا التي سيتم حسابها. على سبيل المثال، يمكن التعبير عن المعايير على أنها 32 أو \">32\" أو B4 أو \"تفاح\" أو \"32\"."
			},
			criteriaRange2: {
				name: "criteria_range2",
				detail: "الاختياري. وهي نطاقات إضافية والمعايير المقترنة بها. يتم السماح بما يصل إلى 127 زوج من النطاقات/المعايير."
			},
			criteria2: {
				name: "criteria2",
				detail: "الاختياري. وهي نطاقات إضافية والمعايير المقترنة بها. يتم السماح بما يصل إلى 127 زوج من النطاقات/المعايير."
			}
		}
	},
	COVARIANCE_P: {
		description: "تُرجع التباين المشترك للمحتوى، وهو معدل ضرب الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات. استخدم التباين المشترك لتحديد العلاقة بين مجموعتين من البيانات. على سبيل المثال، يمكنك معرفة ما إذا كانت زيادة الدخل ترتبط بارتفاع مستوى التعليم.",
		abstract: "تُرجع التباين المشترك للمحتوى، وهو معدل ضرب الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات. استخدم التباين المشترك لتحديد العلاقة بين مجموعتين من البيانات. على سبيل المثال، يمكنك معرفة ما إذا كانت زيادة الدخل ترتبط بارتفاع مستوى التعليم.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/covariance-p-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. تمثل هذه الوسيطة نطاق الخلايا الأول من الأعداد الصحيحة."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. تمثل هذه الوسيطة نطاق الخلايا الثاني من الأعداد الصحيحة."
			}
		}
	},
	COVARIANCE_S: {
		description: "تُرجع التباين المشترك للعينة، وهو معدل ضرب الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات.",
		abstract: "تُرجع التباين المشترك للعينة، وهو معدل ضرب الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/covariance-s-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. تمثل هذه الوسيطة نطاق الخلايا الأول من الأعداد الصحيحة."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. تمثل هذه الوسيطة نطاق الخلايا الثاني من الأعداد الصحيحة."
			}
		}
	},
	DEVSQ: {
		description: "تُرجع هذه الدالة مجموع مربعات انحرافات نقاط البيانات من وسطها النموذجي.",
		abstract: "تُرجع هذه الدالة مجموع مربعات انحرافات نقاط البيانات من وسطها النموذجي.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/devsq-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب مجموع انحرافاتها المربعة. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب مجموع انحرافاتها المربعة. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	EXPON_DIST: {
		description: "تُرجع هذه الدالة التوزيع الأسي. استخدم الدالة EXPON.DIST لتحديد الوقت بين الأحداث، مثل المدة التي يحتاج إليها صرّاف المصرف الآلي لتسليم النقود. على سبيل المثال، يمكنك استخدام الدالة EXPON.DIST لتحديد احتمال أن تستغرق العملية دقيقة واحدة على الأكثر.",
		abstract: "تُرجع هذه الدالة التوزيع الأسي. استخدم الدالة EXPON.DIST لتحديد الوقت بين الأحداث، مثل المدة التي يحتاج إليها صرّاف المصرف الآلي لتسليم النقود. على سبيل المثال، يمكنك استخدام الدالة EXPON.DIST لتحديد احتمال أن تستغرق العملية دقيقة واحدة على الأكثر.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/expon-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. قيمة الدالة."
			},
			lambda: {
				name: "lambda",
				detail: "مطلوب. قيمة المعلمة."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. قيمة منطقية تشير إلى تركيبة الدالة الأسية التي سيتم توفيرها. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع الدالة EXPON.DIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال."
			}
		}
	},
	F_DIST: {
		description: "إرجاع توزيع الاحتمال F. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك فحص درجات الاختبار للرجال والنساء الذين يدخلون المدرسة الثانوية، وتحديد ما إذا كان التباين في الإناث مختلفا عن ذلك الموجود في الذكور.",
		abstract: "إرجاع توزيع الاحتمال F. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك فحص درجات الاختبار للرجال والنساء الذين يدخلون المدرسة الثانوية، وتحديد ما إذا كان التباين في الإناث مختلفا عن ذلك الموجود في الذكور.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/f-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			degFreedom1: {
				name: "deg_freedom1",
				detail: "مطلوب. بسط درجات الحرية."
			},
			degFreedom2: {
				name: "deg_freedom2",
				detail: "مطلوب. مقام درجات الحرية."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع الدالة F.DIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال."
			}
		}
	},
	F_DIST_RT: {
		description: "تُرجع توزيع الاحتمال F (ذي الطرف الأيمن) (درجة الاختلاف) لمجموعتين من البيانات. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك معاينة نقاط الاختبار التي حصل عليها شبّان وشابات في امتحان دخول مدرسة ثانوية وتحديد ما إذا كان الفرق بين نقاط الإناث مختلفاً عن الفرق بين نقاط الذكور.",
		abstract: "تُرجع توزيع الاحتمال F (ذي الطرف الأيمن) (درجة الاختلاف) لمجموعتين من البيانات. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك معاينة نقاط الاختبار التي حصل عليها شبّان وشابات في امتحان دخول مدرسة ثانوية وتحديد ما إذا كان الفرق بين نقاط الإناث مختلفاً عن الفرق بين نقاط الذكور.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/f-dist-rt-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			degFreedom1: {
				name: "deg_freedom1",
				detail: "مطلوب. بسط درجات الحرية."
			},
			degFreedom2: {
				name: "deg_freedom2",
				detail: "مطلوب. مقام درجات الحرية."
			}
		}
	},
	F_INV: {
		description: "إرجاع عكس توزيع الاحتمال F. إذا كانت p = F.DIST(x,...)، فإن F.INV(p,...) = x. يمكن استخدام التوزيع F في اختبار F يقارن درجة التغير بين مجموعتين من البيانات. على سبيل المثال، يمكنك تحليل توزيعات الدخل في الولايات المتحدة وكندا لتحديد ما إذا كان في البلدين درجة متشابهة من اختلاف الدخل.",
		abstract: "إرجاع عكس توزيع الاحتمال F. إذا كانت p = F.DIST(x,...)، فإن F.INV(p,...) = x. يمكن استخدام التوزيع F في اختبار F يقارن درجة التغير بين مجموعتين من البيانات. على سبيل المثال، يمكنك تحليل توزيعات الدخل في الولايات المتحدة وكندا لتحديد ما إذا كان في البلدين درجة متشابهة من اختلاف الدخل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/f-inv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. احتمال مقترن بتوزيع F التراكمي."
			},
			degFreedom1: {
				name: "deg_freedom1",
				detail: "مطلوب. بسط درجات الحرية."
			},
			degFreedom2: {
				name: "deg_freedom2",
				detail: "مطلوب. مقام درجات الحرية."
			}
		}
	},
	F_INV_RT: {
		description: "تُرجع هذه الدالة عكس توزيع الاحتمال F (ذي الطرف الأيمن). إذا كانت قيمة p = F.DIST.RT(x,...)‎، فتكون عندئذٍ قيمة F.INV.RT(p,...) = x. يمكن استخدام التوزيع F في أحد اختبارات F التي تقارن درجة التغير بين مجموعتين من البيانات. على سبيل المثال، يمكنك تحليل توزيعات الدخل في الولايات المتحدة وكندا لتحديد ما إذا كان في البلدين درجة متشابهة من اختلاف الدخل.",
		abstract: "تُرجع هذه الدالة عكس توزيع الاحتمال F (ذي الطرف الأيمن). إذا كانت قيمة p = F.DIST.RT(x,...)‎، فتكون عندئذٍ قيمة F.INV.RT(p,...) = x. يمكن استخدام التوزيع F في أحد اختبارات F التي تقارن درجة التغير بين مجموعتين من البيانات. على سبيل المثال، يمكنك تحليل توزيعات الدخل في الولايات المتحدة وكندا لتحديد ما إذا كان في البلدين درجة متشابهة من اختلاف الدخل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/f-inv-rt-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. احتمال مقترن بتوزيع F التراكمي."
			},
			degFreedom1: {
				name: "deg_freedom1",
				detail: "مطلوب. بسط درجات الحرية."
			},
			degFreedom2: {
				name: "deg_freedom2",
				detail: "مطلوب. مقام درجات الحرية."
			}
		}
	},
	F_TEST: {
		description: "استخدم هذه الدالة لتحديد وجود تباينات مختلفة بين نموذجين. على سبيل المثال، بالاستناد إلى نقاط اختبار من مدرستين رسمية وخاصة، يمكنك اختبار ما إذا كانت مستويات التباين في نقاط الاختبار مختلفة بين هاتين المدرستين.",
		abstract: "استخدم هذه الدالة لتحديد وجود تباينات مختلفة بين نموذجين. على سبيل المثال، بالاستناد إلى نقاط اختبار من مدرستين رسمية وخاصة، يمكنك اختبار ما إذا كانت مستويات التباين في نقاط الاختبار مختلفة بين هاتين المدرستين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/f-test-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. الصفيف أو نطاق البيانات الأول."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. الصفيف أو نطاق البيانات الثاني."
			}
		}
	},
	FISHER: {
		description: "تُرجع هذه الدالة تحويل Fisher عند x. ينتج عن هذا التحويل دالة يتم في العادة توزيعها بدلاً من أن تكون منحرفة. استخدم هذه الدالة لتنفيذ اختبار افتراضي على معامل الارتباط.",
		abstract: "تُرجع هذه الدالة تحويل Fisher عند x. ينتج عن هذا التحويل دالة يتم في العادة توزيعها بدلاً من أن تكون منحرفة. استخدم هذه الدالة لتنفيذ اختبار افتراضي على معامل الارتباط.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/fisher-function"
		}],
		functionParameter: { x: {
			name: "x",
			detail: "مطلوبة. قيمة رقمية تريد تحويلها."
		} }
	},
	FISHERINV: {
		description: "تُرجع هذه الدالة عكس تحويل Fisher. استخدم هذا التحويل عند تحليل معاملات الارتباطات بين نطاقات أو صفائف من البيانات. إذا كانت y = FISHER(x)‎، فتكون عندئذٍ FISHERINV(y) = x.",
		abstract: "تُرجع هذه الدالة عكس تحويل Fisher. استخدم هذا التحويل عند تحليل معاملات الارتباطات بين نطاقات أو صفائف من البيانات. إذا كانت y = FISHER(x)‎، فتكون عندئذٍ FISHERINV(y) = x.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/fisherinv-function"
		}],
		functionParameter: { y: {
			name: "y",
			detail: "مطلوبة. القيمة التي تريد حساب عكس التحويل لها."
		} }
	},
	FORECAST: {
		description: "حساب قيمة مستقبلية أو التنبؤ بها باستخدام القيم الموجودة. القيمة المستقبلية هي قيمة ص لقيمة x معينة. القيم الموجودة هي قيم س وقيم ص معروفة، ويتم التنبؤ بالقيمة المستقبلية باستخدام الانحدار الخطي. يمكنك استخدام هذه الدالات للتنبؤ بالمبيعات المستقبلية أو متطلبات المخزون أو اتجاهات المستهلكين.",
		abstract: "حساب قيمة مستقبلية أو التنبؤ بها باستخدام القيم الموجودة. القيمة المستقبلية هي قيمة ص لقيمة x معينة. القيم الموجودة هي قيم س وقيم ص معروفة، ويتم التنبؤ بالقيمة المستقبلية باستخدام الانحدار الخطي. يمكنك استخدام هذه الدالات للتنبؤ بالمبيعات المستقبلية أو متطلبات المخزون أو اتجاهات المستهلكين.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/forecast-and-forecast-linear-functions"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "نعم نقطة البيانات التي تريد توقع قيمة لها."
			},
			knownYs: {
				name: "known_y's",
				detail: "نعم الصفيف أو نطاق البيانات التابع."
			},
			knownXs: {
				name: "known_x's",
				detail: "نعم الصفيف أو نطاق البيانات المستقل."
			}
		}
	},
	FORECAST_ETS: {
		description: "تحسب أو تتنبأ بقيمة مستقبلية استناداً إلى قيم تاريخية باستخدام الإصدار AAA من خوارزمية التنعيم الأسي (ETS).",
		abstract: "تحسب أو تتنبأ بقيمة مستقبلية استناداً إلى قيم تاريخية باستخدام الإصدار AAA من خوارزمية التنعيم الأسي (ETS).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/forecast-ets-function"
		}],
		functionParameter: {
			targetDate: {
				name: "التاريخ المستهدف",
				detail: "نقطة البيانات التي تريد توقع قيمة لها."
			},
			values: {
				name: "القيم",
				detail: "القيم التاريخية المستخدمة في التنبؤ."
			},
			timeline: {
				name: "المخطط الزمني",
				detail: "نطاق أو مصفوفة مستقلة من التواريخ أو الأوقات الرقمية ذات خطوة ثابتة."
			},
			seasonality: {
				name: "الموسمية",
				detail: "اختياري. طول النمط الموسمي؛ 1 للاكتشاف التلقائي و0 لعدم وجود موسمية."
			},
			dataCompletion: {
				name: "إكمال البيانات",
				detail: "اختياري. استخدم 1 لاستيفاء النقاط المفقودة أو 0 لاعتبارها صفراً."
			},
			aggregation: {
				name: "التجميع",
				detail: "اختياري. قيمة من 1 إلى 7 تحدد طريقة تجميع الطوابع الزمنية المكررة."
			}
		}
	},
	FORECAST_ETS_CONFINT: {
		description: "تُرجع فترة الثقة للقيمة المتوقعة عند نقطة هدف محددة.",
		abstract: "تُرجع فترة الثقة للقيمة المتوقعة عند نقطة هدف محددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/forecast-ets-confint-function"
		}],
		functionParameter: {
			targetDate: {
				name: "التاريخ المستهدف",
				detail: "نقطة البيانات التي تريد توقع قيمة لها."
			},
			values: {
				name: "القيم",
				detail: "القيم التاريخية المستخدمة في التنبؤ."
			},
			timeline: {
				name: "المخطط الزمني",
				detail: "نطاق أو مصفوفة مستقلة من التواريخ أو الأوقات الرقمية ذات خطوة ثابتة."
			},
			confidenceLevel: {
				name: "مستوى الثقة",
				detail: "اختياري. رقم بين 0 و1؛ القيمة الافتراضية 0.95."
			},
			seasonality: {
				name: "الموسمية",
				detail: "اختياري. طول النمط الموسمي؛ 1 للاكتشاف التلقائي و0 لعدم وجود موسمية."
			},
			dataCompletion: {
				name: "إكمال البيانات",
				detail: "اختياري. استخدم 1 لاستيفاء النقاط المفقودة أو 0 لاعتبارها صفراً."
			},
			aggregation: {
				name: "التجميع",
				detail: "اختياري. قيمة من 1 إلى 7 تحدد طريقة تجميع الطوابع الزمنية المكررة."
			}
		}
	},
	FORECAST_ETS_SEASONALITY: {
		description: "تُرجع طول النمط المتكرر الذي يكتشفه Excel لسلسلة زمنية محددة.",
		abstract: "تُرجع طول النمط المتكرر الذي يكتشفه Excel لسلسلة زمنية محددة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/forecast-ets-seasonality-function"
		}],
		functionParameter: {
			values: {
				name: "القيم",
				detail: "القيم التاريخية المستخدمة في التنبؤ."
			},
			timeline: {
				name: "المخطط الزمني",
				detail: "نطاق أو مصفوفة مستقلة من التواريخ أو الأوقات الرقمية ذات خطوة ثابتة."
			},
			dataCompletion: {
				name: "إكمال البيانات",
				detail: "اختياري. استخدم 1 لاستيفاء النقاط المفقودة أو 0 لاعتبارها صفراً."
			},
			aggregation: {
				name: "التجميع",
				detail: "اختياري. قيمة من 1 إلى 7 تحدد طريقة تجميع الطوابع الزمنية المكررة."
			}
		}
	},
	FORECAST_ETS_STAT: {
		description: "تُرجع قيمة إحصائية ناتجة عن توقع سلسلة زمنية.",
		abstract: "تُرجع قيمة إحصائية ناتجة عن توقع سلسلة زمنية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/forecast-ets-stat-function"
		}],
		functionParameter: {
			values: {
				name: "القيم",
				detail: "القيم التاريخية المستخدمة في التنبؤ."
			},
			timeline: {
				name: "المخطط الزمني",
				detail: "نطاق أو مصفوفة مستقلة من التواريخ أو الأوقات الرقمية ذات خطوة ثابتة."
			},
			statisticType: {
				name: "نوع الإحصاء",
				detail: "قيمة من 1 إلى 8 تحدد إحصاء التنبؤ المطلوب."
			},
			seasonality: {
				name: "الموسمية",
				detail: "اختياري. طول النمط الموسمي؛ 1 للاكتشاف التلقائي و0 لعدم وجود موسمية."
			},
			dataCompletion: {
				name: "إكمال البيانات",
				detail: "اختياري. استخدم 1 لاستيفاء النقاط المفقودة أو 0 لاعتبارها صفراً."
			},
			aggregation: {
				name: "التجميع",
				detail: "اختياري. قيمة من 1 إلى 7 تحدد طريقة تجميع الطوابع الزمنية المكررة."
			}
		}
	},
	FORECAST_LINEAR: {
		description: "حساب قيمة مستقبلية أو التنبؤ بها باستخدام القيم الموجودة. القيمة المستقبلية هي قيمة ص لقيمة x معينة. القيم الموجودة هي قيم س وقيم ص معروفة، ويتم التنبؤ بالقيمة المستقبلية باستخدام الانحدار الخطي. يمكنك استخدام هذه الدالات للتنبؤ بالمبيعات المستقبلية أو متطلبات المخزون أو اتجاهات المستهلكين.",
		abstract: "حساب قيمة مستقبلية أو التنبؤ بها باستخدام القيم الموجودة. القيمة المستقبلية هي قيمة ص لقيمة x معينة. القيم الموجودة هي قيم س وقيم ص معروفة، ويتم التنبؤ بالقيمة المستقبلية باستخدام الانحدار الخطي. يمكنك استخدام هذه الدالات للتنبؤ بالمبيعات المستقبلية أو متطلبات المخزون أو اتجاهات المستهلكين.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/forecast-and-forecast-linear-functions"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "نعم نقطة البيانات التي تريد توقع قيمة لها."
			},
			knownYs: {
				name: "known_y's",
				detail: "نعم الصفيف أو نطاق البيانات التابع."
			},
			knownXs: {
				name: "known_x's",
				detail: "نعم الصفيف أو نطاق البيانات المستقل."
			}
		}
	},
	FREQUENCY: {
		description: "تحسب الدالة تكرار مدى تكرار قيم معينة داخل نطاق من القيم، ثم تُرجع صفيفًا عموديًا من الأرقام. على سبيل المثال، استخدم FREQUENCY لحساب عدد نقاط الاختبار التي تقع ضمن نطاقات من النقاط. ونظراً إلى أن FREQUENCY تُرجع صفيفاً، يجب إدخالها كصيغة صفيف.",
		abstract: "تحسب الدالة تكرار مدى تكرار قيم معينة داخل نطاق من القيم، ثم تُرجع صفيفًا عموديًا من الأرقام. على سبيل المثال، استخدم FREQUENCY لحساب عدد نقاط الاختبار التي تقع ضمن نطاقات من النقاط. ونظراً إلى أن FREQUENCY تُرجع صفيفاً، يجب إدخالها كصيغة صفيف.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/frequency-function"
		}],
		functionParameter: {
			dataArray: {
				name: "data_array",
				detail: "مطلوب. صفيف أو مرجع لمجموعة من القيم التي تريد حساب مدى تكرارها. إذا لم تتضمّن الوسيطة data_array أي قيم، فتُرجع الدالة FREQUENCY صفيفاً من الأصفار."
			},
			binsArray: {
				name: "bins_array",
				detail: "مطلوب. صفيف أو مرجع للفواصل التي تريد تجميع القيم ضمنها في data_array. إذا لم تتضمّن الوسيطة bins_array أي قيم، فتُرجع الدالة FREQUENCY عدد العناصر في data_array."
			}
		}
	},
	GAMMA: {
		description: "تُرجع هذه الدالة قيمة دالة غاما.",
		abstract: "تُرجع هذه الدالة قيمة دالة غاما.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gamma-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. تُرجع رقمًا."
		} }
	},
	GAMMA_DIST: {
		description: "تُرجع توزيع غاما. يمكنك استخدام هذه الدالة لدراسة المتغيرات التي قد تكون ذات توزيع منحرف. يُستخدم توزيع غاما بشكل شائع في تحليل الصفوف.",
		abstract: "تُرجع توزيع غاما. يمكنك استخدام هذه الدالة لدراسة المتغيرات التي قد تكون ذات توزيع منحرف. يُستخدم توزيع غاما بشكل شائع في تحليل الصفوف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gamma-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة التي تريد تقييم التوزيع عندها."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. معلمة للتوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. معلمة للتوزيع. إذا كانت beta = 1، فتُرجع الدالة GAMMA.DIST توزيع غاما القياسي."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد تركيبة الدالة. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع GAMMA.DIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال."
			}
		}
	},
	GAMMA_INV: {
		description: "تُرجع هذه الدالة عكس توزيع غاما التراكمي. إذا كانت p = GAMMA.DIST(x,...)‎، فتكون عندئذٍ قيمة GAMMA.INV(p,...) = x. يمكنك استخدام هذه الدالة لدراسة متغير قد يكون التوزيع الخاص به منحرفاً.",
		abstract: "تُرجع هذه الدالة عكس توزيع غاما التراكمي. إذا كانت p = GAMMA.DIST(x,...)‎، فتكون عندئذٍ قيمة GAMMA.INV(p,...) = x. يمكنك استخدام هذه الدالة لدراسة متغير قد يكون التوزيع الخاص به منحرفاً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gamma-inv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المقترن بتوزيع غاما."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. معلمة للتوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. معلمة للتوزيع. إذا كانت beta = 1، فتُرجع GAMMA.INV توزيع غاما القياسي."
			}
		}
	},
	GAMMALN: {
		description: "إرجاع اللوغاريتم الطبيعي لدالة غاما، ‎Γ(x)‎.",
		abstract: "إرجاع اللوغاريتم الطبيعي لدالة غاما، ‎Γ(x)‎.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gammaln-function"
		}],
		functionParameter: { x: {
			name: "x",
			detail: "مطلوبة. القيمة التي تريد حساب GAMMALN لها."
		} }
	},
	GAMMALN_PRECISE: {
		description: "إرجاع اللوغاريتم الطبيعي لدالة غاما، ‎Γ(x)‎.",
		abstract: "إرجاع اللوغاريتم الطبيعي لدالة غاما، ‎Γ(x)‎.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gammaln-precise-function"
		}],
		functionParameter: { x: {
			name: "x",
			detail: "مطلوبة. القيمة التي تريد حساب GAMMALN.PRECISE لها."
		} }
	},
	GAUSS: {
		description: "تحسب احتمال وقوع عنصر من محتوى عادي قياسي بين الوسط والعدد z من الانحرافات المعيارية عن الوسط.",
		abstract: "تحسب احتمال وقوع عنصر من محتوى عادي قياسي بين الوسط والعدد z من الانحرافات المعيارية عن الوسط.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/gauss-function"
		}],
		functionParameter: { z: {
			name: "z",
			detail: "مطلوبة. تُرجع رقمًا."
		} }
	},
	GEOMEAN: {
		description: "تُرجع هذه الدالة الوسط الهندسي لصفيف أو نطاق من البيانات الموجبة. على سبيل المثال، يمكنك استخدام GEOMEAN لحساب معدل النمو المتوسط للفائدة المركبة المذكورة مع المعدلات المتغيرة.",
		abstract: "تُرجع هذه الدالة الوسط الهندسي لصفيف أو نطاق من البيانات الموجبة. على سبيل المثال، يمكنك استخدام GEOMEAN لحساب معدل النمو المتوسط للفائدة المركبة المذكورة مع المعدلات المتغيرة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/geomean-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب الوسط لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب الوسط لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	GROWTH: {
		description: "تحسب هذه الدالة التزايد الأسي المتوقع باستخدام البيانات الموجودة. تُرجع الدالة GROWTH قيم y لسلسة من قيم x الجديدة التي تعينها باستخدام قيم x وقيم y الموجودة. يمكنك أيضاً استخدام دالة ورقة العمل GROWTH لملاءمة منحنى أسي مع قيم x وقيم y الموجودة.",
		abstract: "تحسب هذه الدالة التزايد الأسي المتوقع باستخدام البيانات الموجودة. تُرجع الدالة GROWTH قيم y لسلسة من قيم x الجديدة التي تعينها باستخدام قيم x وقيم y الموجودة. يمكنك أيضاً استخدام دالة ورقة العمل GROWTH لملاءمة منحنى أسي مع قيم x وقيم y الموجودة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/growth-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مطلوب. مجموعة قيم y التي تعرفها بالفعل في العلاقة y = b*m^x. إذا كان صفيف قيم known_y's موجوداً في عمود مفرد، فيتم عندئذٍ تفسير كل عمود من قيم known_x's كمتغير منفصل. إذا كان صفيف قيم known_y's موجوداً في صف مفرد، فيتم عندئذٍ تفسير كل صف من قيم known_x's كمتغير منفصل. إذا كان أي من الأرقام في known_y 0 أو سالبا، فترجع الدالة GROWTH #NUM! وهي قيمة خطأ."
			},
			knownXs: {
				name: "known_x's",
				detail: "الاختياري. مجموعة اختيارية من قيم س التي تعرفها بالفعل في العلاقة y = b*m^x. يمكن لصفيف قيم known_x's أن يتضمّن مجموعة أو أكثر من المتغيرات. إذا تم استخدام متغير واحد فقط، فيمكن لقيم known_y's وknown_x's أن تكون نطاقات من أي شكل، طالما أنها ذات أبعاد متساوية. إذا تم استخدام أكثر من متغير واحد، فيجب أن تكون قيم known_y's عبارة عن خط متجه (أي، نطاق بارتفاع صف واحد أو بعرض عمود واحد). إذا تم تجاهل قيم known_x's، فسيتم افتراض أنها الصفيف {...,1,2,3} بالحجم نفسه لقيم known_y's."
			},
			newXs: {
				name: "new_x's",
				detail: "الاختياري. قيم x الجديدة التي تريد أن تقوم الدالة GROWTH بإرجاع قيم y الموافقة لها. يجب أن تتضمن قيم New_x's عموداً (أو صفاً) لكل متغير مستقل، تماماً كما هو الحال بالنسبة إلى قيم known_x's. وبالتالي، إذا كانت قيم known_y's موجودة في عمود واحد، يجب أن يكون عدد الأعمدة في known_x's وnew_x's متساوياً. وبالتالي، إذا كانت قيم known_y's موجودة في صف واحد، فيجب أن يكون عدد الصفوف في known_x's وnew_x's متساوياً. إذا تم حذف قيم new_x's، فسيتم افتراض أنها مماثلة لقيم known_x's. إذا تم تجاهل كل من قيم known_x's وnew_x's، فسيتم افتراض أنها الصفيف {...,1,2,3} بالحجم نفسه لقيم known_y's."
			},
			constb: {
				name: "const",
				detail: "الاختياري. قيمة منطقية تحدد ما إذا كان سيتم فرض الثابت b ليساوي 1. إذا كانت قيمة const تساوي TRUE أو إذا تم حذفها، فيتم حساب b بالشكل المعتاد. إذا كانت قيمة const تساوي FALSE، فيتم تعيين b ليساوي 1 ويتم ضبط قيم m للحصول على y = m^x."
			}
		}
	},
	HARMEAN: {
		description: "تُرجع هذه الدالة الوسط التوافقي لمجموعة بيانات. إن الوسط التوافقي هو معكوس الوسط الحسابي لمقلوب الأرقام.",
		abstract: "تُرجع هذه الدالة الوسط التوافقي لمجموعة بيانات. إن الوسط التوافقي هو معكوس الوسط الحسابي لمقلوب الأرقام.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/harmean-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب الوسط لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب الوسط لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	HYPGEOM_DIST: {
		description: "تُرجع هذه الدالة توزيع الهندسة الفوقية. تُرجع الدالة HYPGEOM.DIST احتمال عدد معين لمرات النجاح في العينة، بالنسبة إلى حجم العينة وعدد مرات نجاح المحتوى وحجمه. استخدم HYPGEOM.DIST لحل المشاكل التي تتعلق بمحتوى محدود، حيث تكون كل عملية مراقبة عبارة عن نجاح أو فشل، وحيث يتم اختيار كل مجموعة فرعية ذات حجم معيّن باحتمالية متساوية.",
		abstract: "تُرجع هذه الدالة توزيع الهندسة الفوقية. تُرجع الدالة HYPGEOM.DIST احتمال عدد معين لمرات النجاح في العينة، بالنسبة إلى حجم العينة وعدد مرات نجاح المحتوى وحجمه. استخدم HYPGEOM.DIST لحل المشاكل التي تتعلق بمحتوى محدود، حيث تكون كل عملية مراقبة عبارة عن نجاح أو فشل، وحيث يتم اختيار كل مجموعة فرعية ذات حجم معيّن باحتمالية متساوية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/hypgeom-dist-function"
		}],
		functionParameter: {
			sampleS: {
				name: "sample_s",
				detail: "مطلوب. عدد مرات النجاح في العينة."
			},
			numberSample: {
				name: "number_sample",
				detail: "مطلوب. حجم العينة."
			},
			populationS: {
				name: "population_s",
				detail: "مطلوب. عدد مرات النجاح في المحتوى."
			},
			numberPop: {
				name: "number_pop",
				detail: "مطلوب. حجم المحتوى."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع عندئذٍ الدالة HYPGEOM.DIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة الاحتمالات غير التراكمية."
			}
		}
	},
	INTERCEPT: {
		description: "تحسب هذه الدالة النقطة التي يتقاطع عندها خط مع محور ص باستخدام قيم س وقيم ص الموجودة. تستند نقطة التقاطع إلى أقرب خط انحدار مرسوم بواسطة قيم س وقيم ص المعروفة. استخدم الدالة INTERCEPT عندما تريد تحديد قيمة المتغير التابع عندما تكون قيمة المتغير المستقل 0 (صفر). على سبيل المثال، يمكنك استخدام الدالة INTERCEPT لتوقع مقدار المقاومة الكهربائية لمعدن عند 0 درجة مئوية عند أخذ نقاط البيانات في درجة حرارة الغرفة أو أعلى.",
		abstract: "تحسب هذه الدالة النقطة التي يتقاطع عندها خط مع محور ص باستخدام قيم س وقيم ص الموجودة. تستند نقطة التقاطع إلى أقرب خط انحدار مرسوم بواسطة قيم س وقيم ص المعروفة. استخدم الدالة INTERCEPT عندما تريد تحديد قيمة المتغير التابع عندما تكون قيمة المتغير المستقل 0 (صفر). على سبيل المثال، يمكنك استخدام الدالة INTERCEPT لتوقع مقدار المقاومة الكهربائية لمعدن عند 0 درجة مئوية عند أخذ نقاط البيانات في درجة حرارة الغرفة أو أعلى.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/intercept-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مطلوب. مجموعة المشاهدات أو البيانات التابعة."
			},
			knownXs: {
				name: "known_x's",
				detail: "مطلوب. مجموعة المشاهدات أو البيانات المستقلة."
			}
		}
	},
	KURT: {
		description: "تُرجع هذه الدالة التفرطح لمجموعة بيانات. يميز التفرطح الذروة النسبية أو التسطح النسبي للتوزيع مقارنةً بالتوزيع العادي. يشير التفرطح الموجب إلى توزيع ذروة نسبي. ويشير التفرطح السالب إلى توزيع تسطح نسبي.",
		abstract: "تُرجع هذه الدالة التفرطح لمجموعة بيانات. يميز التفرطح الذروة النسبية أو التسطح النسبي للتوزيع مقارنةً بالتوزيع العادي. يشير التفرطح الموجب إلى توزيع ذروة نسبي. ويشير التفرطح السالب إلى توزيع تسطح نسبي.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/kurt-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب تفرطحها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي ترغب في حساب تفرطحها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	LARGE: {
		description: "تُرجع هذه الدالة ترتيب القيمة الكبرى في مجموعة بيانات. يمكنك استخدام هذه الدالة لتحديد قيمة استناداً إلى موقعها النسبي. فيمكنك على سبيل المثال استخدام الدالة LARGE لإرجاع أكبر تقدير، أو التقدير الذي يليه، أو التقدير الثالث.",
		abstract: "تُرجع هذه الدالة ترتيب القيمة الكبرى في مجموعة بيانات. يمكنك استخدام هذه الدالة لتحديد قيمة استناداً إلى موقعها النسبي. فيمكنك على سبيل المثال استخدام الدالة LARGE لإرجاع أكبر تقدير، أو التقدير الذي يليه، أو التقدير الثالث.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/large-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق البيانات الذي تريد ترتيب القيم الكبرى فيه."
			},
			k: {
				name: "k",
				detail: "مطلوب. الموضع (من الأكبر) في الصفيف أو نطاق الخلايا للبيانات التي سيتم إرجاعها."
			}
		}
	},
	LINEST: {
		description: "تقوم الدالة LINEST بحساب الإحصاءات لخط باستخدام طريقة \"المربعات الصغرى\" لحساب خط مستقيم يناسب بياناتك بالشكل الأمثل، ثم تُرجع صفيفاً يصف الخط. يمكنك أيضاً دمج LINEST مع الدالات الأخرى لحساب إحصاءات أنواع أخرى من النماذج الخطية في المعلمات غير المعروفة، بما في ذلك المتسلسلة المتعددة الحدود، واللوغاريتمية، والأسية. ولأن هذه الدالة تقوم بإرجاع صفيف قيم، يجب إدخالها كصيغة صفيف. وتأتي الإرشادات بعد الأمثلة في هذا المقال.",
		abstract: "تقوم الدالة LINEST بحساب الإحصاءات لخط باستخدام طريقة \"المربعات الصغرى\" لحساب خط مستقيم يناسب بياناتك بالشكل الأمثل، ثم تُرجع صفيفاً يصف الخط. يمكنك أيضاً دمج LINEST مع الدالات الأخرى لحساب إحصاءات أنواع أخرى من النماذج الخطية في المعلمات غير المعروفة، بما في ذلك المتسلسلة المتعددة الحدود، واللوغاريتمية، والأسية. ولأن هذه الدالة تقوم بإرجاع صفيف قيم، يجب إدخالها كصيغة صفيف. وتأتي الإرشادات بعد الأمثلة في هذا المقال.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/linest-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مطلوب. مجموعة قيم y التي تعرفها مسبقاً في العلاقة y = mx + b. إذا كان نطاق known_y في عمود واحد، يتم تفسير كل عمود من known_x على أنه متغير منفصل. إذا كان نطاق known_y مضمنا في صف واحد، يتم تفسير كل صف من known_x كمتغير منفصل."
			},
			knownXs: {
				name: "known_x's",
				detail: "الاختياري. مجموعة قيم x التي تعرفها مسبقاً في العلاقة y = mx + b. يمكن أن يتضمن نطاق known_x مجموعة واحدة أو أكثر من المتغيرات. إذا تم استخدام متغير واحد فقط، يمكن أن تكون known_y known_x نطاقات من أي شكل، طالما أن لها أبعادا متساوية. إذا تم استخدام أكثر من متغير واحد، يجب أن يكون known_y متجها (أي نطاق بارتفاع صف واحد أو عرض عمود واحد). إذا تم حذف known_x ، فمن المفترض أن يكون الصفيف {1,2,3,...} الذي هو نفس حجم known_y ."
			},
			constb: {
				name: "const",
				detail: "الاختياري. قيمة منطقية تحدد ما إذا كان سيتم فرض الثابت b ليساوي 0. إذا كان const TRUE أو تم حذفه، يتم حساب b بشكل طبيعي. إذا كان const هو FALSE، يتم تعيين b يساوي 0 ويتم ضبط قيم m لتناسب y = mx."
			},
			stats: {
				name: "stats",
				detail: "الاختياري. قيمة منطقية تحدد ما إذا كان سيتم إرجاع إحصاءات انحدار إضافية. إذا كانت الإحصائيات TRUE، فترجع الدالة LINEST إحصائيات الانحدار الإضافية؛ نتيجة لذلك، الصفيف الذي تم إرجاعه هو {mn,mn-1,...,m1,b; sen,sen-1,...,se1,seb; r 2,sey ; F,df; ssreg,ssresid} . إذا كانت الإحصائيات FALSE أو تم حذفها، فترجع LINEST معاملات m فقط والثابت b. تكون إحصاءات الانحدار الإضافية كما يلي."
			}
		}
	},
	LOGEST: {
		description: "إن معادلة المنحنى هي:",
		abstract: "إن معادلة المنحنى هي:",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/logest-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مطلوب. مجموعة قيم y التي تعرفها بالفعل في العلاقة y = b*m^x. إذا كان صفيف قيم known_y's موجوداً في عمود مفرد، فيتم عندئذٍ تفسير كل عمود من قيم known_x's كمتغير منفصل. إذا كان صفيف قيم known_y's موجوداً في صف مفرد، فيتم عندئذٍ تفسير كل صف من قيم known_x's كمتغير منفصل."
			},
			knownXs: {
				name: "known_x's",
				detail: "الاختياري. مجموعة اختيارية من قيم س التي تعرفها بالفعل في العلاقة y = b*m^x. يمكن لصفيف قيم known_x's أن يتضمّن مجموعة أو أكثر من المتغيرات. إذا تم استخدام متغير واحد فقط، فيمكن لقيم known_y's وknown_x's أن تكون نطاقات من أي شكل، طالما أنها ذات أبعاد متساوية. إذا تم استخدام أكثر من متغير واحد، فيجب أن تكون قيم known_y's عبارة عن نطاق خلايا بارتفاع صف واحد أو بعرض عمود واحد (يُعرف أيضاً بالمتجه). إذا تم حذف قيم known_x's، فسيتم افتراض أنها الصفيف {...,1,2,3} بالحجم نفسه لقيم known_y's."
			},
			constb: {
				name: "const",
				detail: "الاختياري. قيمة منطقية تحدد ما إذا كان سيتم فرض الثابت b ليساوي 1. إذا كانت قيمة const تساوي TRUE أو إذا تم حذفها، فيتم حساب b بالشكل المعتاد. إذا كانت قيمة const تساوي FALSE، فيتم تعيين b ليساوي 1، وتتم ملاءمة m للحصول على y = m^x."
			},
			stats: {
				name: "stats",
				detail: "الاختياري. قيمة منطقية تحدد ما إذا كان سيتم إرجاع إحصاءات انحدار إضافية. إذا كانت قيمة stats تساوي TRUE، فتُرجع LOGEST إحصاءات الانحدار، ونتيجة لذلك، يتم إرجاع الصفيف التالي {mn,mn-1,...,m1,b;sen,sen-1,...,se1,seb;r 2,sey; F,df;ssreg,ssresid}. إذا كانت قيمة stats تساوي FALSE أو إذا كانت محذوفة، فتُرجع LOGEST معاملات m والثابت b فقط."
			}
		}
	},
	LOGNORM_DIST: {
		description: "استخدم هذه الدالة لتحليل البيانات التي تم تحويلها لوغاريتمياً.",
		abstract: "استخدم هذه الدالة لتحليل البيانات التي تم تحويلها لوغاريتمياً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/lognorm-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. وسط (ln(x."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري لـ (ln(x."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع الدالة LOGNORM.DIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها تساوي FALSE، فتُرجع دالة كثافة الاحتمال."
			}
		}
	},
	LOGNORM_INV: {
		description: "تُرجع هذه الدالة عكس التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع (ln(x بشكل طبيعي باستخدام المعلمتين Mean وStandard_dev. إذا كانت p = LOGNORM.DIST(x,...)‎، فتكون عندئذٍ LOGNORM.INV(p,...) = x.",
		abstract: "تُرجع هذه الدالة عكس التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع (ln(x بشكل طبيعي باستخدام المعلمتين Mean وStandard_dev. إذا كانت p = LOGNORM.DIST(x,...)‎، فتكون عندئذٍ LOGNORM.INV(p,...) = x.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/lognorm-inv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المقترن بالتوزيع اللوغاريتمي الطبيعي."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. وسط (ln(x."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. الانحراف المعياري لـ (ln(x."
			}
		}
	},
	MARGINOFERROR: {
		description: "تحسب هذه الدالة هامش الخطأ من نطاق قيم ومستوى ثقة.",
		abstract: "تحسب هذه الدالة هامش الخطأ من نطاق قيم ومستوى ثقة.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/12487850?hl=ar"
		}],
		functionParameter: {
			range: {
				name: "range",
				detail: "نطاق القيم المستخدم لحساب هامش الخطأ."
			},
			confidence: {
				name: "confidence",
				detail: "مستوى الثقة المطلوب بين (0 و1)."
			}
		}
	},
	MAX: {
		description: "ترجع أكبر قيمة في مجموعة قيم.",
		abstract: "ترجع أكبر قيمة في مجموعة قيم.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/max-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "الرقم الأول أو مرجع الخلية أو النطاق الذي تريد حساب القيمة العظمى منه."
			},
			number2: {
				name: "number2",
				detail: "أرقام أو مراجع خلايا أو نطاقات إضافية لحساب القيمة العظمى منها، بحد أقصى 255."
			}
		}
	},
	MAXA: {
		description: "ترجع أكبر قيمة في قائمة من الوسيطات، بما في ذلك الأرقام والنصوص والقيم المنطقية.",
		abstract: "ترجع أكبر قيمة في قائمة من الوسيطات، بما في ذلك الأرقام والنصوص والقيم المنطقية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/maxa-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "وسيطة الرقم الأولى التي تريد إيجاد أكبر قيمة لها."
			},
			value2: {
				name: "value2",
				detail: "وسيطات الأرقام من 2 إلى 255 التي تريد إيجاد أكبر قيمة لها."
			}
		}
	},
	MAXIFS: {
		description: "ترجع دالة MAXIFS قيمة الحد الأقصى لخلايا محددة بمجموعة معينة من الشروط أو المعايير.",
		abstract: "ترجع دالة MAXIFS قيمة الحد الأقصى لخلايا محددة بمجموعة معينة من الشروط أو المعايير.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/maxifs-function"
		}],
		functionParameter: {
			maxRange: {
				name: "sum_range",
				detail: "هي نطاق الخلايا الفعلي الذي يتم تحديد الحد الأقصى فيه."
			},
			criteriaRange1: {
				name: "criteria_range1",
				detail: "هي مجموعة الخلايا المطلوب تقييمها باستخدام المعايير."
			},
			criteria1: {
				name: "criteria1",
				detail: "هي معايير بصيغة أرقام أو تعبيرات أو نصوص تحدد الخلايا التي سيتم تقييمها كحد أقصى. تعمل مجموعة المعايير نفسها مع الدالات MINIFS و SUMIFS و AVERAGEIFS ."
			},
			criteriaRange2: {
				name: "criteriaRange2",
				detail: "هي النطاقات الإضافية والمعايير المقترنة بها. يمكنك إدخال ما يصل إلى 126 زوجاً من النطاقات/المعايير."
			},
			criteria2: {
				name: "criteria2",
				detail: "هي النطاقات الإضافية والمعايير المقترنة بها. يمكنك إدخال ما يصل إلى 126 زوجاً من النطاقات/المعايير."
			}
		}
	},
	MEDIAN: {
		description: "تُرجع هذه الدالة وسيط الأرقام المحددة. إن الوسيط هو الرقم الذي يتوسط مجموعة من الأرقام.",
		abstract: "تُرجع هذه الدالة وسيط الأرقام المحددة. إن الوسيط هو الرقم الذي يتوسط مجموعة من الأرقام.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/median-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الأرقام من 1 إلى 255 التي تريد حساب الوسيط الخاص بها."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الأرقام من 1 إلى 255 التي تريد حساب الوسيط الخاص بها."
			}
		}
	},
	MIN: {
		description: "تُرجع هذه الدالة أصغر رقم في مجموعة من القيم.",
		abstract: "تُرجع هذه الدالة أصغر رقم في مجموعة من القيم.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/min-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 اختياري، والأرقام اللاحقة اختيارية. الأرقام من 1 إلى 255 التي تريد البحث عن القيمة الدنيا لها."
			},
			number2: {
				name: "number2",
				detail: "Number1 اختياري، والأرقام اللاحقة اختيارية. الأرقام من 1 إلى 255 التي تريد البحث عن القيمة الدنيا لها."
			}
		}
	},
	MINA: {
		description: "ترجع أصغر قيمة في قائمة من الوسيطات، بما في ذلك الأرقام والنصوص والقيم المنطقية.",
		abstract: "ترجع أصغر قيمة في قائمة من الوسيطات، بما في ذلك الأرقام والنصوص والقيم المنطقية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mina-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "الرقم الأول أو مرجع الخلية أو النطاق الذي تريد حساب القيمة الصغرى منه."
			},
			value2: {
				name: "value2",
				detail: "أرقام أو مراجع خلايا أو نطاقات إضافية لحساب القيمة الصغرى منها، بحد أقصى 255."
			}
		}
	},
	MINIFS: {
		description: "ترجع دالة MINIFS قيمة الحد الأدنى لخلايا محددة بمجموعة معينة من الشروط أو المعايير.",
		abstract: "ترجع دالة MINIFS قيمة الحد الأدنى لخلايا محددة بمجموعة معينة من الشروط أو المعايير.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/minifs-function"
		}],
		functionParameter: {
			minRange: {
				name: "min_range",
				detail: "هي نطاق الخلايا الفعلي الذي يتحدد فيه الحد الأدنى للقيمة."
			},
			criteriaRange1: {
				name: "criteria_range1",
				detail: "هي مجموعة الخلايا المطلوب تقييمها باستخدام المعايير."
			},
			criteria1: {
				name: "criteria1",
				detail: "هي معايير بصيغة أرقام أو تعبيرات أو نصوص تحدد الخلايا التي سيتم تقييمها كحد أدنى. تعمل مجموعة المعايير نفسها مع الدالات MAXIFS و SUMIFS و AVERAGEIFS ."
			},
			criteriaRange2: {
				name: "criteria_range2",
				detail: "هي النطاقات الإضافية والمعايير المقترنة بها. يمكنك إدخال ما يصل إلى 126 زوجاً من النطاقات/المعايير."
			},
			criteria2: {
				name: "criteria2",
				detail: "هي النطاقات الإضافية والمعايير المقترنة بها. يمكنك إدخال ما يصل إلى 126 زوجاً من النطاقات/المعايير."
			}
		}
	},
	MODE_MULT: {
		description: "سيؤدي ذلك إلى إرجاع أكثر من نتيجة في حالة وجود أوضاع متعددة. ولأن هذه الدالة تقوم بإرجاع صفيف قيم، يجب إدخالها كصيغة صفيف.",
		abstract: "سيؤدي ذلك إلى إرجاع أكثر من نتيجة في حالة وجود أوضاع متعددة. ولأن هذه الدالة تقوم بإرجاع صفيف قيم، يجب إدخالها كصيغة صفيف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mode-mult-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول الذي تريد حساب الوضع الخاص به."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 254 التي تريد حساب الوضع الخاص بها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	MODE_SNGL: {
		description: "تُرجع هذه الدالة القيم الأكثر حدوثاً أو تكراراً، في صفيف أو نطاق من البيانات.",
		abstract: "تُرجع هذه الدالة القيم الأكثر حدوثاً أو تكراراً، في صفيف أو نطاق من البيانات.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mode-sngl-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. الوسيطة الأولى التي تريد حساب الوضع الخاص بها."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. الوسيطات من 2 إلى 254 التي تريد حساب الوضع الخاص بها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	NEGBINOM_DIST: {
		description: "تُرجع هذه الدالة التوزيع السالب ذا الحدين، واحتمال وجود مرات فشل عددها number_f قبل النجاح رقم number_s، مع احتمال probability_s للنجاح.",
		abstract: "تُرجع هذه الدالة التوزيع السالب ذا الحدين، واحتمال وجود مرات فشل عددها number_f قبل النجاح رقم number_s، مع احتمال probability_s للنجاح.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/negbinom-dist-function"
		}],
		functionParameter: {
			numberF: {
				name: "number_f",
				detail: "مطلوب. عدد مرات الفشل."
			},
			numberS: {
				name: "number_s",
				detail: "مطلوب. عتبة محاولات النجاح."
			},
			probabilityS: {
				name: "probability_s",
				detail: "مطلوب. احتمال النجاح."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فإن الدالة NEGBINOM.DIST ترجع دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فإنها ترجع دالة كثافة الاحتمال."
			}
		}
	},
	NORM_DIST: {
		description: "تُرجع هذه الدالة التوزيع العادي للوسط والانحراف المعياري المحددين. لهذه الدالة تطبيقات واسعة النطاق في علم الإحصاء، بما في ذلك اختبار الفرضية.",
		abstract: "تُرجع هذه الدالة التوزيع العادي للوسط والانحراف المعياري المحددين. لهذه الدالة تطبيقات واسعة النطاق في علم الإحصاء، بما في ذلك اختبار الفرضية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/norm-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي تريد حساب التوزيع لها."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. الوسط الحسابي للتوزيع."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. وهي الانحراف المعياري للتوزيع."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت القيمة التراكمية TRUE، NORM. ترجع الدالة DIST دالة التوزيع التراكمي؛ إذا كانت FALSE، فإنها ترجع دالة كثافة الاحتمال."
			}
		}
	},
	NORM_INV: {
		description: "تُرجع هذه الدالة عكس التوزيع التراكمي العادي للوسط والانحراف المعياري المحددين.",
		abstract: "تُرجع هذه الدالة عكس التوزيع التراكمي العادي للوسط والانحراف المعياري المحددين.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/norm-inv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المطابق للتوزيع العادي."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. الوسط الحسابي للتوزيع."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. وهي الانحراف المعياري للتوزيع."
			}
		}
	},
	NORM_S_DIST: {
		description: "The NORM. ترجع الدالة S.DIST في Excel التوزيع العادي القياسي ( على سبيل المثال، يحتوي على وسط صفر وانحراف معياري لأحدها ). يمكنك استخدام هذه الدالة بدلا من استخدام جدول مناطق المنحنى العادية القياسية.",
		abstract: "The NORM. ترجع الدالة S.DIST في Excel التوزيع العادي القياسي ( على سبيل المثال، يحتوي على وسط صفر وانحراف معياري لأحدها ). يمكنك استخدام هذه الدالة بدلا من استخدام جدول مناطق المنحنى العادية القياسية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/norm-s-dist-function"
		}],
		functionParameter: {
			z: {
				name: "z",
				detail: "مطلوبة. هذه هي القيمة التي تريد التوزيع لها."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. يمكن أن تكون الوسيطة التراكمية إما TRUE أو FALSE . تحدد هذه القيمة المنطقية شكل الدالة. إذا كانت القيمة التراكمية TRUE، فإن NORM. يقوم S.DIST بإرجاع دالة التوزيع التراكمي . إذا كان FALSE، فإنه يرجع دالة الاحتمالات الجماعية ."
			}
		}
	},
	NORM_S_INV: {
		description: "تُرجع هذه الدالة عكس التوزيع التراكمي القياسي العادي. يحتوي التوزيع على وسط من صفر وانحراف معياري من واحد.",
		abstract: "تُرجع هذه الدالة عكس التوزيع التراكمي القياسي العادي. يحتوي التوزيع على وسط من صفر وانحراف معياري من واحد.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/norm-s-inv-function"
		}],
		functionParameter: { probability: {
			name: "probability",
			detail: "مطلوب. الاحتمال المطابق للتوزيع العادي."
		} }
	},
	PEARSON: {
		description: "تُرجع هذه الدالة معامل Pearson للارتباط العزومي لحواصل الضرب، r، وهو فهرس غير بعدي يتراوح بين ‎-1.0 و1.0 ضمناً، ويعكس نطاق العلاقة الخطية بين مجموعتين من مجموعات البيانات.",
		abstract: "تُرجع هذه الدالة معامل Pearson للارتباط العزومي لحواصل الضرب، r، وهو فهرس غير بعدي يتراوح بين ‎-1.0 و1.0 ضمناً، ويعكس نطاق العلاقة الخطية بين مجموعتين من مجموعات البيانات.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/pearson-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. مجموعة من القيم المستقلة."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. مجموعة من القيم التابعة."
			}
		}
	},
	PERCENTILE_EXC: {
		description: "ترجع المئين k لقيم مجموعة بيانات (باستثناء 0 و1).",
		abstract: "ترجع المئين k لقيم مجموعة بيانات (باستثناء 0 و1).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/percentile-exc-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف أو نطاق البيانات الذي يحدد الترتيب النسبي."
			},
			k: {
				name: "k",
				detail: "قيمة المئين في النطاق من 0 إلى 1، باستثناء 0 و1."
			}
		}
	},
	PERCENTILE_INC: {
		description: "يمكنك استخدام PERCENTILE. دالة INC لتحديد حد القبول. على سبيل المثال، يمكنك أن تتخذ قراراً باختبار المرشحين الذين سجلوا مجموع نقاط أعلى من القيمة المئوية 90.",
		abstract: "يمكنك استخدام PERCENTILE. دالة INC لتحديد حد القبول. على سبيل المثال، يمكنك أن تتخذ قراراً باختبار المرشحين الذين سجلوا مجموع نقاط أعلى من القيمة المئوية 90.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/percentile-inc-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق البيانات الذي يعرِّف حالات النسبية."
			},
			k: {
				name: "k",
				detail: "مطلوب. القيمة المئوية في النطاق من 0 إلى 1، شاملة."
			}
		}
	},
	PERCENTRANK_EXC: {
		description: "ترجع الرتبة المئوية لقيمة في مجموعة بيانات (باستثناء 0 و1).",
		abstract: "ترجع الرتبة المئوية لقيمة في مجموعة بيانات (باستثناء 0 و1).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/percentrank-exc-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "الصفيف أو نطاق البيانات الذي يحدد الترتيب النسبي."
			},
			x: {
				name: "x",
				detail: "القيمة التي تريد معرفة رتبتها."
			},
			significance: {
				name: "significance",
				detail: "قيمة تحدد عدد الأرقام المهمة لقيمة النسبة المئوية المعادة. إذا حُذفت، تستخدم PERCENTRANK.EXC ثلاثة أرقام (0.xxx)."
			}
		}
	},
	PERCENTRANK_INC: {
		description: "تُرجع هذه الدالة مرتبة إحدى القيم في مجموعة بيانات كنسبة مئوية (0..1 ضمناً) من مجموعة البيانات.",
		abstract: "تُرجع هذه الدالة مرتبة إحدى القيم في مجموعة بيانات كنسبة مئوية (0..1 ضمناً) من مجموعة البيانات.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/percentrank-inc-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق البيانات الذي يحتوي على القيم الرقمية التي تعرِّف الحالة النسبية."
			},
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي تريد معرفة مرتبتها."
			},
			significance: {
				name: "significance",
				detail: "الاختياري. قيمة اختيارية تعرّف عدد الأرقام ذات الأهمية لقيمة النسبة المئوية التي تم إرجاعها. في حال حذف هذه القيمة، تستخدم الدالة PERCENTRANK.INC ثلاثة أرقام (0.xxx)."
			}
		}
	},
	PERMUT: {
		description: "ترجع عدد التباديل لعدد معين من الكائنات.",
		abstract: "ترجع عدد التباديل لعدد معين من الكائنات.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/permut-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "عدد العناصر."
			},
			numberChosen: {
				name: "number_chosen",
				detail: "عدد العناصر في كل تبديل."
			}
		}
	},
	PERMUTATIONA: {
		description: "ترجع عدد التباديل لعدد معين من الكائنات، مع التكرار، التي يمكن اختيارها من إجمالي الكائنات.",
		abstract: "ترجع عدد التباديل لعدد معين من الكائنات، مع التكرار، التي يمكن اختيارها من إجمالي الكائنات.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/permutationa-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "عدد العناصر."
			},
			numberChosen: {
				name: "number_chosen",
				detail: "عدد العناصر في كل تبديل."
			}
		}
	},
	PHI: {
		description: "تُرجع هذه الدالة قيمة دالة كثافة التوزيع القياسي العادي.",
		abstract: "تُرجع هذه الدالة قيمة دالة كثافة التوزيع القياسي العادي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/phi-function"
		}],
		functionParameter: { x: {
			name: "x",
			detail: "مطلوبة. X هو الرقم الذي تريد كثافة التوزيع العادي القياسي له."
		} }
	},
	POISSON_DIST: {
		description: "تُرجع هذه الدالة توزيع Poisson. يُعتبر التنبؤ بعدد الأحداث خلال فترة زمنية محددة أحد التطبيقات الشائعة لتوزيع Poisson، كالتنبؤ بعدد السيارات التي تصل إلى ساحة تفرض رسم مرور خلال دقيقة واحدة مثلاً.",
		abstract: "تُرجع هذه الدالة توزيع Poisson. يُعتبر التنبؤ بعدد الأحداث خلال فترة زمنية محددة أحد التطبيقات الشائعة لتوزيع Poisson، كالتنبؤ بعدد السيارات التي تصل إلى ساحة تفرض رسم مرور خلال دقيقة واحدة مثلاً.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/poisson-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. عدد الأحداث."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. القيمة الرقمية المتوقعة."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد نموذج توزيع الاحتمال الذي يتم إرجاعه. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فإن الدالة POISSON.DIST ترجع احتمال Poisson التراكمي حيث سيكون عدد الأحداث العشوائية التي تحصل ما بين صفر وx ضمناً؛ وإذا كانت قيمتها FALSE، فإن الدالة Poisson للاحتمالات غير التراكمية ترجع أن عدد الأحداث سيساوي x تماماً."
			}
		}
	},
	PROB: {
		description: "تُرجع هذه الدالة احتمال وقوع القيم في نطاق بين حدين. إذا لم يتم توفير الوسيطة upper_limit، فتُرجع هذه الدالة احتمال أن تكون القيم في x_range مساوية للقيم في lower_limit.",
		abstract: "تُرجع هذه الدالة احتمال وقوع القيم في نطاق بين حدين. إذا لم يتم توفير الوسيطة upper_limit، فتُرجع هذه الدالة احتمال أن تكون القيم في x_range مساوية للقيم في lower_limit.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/prob-function"
		}],
		functionParameter: {
			xRange: {
				name: "x_range",
				detail: "مطلوب. نطاق قيم x الرقمية التي تقترن بها احتمالات."
			},
			probRange: {
				name: "prob_range",
				detail: "مطلوب. مجموعة احتمالات مقترنة بالقيم في x_range."
			},
			lowerLimit: {
				name: "lower_limit",
				detail: "الاختياري. الحد الأدنى للقيمة التي تريد حساب احتمالها."
			},
			upperLimit: {
				name: "upper_limit",
				detail: "الاختياري. الحد الأعلى الاختياري للقيمة التي تريد حساب احتمالها."
			}
		}
	},
	QUARTILE_EXC: {
		description: "إرجاع ربع مجموعة البيانات، استنادا إلى القيم المئوية من 0 إلى 1، حصريا.",
		abstract: "إرجاع ربع مجموعة البيانات، استنادا إلى القيم المئوية من 0 إلى 1، حصريا.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/quartile-exc-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق خلايا القيم الرقمية الذي تريد حساب قيمته الربعية."
			},
			quart: {
				name: "quart",
				detail: "مطلوب. تشير إلى القيمة التي يجب إرجاعها."
			}
		}
	},
	QUARTILE_INC: {
		description: "غالباً ما يتم استخدام الأرباع في المبيعات وبيانات الاستطلاعات لتقسيم السكان إلى مجموعات. على سبيل المثال، يمكنك استخدام QUARTILE.INC للبحث عن 25 بالمائة من السكان من ذوي نسبة الدخل الأعلى.",
		abstract: "غالباً ما يتم استخدام الأرباع في المبيعات وبيانات الاستطلاعات لتقسيم السكان إلى مجموعات. على سبيل المثال، يمكنك استخدام QUARTILE.INC للبحث عن 25 بالمائة من السكان من ذوي نسبة الدخل الأعلى.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/quartile-inc-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق خلايا القيم الرقمية الذي تريد حساب قيمته الربعية."
			},
			quart: {
				name: "quart",
				detail: "مطلوب. تشير إلى القيمة التي يجب إرجاعها."
			}
		}
	},
	RANK_AVG: {
		description: "إرجاع ترتيب رقم في قائمة أرقام: حجمه بالنسبة إلى القيم الأخرى في القائمة. إذا كانت أكثر من قيمة واحدة لها نفس الترتيب، يتم إرجاع متوسط الرتبة.",
		abstract: "إرجاع ترتيب رقم في قائمة أرقام: حجمه بالنسبة إلى القيم الأخرى في القائمة. إذا كانت أكثر من قيمة واحدة لها نفس الترتيب، يتم إرجاع متوسط الرتبة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rank-avg-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الذي تريد العثور على مرتبته."
			},
			ref: {
				name: "ref",
				detail: "مطلوب. صفيف من قائمة أرقام أو مرجع إليها. يتم تجاهل القيم غير الرقمية في الوسيطة Ref."
			},
			order: {
				name: "order",
				detail: "الاختياري. رقم يحدد كيفية ترتيب الرقم."
			}
		}
	},
	RANK_EQ: {
		description: "تُرجع هذه الدالة مرتبة رقم في قائمة من الأرقام. تمثّل مرتبة الرقم حجمه بالنسبة إلى أحجام القيم الأخرى في القائمة؛ عند وجود أكثر من قيمة تحمل المرتبة نفسها، يتم إرجاع متوسط المرتبة.",
		abstract: "تُرجع هذه الدالة مرتبة رقم في قائمة من الأرقام. تمثّل مرتبة الرقم حجمه بالنسبة إلى أحجام القيم الأخرى في القائمة؛ عند وجود أكثر من قيمة تحمل المرتبة نفسها، يتم إرجاع متوسط المرتبة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rank-eq-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الذي تريد العثور على مرتبته."
			},
			ref: {
				name: "ref",
				detail: "مطلوب. صفيف من قائمة أرقام أو مرجع إليها. يتم تجاهل القيم غير الرقمية في المرجع."
			},
			order: {
				name: "order",
				detail: "الاختياري. رقم يحدد كيفية ترتيب الرقم."
			}
		}
	},
	RSQ: {
		description: "تُرجع مربع معامل الارتباط العزومي لحواصل الضرب من خلال نقاط البيانات في known_y's وknown_x's. للحصول على مزيد من المعلومات، انظر الدالة PEARSON‏ . يمكن تفسير قيمة الجذر التربيعي كمعدل التباين في قيم y بالنسبة للتباين في قيم x.",
		abstract: "تُرجع مربع معامل الارتباط العزومي لحواصل الضرب من خلال نقاط البيانات في known_y's وknown_x's. للحصول على مزيد من المعلومات، انظر الدالة PEARSON‏ . يمكن تفسير قيمة الجذر التربيعي كمعدل التباين في قيم y بالنسبة للتباين في قيم x.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rsq-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مطلوب. صفيف أو نطاق خلايا لنقاط بيانات رقمية تابعة."
			},
			knownXs: {
				name: "known_x's",
				detail: "مطلوب. مجموعة نقاط البيانات المستقلة."
			}
		}
	},
	SKEW: {
		description: "تُرجع هذه الدالة تخالف التوزيع. يصف التخالف درجة اللاتماثل لتوزيع حول وسطه. يشير التخالف الموجب إلى توزيع مع طرف غير متماثل يمتد باتجاه المزيد من القيم الموجبة. ويشير التخالف السالب إلى توزيع مع طرف غير متماثل يمتد باتجاه المزيد من القيم السالبة.",
		abstract: "تُرجع هذه الدالة تخالف التوزيع. يصف التخالف درجة اللاتماثل لتوزيع حول وسطه. يشير التخالف الموجب إلى توزيع مع طرف غير متماثل يمتد باتجاه المزيد من القيم الموجبة. ويشير التخالف السالب إلى توزيع مع طرف غير متماثل يمتد باتجاه المزيد من القيم السالبة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/skew-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي تريد احتساب التخالف لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			number2: {
				name: "number2",
				detail: "Number1 مطلوب، والأرقام اللاحقة اختيارية. الوسيطات من 1 إلى 255 التي تريد احتساب التخالف لها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	SKEW_P: {
		description: "تُرجع هذه الدالة تخالف توزيع استناداً إلى محتوى: وصف لدرجة اللا تماثل لتوزيع حول وسطه.",
		abstract: "تُرجع هذه الدالة تخالف توزيع استناداً إلى محتوى: وصف لدرجة اللا تماثل لتوزيع حول وسطه.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/skew-p-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "الرقم الأول أو مرجع الخلية أو النطاق الذي تريد حساب الالتواء له."
			},
			number2: {
				name: "number2",
				detail: "أرقام أو مراجع خلايا أو نطاقات إضافية تريد حساب الالتواء لها، بحد أقصى 255."
			}
		}
	},
	SLOPE: {
		description: "تُرجع هذه الدالة ميل الانحدار الخطي عبر نقاط البيانات في known_y's وknown_x's. الميل هو المسافة العمودية المقسومة على المسافة الأفقية بين أي نقطتين على الخط، وهو معدل التغيير على طول الانحدار الخطي.",
		abstract: "تُرجع هذه الدالة ميل الانحدار الخطي عبر نقاط البيانات في known_y's وknown_x's. الميل هو المسافة العمودية المقسومة على المسافة الأفقية بين أي نقطتين على الخط، وهو معدل التغيير على طول الانحدار الخطي.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/slope-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مطلوب. صفيف أو نطاق خلايا لنقاط بيانات رقمية تابعة."
			},
			knownXs: {
				name: "known_x's",
				detail: "مطلوب. مجموعة نقاط البيانات المستقلة."
			}
		}
	},
	SMALL: {
		description: "تُرجع هذه الدالة أصغر قيمة من القيم بالموضع K في مجموعة بيانات. استخدم هذه الدالة لإرجاع القيم بواسطة حالة نسبية محددة في مجموعة البيانات.",
		abstract: "تُرجع هذه الدالة أصغر قيمة من القيم بالموضع K في مجموعة بيانات. استخدم هذه الدالة لإرجاع القيم بواسطة حالة نسبية محددة في مجموعة البيانات.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/small-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. صفيف أو نطاق بيانات رقمية تريد تحديد قيمته الصغرى بالموضع K."
			},
			k: {
				name: "k",
				detail: "مطلوب. الموضع (من الأصغر) في الصفيف أو نطاق البيانات الذي يجب إرجاعه."
			}
		}
	},
	STANDARDIZE: {
		description: "تُرجع هذه الدالة قيمة مسوّاة من توزيع يتميّز بالوسط والانحراف المعياري.",
		abstract: "تُرجع هذه الدالة قيمة مسوّاة من توزيع يتميّز بالوسط والانحراف المعياري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/standardize-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. وهي القيمة التي تريد تسويتها."
			},
			mean: {
				name: "mean",
				detail: "مطلوب. الوسط الحسابي للتوزيع."
			},
			standardDev: {
				name: "standard_dev",
				detail: "مطلوب. وهي الانحراف المعياري للتوزيع."
			}
		}
	},
	STDEV_P: {
		description: "إن الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		abstract: "إن الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/stdev-p-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق المحتوى."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 254 التي تطابق عينة من المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	STDEV_S: {
		description: "الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		abstract: "الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/stdev-s-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق عينة من المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 254 التي تطابق عينة من المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	STDEVA: {
		description: "تقدّر هذه الدالة الانحراف المعياري استناداً إلى عينة. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		abstract: "تقدّر هذه الدالة الانحراف المعياري استناداً إلى عينة. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/stdeva-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. القيم من 1 إلى 255 التي تطابق عينة من المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			value2: {
				name: "value2",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. القيم من 1 إلى 255 التي تطابق عينة من المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	STDEVPA: {
		description: "تحسب هذه الدالة الانحراف المعياري استناداً إلى المحتوى بأكمله المحدد كوسيطات، بما في ذلك النص والقيم المنطقية. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		abstract: "تحسب هذه الدالة الانحراف المعياري استناداً إلى المحتوى بأكمله المحدد كوسيطات، بما في ذلك النص والقيم المنطقية. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/stdevpa-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. القيم من 1 إلى 255 التي تطابق المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			},
			value2: {
				name: "value2",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. القيم من 1 إلى 255 التي تطابق المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل."
			}
		}
	},
	STEYX: {
		description: "تُرجع هذه الدالة الخطأ القياسي لقيمة y المتوقعة لكل قيمة x في خط الانحدار. الخطأ القياسي عبارة عن مقياس لمقدار الخطأ في توقع قيمة y لقيمة x فردية.",
		abstract: "تُرجع هذه الدالة الخطأ القياسي لقيمة y المتوقعة لكل قيمة x في خط الانحدار. الخطأ القياسي عبارة عن مقياس لمقدار الخطأ في توقع قيمة y لقيمة x فردية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/steyx-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مطلوب. صفيف أو نطاق نقاط بيانات تابعة."
			},
			knownXs: {
				name: "known_x's",
				detail: "مطلوب. صفيف أو نطاق نقاط بيانات مستقلة."
			}
		}
	},
	T_DIST: {
		description: "إرجاع توزيع t للطالب ذي الطرف الأيسر. يتم استخدام توزيع t في الاختبار الفرضي لمجموعات صغيرة من عينات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.",
		abstract: "إرجاع توزيع t للطالب ذي الطرف الأيسر. يتم استخدام توزيع t في الاختبار الفرضي لمجموعات صغيرة من عينات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/t-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة الرقمية التي يتم تقييم التوزيع عندها."
			},
			degFreedom: {
				name: "degFreedom",
				detail: "مطلوب. عدد صحيح يشير إلى عدد درجات الحرية."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع الدالة T.DIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال."
			}
		}
	},
	T_DIST_2T: {
		description: "ترجع احتمال توزيع t للطالب (ثنائي الطرف).",
		abstract: "ترجع احتمال توزيع t للطالب (ثنائي الطرف).",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/t-dist-2t-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "القيمة العددية التي تريد تقييم التوزيع عندها."
			},
			degFreedom: {
				name: "degFreedom",
				detail: "عدد صحيح يحدد عدد درجات الحرية."
			}
		}
	},
	T_DIST_RT: {
		description: "يتم استخدام توزيع t في الاختبار الفرضي لمجموعات صغيرة من عينات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.",
		abstract: "يتم استخدام توزيع t في الاختبار الفرضي لمجموعات صغيرة من عينات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/t-dist-rt-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة الرقمية التي يتم تقييم التوزيع عندها."
			},
			degFreedom: {
				name: "degFreedom",
				detail: "مطلوب. عدد صحيح يشير إلى عدد درجات الحرية."
			}
		}
	},
	T_INV: {
		description: "تُرجع هذه الدالة عكس توزيع t للطالب ذي الطرف الأيسر.",
		abstract: "تُرجع هذه الدالة عكس توزيع t للطالب ذي الطرف الأيسر.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/t-inv-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المقترن بتوزيع t للطالب."
			},
			degFreedom: {
				name: "degFreedom",
				detail: "مطلوب. عدد درجات الحرية التي تميز التوزيع."
			}
		}
	},
	T_INV_2T: {
		description: "إرجاع عكس توزيع t للطالب ثنائي الطرف.",
		abstract: "إرجاع عكس توزيع t للطالب ثنائي الطرف.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/t-inv-2t-function"
		}],
		functionParameter: {
			probability: {
				name: "probability",
				detail: "مطلوب. الاحتمال المقترن بتوزيع t للطالب."
			},
			degFreedom: {
				name: "degFreedom",
				detail: "مطلوب. عدد درجات الحرية التي تميز التوزيع."
			}
		}
	},
	T_TEST: {
		description: "تُرجع هذه الدالة الاحتمال المقترن باختبار t للطالب. استخدم T.TEST لتحديد ما إذا كان من المحتمل وجود عينتين من محتويين مماثلين أساسيين لهما الوسط نفسه.",
		abstract: "تُرجع هذه الدالة الاحتمال المقترن باختبار t للطالب. استخدم T.TEST لتحديد ما إذا كان من المحتمل وجود عينتين من محتويين مماثلين أساسيين لهما الوسط نفسه.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/t-test-function"
		}],
		functionParameter: {
			array1: {
				name: "array1",
				detail: "مطلوب. مجموعة البيانات الأولى."
			},
			array2: {
				name: "array2",
				detail: "مطلوب. مجموعة البيانات الثانية."
			},
			tails: {
				name: "tails",
				detail: "مطلوب. تحدد هذه الوسيطة عدد أطراف التوزيع. إذا كانت قيمة الأطراف = 1، فإن الدالة T.TEST تستخدم التوزيع وحيد الطرف. إذا كانت قيمة الأطراف = 2، فإن الدالة T.TEST تستخدم التوزيع ثنائي الطرف."
			},
			type: {
				name: "type",
				detail: "مطلوب. نوع اختبار t الذي يجب تأديته."
			}
		}
	},
	TREND: {
		description: "ترجع الدالة TREND القيم على طول اتجاه خطي. وهو يلائم خطا مستقيما (باستخدام أسلوب المربعات الأقل) مع known_y الصفيف known_x. ترجع الدالة TREND قيم y على طول هذا السطر لصفيف new_x الذي تحدده.",
		abstract: "ترجع الدالة TREND القيم على طول اتجاه خطي. وهو يلائم خطا مستقيما (باستخدام أسلوب المربعات الأقل) مع known_y الصفيف known_x. ترجع الدالة TREND قيم y على طول هذا السطر لصفيف new_x الذي تحدده.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/trend-function"
		}],
		functionParameter: {
			knownYs: {
				name: "known_y's",
				detail: "مجموعة قيم y التي تعرفها بالفعل في العلاقة y = mx + b إذا كان صفيف قيم known_y's موجوداً في عمود مفرد، فيتم عندئذٍ تفسير كل عمود من قيم known_x's كمتغير منفصل. إذا كان صفيف قيم known_y's موجوداً في صف مفرد، فيتم عندئذٍ تفسير كل صف من قيم known_x's كمتغير منفصل."
			},
			knownXs: {
				name: "known_x's",
				detail: "مجموعة اختيارية من قيم x التي قد تعرفها بالفعل في العلاقة y = mx + b يمكن لصفيف قيم known_x's أن يتضمّن مجموعة أو أكثر من المتغيرات. إذا تم استخدام متغير واحد فقط، فيمكن لقيم known_y's وknown_x's أن تكون نطاقات من أي شكل، طالما أنها ذات أبعاد متساوية. إذا تم استخدام أكثر من متغير واحد، فيجب أن تكون قيم known_y's عبارة عن خط متجه (أي، نطاق بارتفاع صف واحد أو بعرض عمود واحد). إذا تم تجاهل قيم known_x's، فسيتم افتراض أنها الصفيف {...,1,2,3} بالحجم نفسه لقيم known_y's."
			},
			newXs: {
				name: "new_x's",
				detail: "قيم x الجديدة التي تريد أن ترجع الدالة TREND قيم y المقابلة لها يجب أن تتضمن قيم New_x's عموداً (أو صفاً) لكل متغير مستقل، تماماً مثلما تفعل قيم known_x's. وبالتالي، إذا كانت قيم known_y's موجودة في عمود واحد، يجب أن يكون عدد الأعمدة في known_x's وnew_x's متساوياً. إذا كانت قيم known_y's موجودة في صف واحد، يجب أن يكون عدد الصفوف في known_x's وnew_x's متساوياً. إذا تم حذف قيم new_x's، فسيتم افتراض أنها مماثلة لقيم known_x's. إذا تم تجاهل كل من قيم known_x's وnew_x's، فسيتم افتراض أنها الصفيف {3،2،1،...} بالحجم نفسه لقيم known_y's."
			},
			constb: {
				name: "const",
				detail: "قيمة منطقية تحدد ما إذا كان يجب فرض الثابت b على يساوي 0 إذا كانت قيمة const تساوي TRUE أو إذا تم حذفها، يتم حساب b بالشكل المعتاد. إذا كانت قيمة const تساوي FALSE، يتم تعيين b ليساوي 0 (صفر) ويتم ضبط قيم m للحصول على y = mx."
			}
		}
	},
	TRIMMEAN: {
		description: "تُرجع هذه الدالة وسط الجزء الداخلي من مجموعة بيانات. تحسب TRIMMEAN الوسط المأخوذ باستبعاد نسبة مئوية من نقاط البيانات من أطراف عليا وسفلى من مجموعة بيانات. يمكنك استخدام هذه الدالة عندما تريد استبعاد بيانات بعيدة عن تحليلك الخاص.",
		abstract: "تُرجع هذه الدالة وسط الجزء الداخلي من مجموعة بيانات. تحسب TRIMMEAN الوسط المأخوذ باستبعاد نسبة مئوية من نقاط البيانات من أطراف عليا وسفلى من مجموعة بيانات. يمكنك استخدام هذه الدالة عندما تريد استبعاد بيانات بعيدة عن تحليلك الخاص.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/trimmean-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. نطاق أو صفيف من القيم تريد اقتطاعه ومعرفة معدله."
			},
			percent: {
				name: "percent",
				detail: "مطلوب. العدد الكسري لنقاط البيانات الذي يتم استبعاده من الحسابات. على سبيل المثال، إذا كانت قيمة وسيطة percent = 0.2، يتم اقتطاع 4 نقاط من مجموعة بيانات ذات 20 نقطة (20 × 0.2): 2 من أعلى المجموعة و2 من أسفلها."
			}
		}
	},
	VAR_P: {
		description: "تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله (تتجاهل القيم المنطقية والنص في المحتوى).",
		abstract: "تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله (تتجاهل القيم المنطقية والنص في المحتوى).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/var-p-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق المحتوى."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 254 التي تطابق عينة من المحتوى."
			}
		}
	},
	VAR_S: {
		description: "تقدّر هذه الدالة التباين استناداً إلى عينة (تتجاهل القيم المنطقية والنص في العينة).",
		abstract: "تقدّر هذه الدالة التباين استناداً إلى عينة (تتجاهل القيم المنطقية والنص في العينة).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/var-s-function"
		}],
		functionParameter: {
			number1: {
				name: "number1",
				detail: "مطلوب. وسيطة الرقم الأول التي تطابق عينة من المحتوى."
			},
			number2: {
				name: "number2",
				detail: "الاختياري. وسيطات الأرقام من 2 حتى 254 التي تطابق عينة من المحتوى."
			}
		}
	},
	VARA: {
		description: "تقوم هذه الدالة بتقدير التباين استناداً إلى عينة.",
		abstract: "تقوم هذه الدالة بتقدير التباين استناداً إلى عينة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/vara-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. وسيطات القيم من 1 حتى 255 التي تطابق عينة من المحتوى."
			},
			value2: {
				name: "value2",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. وسيطات القيم من 1 حتى 255 التي تطابق عينة من المحتوى."
			}
		}
	},
	VARPA: {
		description: "تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله.",
		abstract: "تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/varpa-function"
		}],
		functionParameter: {
			value1: {
				name: "value1",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. وسيطات القيم من 1 حتى 255 التي تطابق محتوى."
			},
			value2: {
				name: "value2",
				detail: "Value1 مطلوب، والقيم اللاحقة اختيارية. وسيطات القيم من 1 حتى 255 التي تطابق محتوى."
			}
		}
	},
	WEIBULL_DIST: {
		description: "تُرجع هذه الدالة توزيع Weibull. استخدم هذا التوزيع في تحليل ثبات النظام، كحساب متوسط وقت حدوث فشل في أحد الأجهزة.",
		abstract: "تُرجع هذه الدالة توزيع Weibull. استخدم هذا التوزيع في تحليل ثبات النظام، كحساب متوسط وقت حدوث فشل في أحد الأجهزة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/weibull-dist-function"
		}],
		functionParameter: {
			x: {
				name: "x",
				detail: "مطلوبة. القيمة التي يتم تقييم الدالة إليها."
			},
			alpha: {
				name: "alpha",
				detail: "مطلوب. معلمة للتوزيع."
			},
			beta: {
				name: "beta",
				detail: "مطلوب. معلمة للتوزيع."
			},
			cumulative: {
				name: "cumulative",
				detail: "مطلوب. تحدد هذه الوسيطة شكل الدالة."
			}
		}
	},
	Z_TEST: {
		description: "تُرجع قيمة الاحتمال أحادية الطرف لاختبار Z.",
		abstract: "تُرجع قيمة الاحتمال أحادية الطرف لاختبار Z.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/z-test-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "مطلوب. الصفيف أو نطاق البيانات لاختبار x بالمقابلة معه."
			},
			x: {
				name: "x",
				detail: "مطلوب. القيمة التي يجب اختبارها."
			},
			sigma: {
				name: "sigma",
				detail: "الاختياري. الانحراف المعياري للمحتوى (معروف). في حالة حذفها، يتم استخدام الانحراف المعياري للعينة."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/text/ar-SA.ts
const locale$3 = {
	ASC: {
		description: "بالنسبة للغات التي تتضمن مجموعة أحرف مزدوجة البايت (DBCS)، تقوم هذه الدالة بتغيير الأحرف ذات العرض الكامل (مزدوجة البايت) إلى أحرف ذات عرض نصفي (أحادية البايت).",
		abstract: "بالنسبة للغات التي تتضمن مجموعة أحرف مزدوجة البايت (DBCS)، تقوم هذه الدالة بتغيير الأحرف ذات العرض الكامل (مزدوجة البايت) إلى أحرف ذات عرض نصفي (أحادية البايت).",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/asc-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. وهي النص أو مرجع الخلية الذي يحتوي على النص المطلوب تغييره. لن يتم تغيير النص إذا لم يكن يحتوي على أي أحرف ذات عرض كامل."
		} }
	},
	ARRAYTOTEXT: {
		description: "ترجع الدالة ARRAYTOTEXT مصفوفة من القيم النصية من أي نطاق محدد. يمرر القيم النصية دون تغيير، ويحول القيم غير النصية إلى نص.",
		abstract: "ترجع الدالة ARRAYTOTEXT مصفوفة من القيم النصية من أي نطاق محدد. يمرر القيم النصية دون تغيير، ويحول القيم غير النصية إلى نص.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/arraytotext-function"
		}],
		functionParameter: {
			array: {
				name: "array",
				detail: "المصفوفة المراد إرجاعها كنص. مطلوبة."
			},
			format: {
				name: "format",
				detail: "تنسيق البيانات التي تم إرجاعها. اختيارية. يمكن أن تكون واحدة من قيمتين: 0 افتراضي. تنسيق مختصر يسهل قراءته. سيكون النص الذي يتم إرجاعه هو نفسه النص المعروض في خلية تم تطبيق التنسيق العام عليها. 1 تنسيق صارم يتضمن أحرف الإلغاء ومحددات الصفوف. يولد سلسلة يمكن تحليلها عند إدخالها في شريط الصيغة. لتضمين السلاسل التي تم إرجاعها في علامات الاقتباس باستثناء القيم المنطقية والأرقام والأخطاء."
			}
		}
	},
	BAHTTEXT: {
		description: "تحوّل رقماً إلى نص باللغة التايلاندية وتضيف اللاحقة \"باهت\".",
		abstract: "تحوّل رقماً إلى نص باللغة التايلاندية وتضيف اللاحقة \"باهت\".",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/bahttext-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. رقم تريد تحويله إلى نص، أو مرجع لخلية تحتوي على رقم، أو صيغة يتم تقييمها إلى رقم."
		} }
	},
	CHAR: {
		description: "تُرجع الحرف المحدد بواسطة رقم. استخدم CHAR لترجمة أرقام صفحات الترميز اللغوي التي قد تحصل عليها من ملفات موجودة على أنواع أخرى من أجهزة الكمبيوتر إلى أحرف.",
		abstract: "تُرجع الحرف المحدد بواسطة رقم. استخدم CHAR لترجمة أرقام صفحات الترميز اللغوي التي قد تحصل عليها من ملفات موجودة على أنواع أخرى من أجهزة الكمبيوتر إلى أحرف.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/char-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. وهي رقم بين 1 و255 يحدد الحرف الذي تريده. ويتم الحصول على الحرف من مجموعة الأحرف التي يستخدمها الكمبيوتر. ملاحظة يدعم Excel على الويب CHAR(9) وCHAR(10) وCHAR(13) وCHAR (32) وما فوق فقط."
		} }
	},
	CLEAN: {
		description: "تزيل كافة الأحرف غير القابلة للطباعة من النص. استخدم CLEAN مع نص مستورد من تطبيقات أخرى ويحتوي على أحرف قد لا تتم طباعتها مع نظام التشغيل الموجود لديك. على سبيل المثال، يمكنك استخدام CLEAN لإزالة رموز الكمبيوتر غير المهمة والتي تتكرر عادةً في بداية ملفات البيانات ونهايتها وتتعذّر طباعته.",
		abstract: "تزيل كافة الأحرف غير القابلة للطباعة من النص. استخدم CLEAN مع نص مستورد من تطبيقات أخرى ويحتوي على أحرف قد لا تتم طباعتها مع نظام التشغيل الموجود لديك. على سبيل المثال، يمكنك استخدام CLEAN لإزالة رموز الكمبيوتر غير المهمة والتي تتكرر عادةً في بداية ملفات البيانات ونهايتها وتتعذّر طباعته.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/clean-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. وهي أي معلومات في ورقة العمل تريد إزالة الأحرف غير القابلة للطباعة منها."
		} }
	},
	CODE: {
		description: "تُرجع رمزاً رقمياً للحرف الأول في سلسلة نصية. يتوافق الرمز الذي يتم إرجاعه مع مجموعة الأحرف التي يستخدمها الكمبيوتر.",
		abstract: "تُرجع رمزاً رقمياً للحرف الأول في سلسلة نصية. يتوافق الرمز الذي يتم إرجاعه مع مجموعة الأحرف التي يستخدمها الكمبيوتر.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/code-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. وهي النص الذي تريد رمز الحرف الأول له."
		} }
	},
	CONCAT: {
		description: "تجمع الدالة CONCAT بين النص من نطاقات و/أو سلاسل متعددة، ولكنها لا توفر محددا أو وسيطات IgnoreEmpty.",
		abstract: "تجمع الدالة CONCAT بين النص من نطاقات و/أو سلاسل متعددة، ولكنها لا توفر محددا أو وسيطات IgnoreEmpty.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/concat-function"
		}],
		functionParameter: {
			text1: {
				name: "text1",
				detail: "العنصر النصي المطلوب ضمه. سلسلة أو صفيف من السلاسل مثل نطاق من الخلايا."
			},
			text2: {
				name: "text2",
				detail: "العناصر النصية الإضافية المطلوب ضمها. الحد الأقصى للوسيطات النصية هو 253 للعناصر النصية. يمكن أن تكون كل منها سلسلة أو صفيف من السلاسل مثل نطاق من الخلايا."
			}
		}
	},
	CONCATENATE: {
		description: "استخدم CONCATENATE ، وهي إحدى دالات النص ، لجمع سلستين نصيتين أو أكثر في سلسلة واحدة.",
		abstract: "استخدم CONCATENATE ، وهي إحدى دالات النص ، لجمع سلستين نصيتين أو أكثر في سلسلة واحدة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/concatenate-function"
		}],
		functionParameter: {
			text1: {
				name: "text1",
				detail: "العنصر الأول المراد ضمه. يمكن أن يكون قيمة نصية أو رقماً أو مرجع خلية."
			},
			text2: {
				name: "text2",
				detail: "عناصر نصية إضافية للضم. يمكنك إدخال ما يصل إلى 255 عنصراً، بإجمالي لا يتجاوز 8192 حرفاً."
			}
		}
	},
	DBCS: {
		description: "تقوم الدالة الموضحة في موضوع \"التعليمات\" هذا بتحويل الأحرف بنصف العرض (وحيدة البايت) بإحدى سلاسل الأحرف إلى أحرف كاملة العرض (مزدوجة البايت). يعتمد اسم الدالة (والأحرف التي تقوم بتحويلها) على إعدادات اللغة لديك.",
		abstract: "تقوم الدالة الموضحة في موضوع \"التعليمات\" هذا بتحويل الأحرف بنصف العرض (وحيدة البايت) بإحدى سلاسل الأحرف إلى أحرف كاملة العرض (مزدوجة البايت). يعتمد اسم الدالة (والأحرف التي تقوم بتحويلها) على إعدادات اللغة لديك.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dbcs-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. النص أو مرجع الخلية الذي يحتوي على النص الذي تريد تغييره. إذا لم يتضمن النص أي أحرف إنجليزية أو أحرف كاتاكانا بنصف العرض، فلا يتغير النص."
		} }
	},
	DOLLAR: {
		description: "تحوّل الدالة DOLLAR ، إحدى دالات TEXT ، الرقم إلى نص باستخدام تنسيق العملة، مع تقريب الأرقام العشرية إلى عدد الأماكن التي تحددها. تستخدم الدالة DOLLAR تنسيق الأرقام ‎$#,##0.00_);($#,##0.00)‎، رغم أن رمز العملة المنطبق يعتمد على إعدادات اللغة المحلية لديك.",
		abstract: "تحوّل الدالة DOLLAR ، إحدى دالات TEXT ، الرقم إلى نص باستخدام تنسيق العملة، مع تقريب الأرقام العشرية إلى عدد الأماكن التي تحددها. تستخدم الدالة DOLLAR تنسيق الأرقام ‎$#,##0.00_);($#,##0.00)‎، رغم أن رمز العملة المنطبق يعتمد على إعدادات اللغة المحلية لديك.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/dollar-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. رقم أو مرجع لخلية تحتوي على رقم أو صيغة يتم تقييمها إلى رقم."
			},
			decimals: {
				name: "decimals",
				detail: "الاختياري. عدد الأرقام إلى يمين الفاصلة العشرية. إذا كانت هذه القيمة سالبة، فسيتم تقريب الرقم إلى يسار الفاصلة العشرية. إذا حذفت الوسيطة decimals، فسيُفترض أنها 2."
			}
		}
	},
	EXACT: {
		description: "تقارن هذه الدالة بين سلسلتين نصيتين وتُرجع القيمة TRUE عند وجود تطابق تام بينهما، وإلا فتُرجع القيمة FALSE. إن الدالة EXACT حساسة لحالة الأحرف ولكنها تتجاهل الاختلافات في التنسيق. استخدم الدالة EXACT لاختبار النص الذي يتم إدخاله في المستند.",
		abstract: "تقارن هذه الدالة بين سلسلتين نصيتين وتُرجع القيمة TRUE عند وجود تطابق تام بينهما، وإلا فتُرجع القيمة FALSE. إن الدالة EXACT حساسة لحالة الأحرف ولكنها تتجاهل الاختلافات في التنسيق. استخدم الدالة EXACT لاختبار النص الذي يتم إدخاله في المستند.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/exact-function"
		}],
		functionParameter: {
			text1: {
				name: "text1",
				detail: "مطلوب. السلسلة النصية الأولى."
			},
			text2: {
				name: "text2",
				detail: "مطلوب. السلسلة النصية الثانية."
			}
		}
	},
	FIND: {
		description: "تعثر على قيمة نصية داخل قيمة نصية أخرى مع مراعاة حالة الأحرف.",
		abstract: "تعثر على قيمة نصية داخل قيمة نصية أخرى مع مراعاة حالة الأحرف.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/this-article-has-been-retired"
		}],
		functionParameter: {
			findText: {
				name: "find_text",
				detail: "النص الذي تريد العثور عليه."
			},
			withinText: {
				name: "within_text",
				detail: "النص الذي يحتوي على النص الذي تريد العثور عليه."
			},
			startNum: {
				name: "start_num",
				detail: "يحدد الحرف الذي يبدأ عنده البحث. إذا حذفت start_num، يُفترض أنها 1."
			}
		}
	},
	FINDB: {
		description: "تعثر على قيمة نصية داخل قيمة نصية أخرى مع مراعاة حالة الأحرف.",
		abstract: "تعثر على قيمة نصية داخل قيمة نصية أخرى مع مراعاة حالة الأحرف.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/this-article-has-been-retired"
		}],
		functionParameter: {
			findText: {
				name: "find_text",
				detail: "النص الذي تريد العثور عليه."
			},
			withinText: {
				name: "within_text",
				detail: "النص الذي يحتوي على النص الذي تريد العثور عليه."
			},
			startNum: {
				name: "start_num",
				detail: "يحدد الحرف الذي يبدأ عنده البحث. إذا حذفت start_num، يُفترض أنها 1."
			}
		}
	},
	FIXED: {
		description: "تقرّب هذه الدالة رقماً إلى عدد محدد من الأرقام العشرية، وتنسّق الرقم بالتنسيق العشري باستخدام نقطة وفواصل، وتُرجع النتيجة كنص.",
		abstract: "تقرّب هذه الدالة رقماً إلى عدد محدد من الأرقام العشرية، وتنسّق الرقم بالتنسيق العشري باستخدام نقطة وفواصل، وتُرجع النتيجة كنص.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/fixed-function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "مطلوبة. الرقم الذي تريد تقريبه وتحويله إلى نص."
			},
			decimals: {
				name: "decimals",
				detail: "الاختياري. عدد الأرقام إلى يمين الفاصلة العشرية."
			},
			noCommas: {
				name: "no_commas",
				detail: "الاختياري. قيمة منطقية تمنع FIXED من تضمين فواصل في النص الذي يتم إرجاعه إذا تم تقييمها إلى TRUE."
			}
		}
	},
	LEFT: {
		description: "ترجع الأحرف الموجودة في أقصى يسار قيمة نصية.",
		abstract: "ترجع الأحرف الموجودة في أقصى يسار قيمة نصية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/left-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "السلسلة النصية التي تحتوي على الأحرف التي تريد استخراجها."
			},
			numChars: {
				name: "num_chars",
				detail: "يحدد عدد الأحرف التي تريد أن تستخرجها LEFT."
			}
		}
	},
	LEFTB: {
		description: "ترجع الأحرف الموجودة في أقصى يسار قيمة نصية.",
		abstract: "ترجع الأحرف الموجودة في أقصى يسار قيمة نصية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/left-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "السلسلة النصية التي تحتوي على الأحرف التي تريد استخراجها."
			},
			numBytes: {
				name: "num_bytes",
				detail: "يحدد عدد البايتات التي تريد أن تستخرجها LEFTB."
			}
		}
	},
	LEN: {
		description: "ترجع عدد الأحرف في سلسلة نصية.",
		abstract: "ترجع عدد الأحرف في سلسلة نصية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/len-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "النص الذي تريد معرفة طوله. تُحتسب المسافات كأحرف."
		} }
	},
	LENB: {
		description: "ترجع عدد البايتات المستخدمة لتمثيل الأحرف في سلسلة نصية.",
		abstract: "ترجع عدد البايتات المستخدمة لتمثيل الأحرف في سلسلة نصية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/len-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "النص الذي تريد معرفة طوله. تُحتسب المسافات كأحرف."
		} }
	},
	LOWER: {
		description: "تحويل كافة الأحرف الكبيرة في سلسلة نصية إلى أحرف صغيرة.",
		abstract: "تحويل كافة الأحرف الكبيرة في سلسلة نصية إلى أحرف صغيرة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/lower-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. النص الذي تريد تحويله إلى أحرف صغيرة. لا تغيّر الدالة LOWER الأحرف غير الأبجدية في النص."
		} }
	},
	MID: {
		description: "ترجع عدداً محدداً من الأحرف من سلسلة نصية بدءاً من الموضع الذي تحدده.",
		abstract: "ترجع عدداً محدداً من الأحرف من سلسلة نصية بدءاً من الموضع الذي تحدده.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mid-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "السلسلة النصية التي تحتوي على الأحرف التي تريد استخراجها."
			},
			startNum: {
				name: "start_num",
				detail: "موضع أول حرف تريد استخراجه من text."
			},
			numChars: {
				name: "num_chars",
				detail: "يحدد عدد الأحرف التي تريد أن تستخرجها MID."
			}
		}
	},
	MIDB: {
		description: "ترجع عدداً محدداً من الأحرف من سلسلة نصية بدءاً من الموضع الذي تحدده.",
		abstract: "ترجع عدداً محدداً من الأحرف من سلسلة نصية بدءاً من الموضع الذي تحدده.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/mid-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "السلسلة النصية التي تحتوي على الأحرف التي تريد استخراجها."
			},
			startNum: {
				name: "start_num",
				detail: "موضع أول حرف تريد استخراجه من text."
			},
			numBytes: {
				name: "num_bytes",
				detail: "يحدد عدد البايتات التي تريد أن تستخرجها MIDB."
			}
		}
	},
	NUMBERSTRING: {
		description: "تحوّل الأرقام إلى سلاسل نصية صينية.",
		abstract: "تحوّل الأرقام إلى سلاسل نصية صينية.",
		links: [{
			title: "Instruction",
			url: "https://www.wps.cn/learning/course/detail/id/340.html?chan=pc_kdocs_function"
		}],
		functionParameter: {
			number: {
				name: "number",
				detail: "القيمة المحولة إلى سلسلة نصية صينية."
			},
			type: {
				name: "type",
				detail: "نوع النتيجة المعادة. \n1. أحرف صينية صغيرة \n2. أحرف صينية كبيرة \n3. قراءة وكتابة الأحرف الصينية"
			}
		}
	},
	NUMBERVALUE: {
		description: "تقوم هذه الدالة بتحويل نص إلى رقم، بشكل مستقل عن الإعدادات المحلية.",
		abstract: "تقوم هذه الدالة بتحويل نص إلى رقم، بشكل مستقل عن الإعدادات المحلية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/numbervalue-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "مطلوبة. النص المراد تحويله إلى رقم."
			},
			decimalSeparator: {
				name: "decimal_separator",
				detail: "الاختياري. الحرف المستخدم لفصل العدد الصحيح والجزء الكسري من النتيجة."
			},
			groupSeparator: {
				name: "group_separator",
				detail: "الاختياري. الحرف المستخدم لفصل تجميعات الأرقام، مثل الآلاف من المئات والملايين عن الآلاف."
			}
		}
	},
	PHONETIC: {
		description: "تستخرج هذه الدالة الأحرف الصوتية (furigana) من سلسلة نصية.",
		abstract: "تستخرج هذه الدالة الأحرف الصوتية (furigana) من سلسلة نصية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/phonetic-function"
		}],
		functionParameter: { reference: {
			name: "مرجع",
			detail: "مطلوب. سلسلة نصية أو مرجع إلى خلية واحدة أو نطاق خلايا يحتوي على سلسلة furigana النصية."
		} }
	},
	PROPER: {
		description: "تحوّل هذه الدالة الحرف الأول في سلسلة نصية وأي أحرف أخرى في النص الذي يلي أي حرف آخر غير حرف أبجدي إلى حرف كبير. وتحوّل كافة الأحرف الأخرى إلى أحرف صغيرة.",
		abstract: "تحوّل هذه الدالة الحرف الأول في سلسلة نصية وأي أحرف أخرى في النص الذي يلي أي حرف آخر غير حرف أبجدي إلى حرف كبير. وتحوّل كافة الأحرف الأخرى إلى أحرف صغيرة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/proper-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. نص مضمّن بين علامتي اقتباس، أو صيغة تُرجع نصاً، أو مرجع إلى خلية تحتوي على النص الذي تريد تحويل جزء منه إلى أحرف كبيرة."
		} }
	},
	REGEXEXTRACT: {
		description: "تستخرج أول سلسلة فرعية مطابقة وفقاً لتعبير عادي.",
		abstract: "تستخرج أول سلسلة فرعية مطابقة وفقاً لتعبير عادي.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/3098244?hl=ar"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "النص المُدخل."
			},
			regularExpression: {
				name: "regular_expression",
				detail: "يُرجع الجزء الأول من النص الذي يطابق هذا التعبير."
			}
		}
	},
	REGEXMATCH: {
		description: "تحدد ما إذا كان جزء من النص يطابق تعبيراً عادياً.",
		abstract: "تحدد ما إذا كان جزء من النص يطابق تعبيراً عادياً.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/3098292?hl=ar"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "النص المراد اختباره مقابل التعبير العادي."
			},
			regularExpression: {
				name: "regular_expression",
				detail: "التعبير العادي لاختبار النص مقابله."
			}
		}
	},
	REGEXREPLACE: {
		description: "تستبدل جزءاً من سلسلة نصية بسلسلة نصية أخرى باستخدام تعبيرات عادية.",
		abstract: "تستبدل جزءاً من سلسلة نصية بسلسلة نصية أخرى باستخدام تعبيرات عادية.",
		links: [{
			title: "Instruction",
			url: "https://support.google.com/docs/answer/3098245?hl=ar"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "النص الذي سيُستبدل جزء منه."
			},
			regularExpression: {
				name: "regular_expression",
				detail: "التعبير العادي. ستُستبدل كل الحالات المطابقة في text."
			},
			replacement: {
				name: "replacement",
				detail: "النص الذي سيُدرج في النص الأصلي."
			}
		}
	},
	REPLACE: {
		description: "تستبدل الأحرف داخل النص.",
		abstract: "تستبدل الأحرف داخل النص.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/replace-function"
		}],
		functionParameter: {
			oldText: {
				name: "old_text",
				detail: "النص الذي تريد استبدال بعض أحرفه."
			},
			startNum: {
				name: "start_num",
				detail: "موضع الحرف في old_text الذي تريد استبداله بـ new_text."
			},
			numChars: {
				name: "num_chars",
				detail: "عدد الأحرف في old_text التي تريد أن تستبدلها REPLACE بـ new_text."
			},
			newText: {
				name: "new_text",
				detail: "النص الذي سيستبدل الأحرف في old_text."
			}
		}
	},
	REPLACEB: {
		description: "تستبدل الأحرف داخل النص.",
		abstract: "تستبدل الأحرف داخل النص.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/replace-function"
		}],
		functionParameter: {
			oldText: {
				name: "old_text",
				detail: "النص الذي تريد استبدال بعض أحرفه."
			},
			startNum: {
				name: "start_num",
				detail: "موضع الحرف في old_text الذي تريد استبداله بـ new_text."
			},
			numBytes: {
				name: "num_bytes",
				detail: "عدد البايتات في old_text التي تريد أن تستبدلها REPLACEB بـ new_text."
			},
			newText: {
				name: "new_text",
				detail: "النص الذي سيستبدل الأحرف في old_text."
			}
		}
	},
	REPT: {
		description: "تكرر هذه الدالة نصاً لعدد معيّن من المرات. استخدم الدالة REPT لتعبئة خلية بعدد من مثيلات سلسلة نصية.",
		abstract: "تكرر هذه الدالة نصاً لعدد معيّن من المرات. استخدم الدالة REPT لتعبئة خلية بعدد من مثيلات سلسلة نصية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/rept-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "مطلوبة. النص الذي تريد تكراره."
			},
			numberTimes: {
				name: "number_times",
				detail: "مطلوب. عدد موجب يحدد عدد المرات التي تريد فيها تكرار النص."
			}
		}
	},
	RIGHT: {
		description: "ترجع الأحرف الموجودة في أقصى يمين قيمة نصية.",
		abstract: "ترجع الأحرف الموجودة في أقصى يمين قيمة نصية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/right-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "السلسلة النصية التي تحتوي على الأحرف التي تريد استخراجها."
			},
			numChars: {
				name: "num_chars",
				detail: "يحدد عدد الأحرف التي تريد أن تستخرجها RIGHT."
			}
		}
	},
	RIGHTB: {
		description: "ترجع الأحرف الموجودة في أقصى يمين قيمة نصية.",
		abstract: "ترجع الأحرف الموجودة في أقصى يمين قيمة نصية.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/right-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "السلسلة النصية التي تحتوي على الأحرف التي تريد استخراجها."
			},
			numBytes: {
				name: "num_bytes",
				detail: "يحدد عدد البايتات التي تريد أن تستخرجها RIGHTB."
			}
		}
	},
	SEARCH: {
		description: "تعثر على قيمة نصية داخل قيمة نصية أخرى دون مراعاة حالة الأحرف.",
		abstract: "تعثر على قيمة نصية داخل قيمة نصية أخرى دون مراعاة حالة الأحرف.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/search-function"
		}],
		functionParameter: {
			findText: {
				name: "find_text",
				detail: "النص الذي تريد العثور عليه."
			},
			withinText: {
				name: "within_text",
				detail: "النص الذي يحتوي على النص الذي تريد العثور عليه."
			},
			startNum: {
				name: "start_num",
				detail: "يحدد الحرف الذي يبدأ عنده البحث. إذا حذفت start_num، يُفترض أنها 1."
			}
		}
	},
	SEARCHB: {
		description: "تعثر على قيمة نصية داخل قيمة نصية أخرى دون مراعاة حالة الأحرف.",
		abstract: "تعثر على قيمة نصية داخل قيمة نصية أخرى دون مراعاة حالة الأحرف.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/search-function"
		}],
		functionParameter: {
			findText: {
				name: "find_text",
				detail: "النص الذي تريد العثور عليه."
			},
			withinText: {
				name: "within_text",
				detail: "النص الذي يحتوي على النص الذي تريد العثور عليه."
			},
			startNum: {
				name: "start_num",
				detail: "يحدد الحرف الذي يبدأ عنده البحث. إذا حذفت start_num، يُفترض أنها 1."
			}
		}
	},
	SUBSTITUTE: {
		description: "تستبدل هذه الدالة old_text بـ new_text في سلسلة نصية. استخدم الدالة SUBSTITUTE عندما تريد استبدال نص محدد في سلسلة نصية؛ استخدم الدالة REPLACE عندما تريد استبدال أي نص موجود في موقع محدد في سلسلة نصية.",
		abstract: "تستبدل هذه الدالة old_text بـ new_text في سلسلة نصية. استخدم الدالة SUBSTITUTE عندما تريد استبدال نص محدد في سلسلة نصية؛ استخدم الدالة REPLACE عندما تريد استبدال أي نص موجود في موقع محدد في سلسلة نصية.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/substitute-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "مطلوبة. النص أو مرجع الخلية التي تحتوي على النص الذي ترغب في استبدال أحرف به."
			},
			oldText: {
				name: "old_text",
				detail: "مطلوب. النص الذي تريد استبداله."
			},
			newText: {
				name: "new_text",
				detail: "مطلوب. النص الذي تريد استبدال old_text به."
			},
			instanceNum: {
				name: "instance_num",
				detail: "الاختياري. تحديد مثيل old_text الذي تريد استبداله بـ new_text. إذا حددت instance_num، يتم استبدال مثيل old_text هذا فقط. عدا ذلك، يتم تغيير كل مرات حدوث old_text في النص إلى new_text."
			}
		}
	},
	T: {
		description: "تُرجع هذه الدالة النص الذي تشير إليه القيمة.",
		abstract: "تُرجع هذه الدالة النص الذي تشير إليه القيمة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/t-function"
		}],
		functionParameter: { value: {
			name: "value",
			detail: "مطلوب. القيمة التي ترغب في اختبارها."
		} }
	},
	TEXT: {
		description: "تتيح لك الدالة TEXT تغيير طريقة ظهور الأرقام من خلال تطبيق التنسيق عليها باستخدام رموز التنسيقات . وهذا مفيد عندما تريد عرض الأرقام بتنسيق أكثر قابلية للقراءة، أو تريد دمج الأرقام مع النصوص أو الرموز.",
		abstract: "تتيح لك الدالة TEXT تغيير طريقة ظهور الأرقام من خلال تطبيق التنسيق عليها باستخدام رموز التنسيقات . وهذا مفيد عندما تريد عرض الأرقام بتنسيق أكثر قابلية للقراءة، أو تريد دمج الأرقام مع النصوص أو الرموز.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/text-function"
		}],
		functionParameter: {
			value: {
				name: "value",
				detail: "قيمة رقمية تريد تحويلها إلى نص."
			},
			formatText: {
				name: "format_text",
				detail: "سلسلة نصية تحدد التنسيق الذي تريد تطبيقه على القيمة المقدمة."
			}
		}
	},
	TEXTAFTER: {
		description: "إرجاع النص الذي يحدث بعد حرف معين أو سلسلة معينة. إنه عكس الدالة TEXTBEFORE .",
		abstract: "إرجاع النص الذي يحدث بعد حرف معين أو سلسلة معينة. إنه عكس الدالة TEXTBEFORE .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/textafter-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "النص الذي تبحث داخله. لا يُسمح بأحرف البدل."
			},
			delimiter: {
				name: "delimiter",
				detail: "النص الذي يحدد النقطة التي تريد استخراج النص بعدها."
			},
			instanceNum: {
				name: "instance_num",
				detail: "موضع ظهور المحدد الذي تريد استخراج النص بعده."
			},
			matchMode: {
				name: "match_mode",
				detail: "يحدد ما إذا كان البحث في النص حساساً لحالة الأحرف. الإعداد الافتراضي حساس لحالة الأحرف."
			},
			matchEnd: {
				name: "match_end",
				detail: "يعامل نهاية النص كمحدد. افتراضياً يجب أن يكون النص مطابقاً تماماً."
			},
			ifNotFound: {
				name: "if_not_found",
				detail: "القيمة المعادة إذا لم يُعثر على تطابق. افتراضياً تُرجع #N/A."
			}
		}
	},
	TEXTBEFORE: {
		description: "إرجاع النص الذي يحدث قبل حرف أو سلسلة معينة. إنها نقيض الدالة TEXTAFTER .",
		abstract: "إرجاع النص الذي يحدث قبل حرف أو سلسلة معينة. إنها نقيض الدالة TEXTAFTER .",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/textbefore-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "النص الذي تبحث داخله. لا يُسمح بأحرف البدل."
			},
			delimiter: {
				name: "delimiter",
				detail: "النص الذي يحدد النقطة التي تريد استخراج النص قبلها."
			},
			instanceNum: {
				name: "instance_num",
				detail: "موضع ظهور المحدد الذي تريد استخراج النص قبله."
			},
			matchMode: {
				name: "match_mode",
				detail: "يحدد ما إذا كان البحث في النص حساساً لحالة الأحرف. الإعداد الافتراضي حساس لحالة الأحرف."
			},
			matchEnd: {
				name: "match_end",
				detail: "يعامل نهاية النص كمحدد. افتراضياً يجب أن يكون النص مطابقاً تماماً."
			},
			ifNotFound: {
				name: "if_not_found",
				detail: "القيمة المعادة إذا لم يُعثر على تطابق. افتراضياً تُرجع #N/A."
			}
		}
	},
	TEXTJOIN: {
		description: "تعمل دالة TEXTJOIN على دمج النص من نطاقات و/أو سلاسل متعددة، وتضمين المحدِد الذي تحدده بين كل قيمة نصية سيتم دمجها. إذا كان المحدِد عبارة عن سلسلة نصية فارغة، فستعمل هذه الدالة على تسلسل النطاقات بطريقة فعّالة.",
		abstract: "تعمل دالة TEXTJOIN على دمج النص من نطاقات و/أو سلاسل متعددة، وتضمين المحدِد الذي تحدده بين كل قيمة نصية سيتم دمجها. إذا كان المحدِد عبارة عن سلسلة نصية فارغة، فستعمل هذه الدالة على تسلسل النطاقات بطريقة فعّالة.",
		links: [{
			title: "Instruction",
			url: "https://support.microsoft.com/ar-sa/excel/functions/textjoin-function"
		}],
		functionParameter: {
			delimiter: {
				name: "delimiter",
				detail: "عبارة عن سلسلة نصية، إما أن تكون فارغة أو تكون حرفاً واحداً أو أكثر محاطاً بعلامات الاقتباس المزدوجة أو مرجعاً إلى سلسلة نصية صالحة. إذا تم إدخال رقم، فسيُعامل كنص."
			},
			ignoreEmpty: {
				name: "ignore_empty",
				detail: "إذا كانت TRUE، فستتجاهل الخلايا الفارغة."
			},
			text1: {
				name: "text1",
				detail: "هي العنصر النصي المطلوب دمجه. عبارة عن سلسلة نصية أو صفيف من السلاسل مثل نطاق من الخلايا."
			},
			text2: {
				name: "text2",
				detail: "هي العناصر النصية الإضافية المطلوب دمجها. قد يكون هناك حد أقصى يبلغ 252 من الوسيطات النصية للعناصر النصية بما في ذلك text1 . يمكن أن يكون كل عنصر منها عبارة عن سلسلة أو صفيف من السلاسل مثل نطاق من الخلايا."
			}
		}
	},
	TEXTSPLIT: {
		description: "تعمل الدالة TEXTSPLIT بالطريقة نفسها التي يعمل بها معالج Text-to-Columns ، ولكن في نموذج الصيغة. يسمح لك بالتقسيم عبر الأعمدة أو لأسفل حسب الصفوف. وهو عكس الدالة TEXTJOIN .",
		abstract: "تعمل الدالة TEXTSPLIT بالطريقة نفسها التي يعمل بها معالج Text-to-Columns ، ولكن في نموذج الصيغة. يسمح لك بالتقسيم عبر الأعمدة أو لأسفل حسب الصفوف. وهو عكس الدالة TEXTJOIN .",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/textsplit-function"
		}],
		functionParameter: {
			text: {
				name: "text",
				detail: "النص الذي تريد تقسيمه. مطلوبة."
			},
			colDelimiter: {
				name: "col_delimiter",
				detail: "النص الذي يضع علامة على النقطة التي يتم فيها سكب النص عبر الأعمدة."
			},
			rowDelimiter: {
				name: "row_delimiter",
				detail: "النص الذي يضع علامة على النقطة التي يتم فيها تصغير النص إلى أسفل الصفوف. اختيارية."
			},
			ignoreEmpty: {
				name: "ignore_empty",
				detail: "حدد TRUE لتجاهل المحددات المتتالية. يتم تعيين القيمة الافتراضية إلى \"FALSE\" مما يؤدي إلى إنشاء خلية فارغة. اختيارية."
			},
			matchMode: {
				name: "match_mode",
				detail: "حدد 1 لإجراء تطابق غير حساس لحالة الأحرف. يتم تعيين القيمة الافتراضية إلى \"0\" مما يؤدي إلى إجراء تطابق حساس لحالة الأحرف. اختيارية."
			},
			padWith: {
				name: "pad_with",
				detail: "القيمة التي سيتم بها فرز النتيجة. الإعداد الافتراضي هو #N/A."
			}
		}
	},
	TRIM: {
		description: "تُزيل هذه الدالة كافة المسافات من النص باستثناء المسافات الفردية بين الكلمات. استخدم الدالة TRIM على نص تلقيته من تطبيق آخر قد يكون تباعد الكلمات فيه غير منتظم.",
		abstract: "تُزيل هذه الدالة كافة المسافات من النص باستثناء المسافات الفردية بين الكلمات. استخدم الدالة TRIM على نص تلقيته من تطبيق آخر قد يكون تباعد الكلمات فيه غير منتظم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/trim-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "النص الذي تريد إزالة المسافات منه. يجب أن يكون النص مضمنا في علامات الاقتباس."
		} }
	},
	UNICHAR: {
		description: "إرجاع حرف Unicode المشار إليه بالقيمة الرقمية المُعطاة.",
		abstract: "إرجاع حرف Unicode المشار إليه بالقيمة الرقمية المُعطاة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/unichar-function"
		}],
		functionParameter: { number: {
			name: "number",
			detail: "مطلوبة. الرقم هو رقم Unicode الذي يمثل الحرف."
		} }
	},
	UNICODE: {
		description: "إرجاع الرقم (نقطة الرمز) المقابل للحرف الأول من النص.",
		abstract: "إرجاع الرقم (نقطة الرمز) المقابل للحرف الأول من النص.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/unicode-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. النص هو الحرف الذي تريد قيمة Unicode له."
		} }
	},
	UPPER: {
		description: "تحوّل هذه الدالة النص إلى أحرف كبيرة.",
		abstract: "تحوّل هذه الدالة النص إلى أحرف كبيرة.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/upper-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. النص الذي تريد تحويله إلى أحرف كبيرة. يمكن أن يكون النص مرجعاً أو سلسلة نصية."
		} }
	},
	VALUE: {
		description: "تحوّل هذه الدالة سلسلة نصية تمثل رقماً إلى رقم.",
		abstract: "تحوّل هذه الدالة سلسلة نصية تمثل رقماً إلى رقم.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/value-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "مطلوبة. النص المضمّن بين علامات اقتباس أو مرجع إلى خلية تحتوي على النص الذي ترغب في تحويله."
		} }
	},
	VALUETOTEXT: {
		description: "ترجع الدالة \"VALUETOTEXT\" نصاً من أي قيمة محددة. يمرر القيم النصية دون تغيير، ويحول القيم غير النصية إلى نص.",
		abstract: "ترجع الدالة \"VALUETOTEXT\" نصاً من أي قيمة محددة. يمرر القيم النصية دون تغيير، ويحول القيم غير النصية إلى نص.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/valuetotext-function"
		}],
		functionParameter: {
			value: {
				name: "value",
				detail: "القيمة المراد إرجاعها كنص. مطلوبة."
			},
			format: {
				name: "format",
				detail: "تنسيق البيانات التي تم إرجاعها. اختيارية. يمكن أن تكون واحدة من قيمتين: 0 افتراضي. تنسيق مختصر يسهل قراءته. سيكون النص الذي يتم إرجاعه هو نفسه النص المعروض في خلية تم تطبيق التنسيق العام عليها. 1 تنسيق صارم يتضمن أحرف الإلغاء ومحددات الصفوف. يولد سلسلة يمكن تحليلها عند إدخالها في شريط الصيغة. لتضمين السلاسل التي تم إرجاعها في علامات الاقتباس باستثناء القيم المنطقية والأرقام والأخطاء."
			}
		}
	},
	CALL: {
		description: "تستدعي إجراءاً في مكتبة الارتباطات الديناميكية أو في مورد التعليمات البرمجية. ثمة نموذجان لبناء جملة هذه الدالة. استخدم بناء الجملة 1 مع مورد تعليمات برمجية مسجل مسبقاً فقط، والذي يستخدم وسيطات من الدالة REGISTER. واستخدم بناء الجملة 2أ أو 2ب لتسجيل مورد تعليمات برمجية واستدعائه بشكلٍ متزامن.",
		abstract: "تستدعي إجراءاً في مكتبة الارتباطات الديناميكية أو في مورد التعليمات البرمجية. ثمة نموذجان لبناء جملة هذه الدالة. استخدم بناء الجملة 1 مع مورد تعليمات برمجية مسجل مسبقاً فقط، والذي يستخدم وسيطات من الدالة REGISTER. واستخدم بناء الجملة 2أ أو 2ب لتسجيل مورد تعليمات برمجية واستدعائه بشكلٍ متزامن.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/call-function"
		}],
		functionParameter: {
			moduleText: {
				name: "Module_text",
				detail: "مطلوب. وهي النص المقتبس الذي يحدد اسم مكتبة الارتباطات الديناميكية (DLL) التي تحتوي على الإجراء في Microsoft Excel لـ Windows."
			},
			procedure: {
				name: "الاجراء",
				detail: "مطلوب. وهي النص الذي يحدد اسم الدالة في DLL في Microsoft Excel لـ Windows. يمكنك أيضاً استخدام القيمة الترتيبية للدالة من جملة EXPORTS في ملف تعريف الوحدة النمطية (DEF.). يجب ألا تكون القيمة الترتيبية في شكل نص."
			},
			typeText: {
				name: "Type_text",
				detail: "مطلوب. وهي النص الذي يحدد نوع البيانات للقيمة المرجعة وأنواع بيانات كافة الوسيطات لـ DLL أو مورد التعليمات البرمجية. يحدد أول حرف من type_text القيمة المرجعة. يتم شرح التعليمات البرمجية التي تستخدمها لـ type_text بشكلٍ تفصيلي في استخدام الدالتين CALL وREGISTER . وبالنسبة إلى مكتبات DLL أو موارد التعليمات البرمجية (XLLs) المستقلة، يمكنك إهمال هذه الوسيطة."
			},
			argument1: {
				name: "الوسيطة 1,...",
				detail: "الاختياري. وهي الوسيطات التي يتم تمريرها إلى الإجراء."
			}
		}
	},
	EUROCONVERT: {
		description: "تحوّل هذا الدالة رقماً إلى عملة اليورو أو تحوّل رقماً من عملة اليورو إلى عملة اليورو لأي من الدول الأعضاء في الاتحاد الأوروبي أو تحوّل رقماً من عملة دولة عضو في الاتحاد الأوروبي إلى عملة دولة أخرى باستخدام اليورو كوسيط (تحويل ثلاثي). إن العملات المتوفرة للتحويل هي عملات الدول الأعضاء في الاتحاد الأوروبي التي تتعامل باليورو. تستخدم الدالة أسعار تحويل ثابتة تم تحديدها من قِبل الاتحاد الأوروبي.",
		abstract: "تحوّل هذا الدالة رقماً إلى عملة اليورو أو تحوّل رقماً من عملة اليورو إلى عملة اليورو لأي من الدول الأعضاء في الاتحاد الأوروبي أو تحوّل رقماً من عملة دولة عضو في الاتحاد الأوروبي إلى عملة دولة أخرى باستخدام اليورو كوسيط (تحويل ثلاثي). إن العملات المتوفرة للتحويل هي عملات الدول الأعضاء في الاتحاد الأوروبي التي تتعامل باليورو. تستخدم الدالة أسعار تحويل ثابتة تم تحديدها من قِبل الاتحاد الأوروبي.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/euroconvert-function"
		}],
		functionParameter: {
			number: {
				name: "Number",
				detail: "مطلوبة. قيمة العملة التي تريد تحويلها أو مرجع إلى خلية تتضمن القيمة."
			},
			source: {
				name: "مصدر",
				detail: "مطلوب. سلسلة مكونة من ثلاثة أحرف، أو مرجع إلى خلية تحتوي على السلسلة، تتطابق مع رمز ISO الخاص بالعملة المصدر. تتوفر رموز العملات التالية في الدالة EUROCONVERT:"
			},
			target: {
				name: "الهدف",
				detail: "مطلوب. سلسلة مكونة من ثلاثة أحرف، أو مرجع خلية، تتطابق مع رمز ISO الخاص بالعملة التي تريد تحويل الرقم إليها. انظر جدول المصدر السابق للحصول على رموز ISO."
			},
			fullPrecision: {
				name: "Full_precision",
				detail: "مطلوب. قيمة منطقية (TRUE أو FALSE)، أو تعبير يتم تقييمه إلى القيمة TRUE أو FALSE، التي تحدد طريقة عرض النتيجة."
			},
			triangulationPrecision: {
				name: "Triangulation_precision",
				detail: "مطلوب. عدد صحيح يساوي 3 أو أكبر منه يحدد عدد الأرقام المهمة التي سيتم استخدامها لقيمة اليورو الوسيطة عند التحويل بين عملتين لعضوين من أعضاء الاتحاد الأوروبي. إذا حذفت هذه الوسيطة، فلن يقوم Excel بتقريب قيمة اليورو الوسيطة. إذا قمت بتضمين هذه الوسيطة عند تحويل عملة أحد أعضاء الاتحاد الأوروبي إلى اليورو، فسيقوم Excel بحساب قيمة اليورو الوسيطة والتي يمكن تحويلها بعد ذلك إلى عملة أحد أعضاء الاتحاد الأوروبي."
			}
		}
	},
	REGISTER_ID: {
		description: "تُرجع هذه الدالة معرّف التسجيل لمكتبة الارتباطات الديناميكية (DLL) المحددة أو مورد التعليمات البرمجية الذي تم تسجيله مسبقاً. إذا لم يتم تسجيل DLL أو مورد التعليمات البرمجية، فتسجل هذه الدالة DLL أو مورد التعليمات البرمجية ثم تُرجع معرّف التسجيل.",
		abstract: "تُرجع هذه الدالة معرّف التسجيل لمكتبة الارتباطات الديناميكية (DLL) المحددة أو مورد التعليمات البرمجية الذي تم تسجيله مسبقاً. إذا لم يتم تسجيل DLL أو مورد التعليمات البرمجية، فتسجل هذه الدالة DLL أو مورد التعليمات البرمجية ثم تُرجع معرّف التسجيل.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/register-id-function"
		}],
		functionParameter: {
			moduleText: {
				name: "Module_text",
				detail: "مطلوب. النص الذي يحدد اسم DLL التي تحتوي على الدالة في Microsoft Excel لـ Windows."
			},
			procedure: {
				name: "الاجراء",
				detail: "مطلوب. وهي النص الذي يحدد اسم الدالة في DLL في Microsoft Excel لـ Windows. يمكنك أيضاً استخدام القيمة الترتيبية للدالة من جملة EXPORTS في ملف تعريف الوحدة النمطية (DEF.). لا يجب أن تكون القيمة الترتيبية أو رقم معرّف المورد بتنسيق نصي."
			},
			typeText: {
				name: "Type_text",
				detail: "الاختياري. نص يحدد نوع البيانات للقيمة المرجعة وأنواع بيانات كافة الوسيطات لـ DLL. يحدد أول حرف من type_text القيمة المرجعة. إذا تم تسجيل الدالة أو مورد التعليمات البرمجية مسبقاً، فيمكنك حذف هذه الوسيطة."
			}
		}
	}
};

//#endregion
//#region src/locale/function-list/univer/ar-SA.ts
const locale$2 = {};

//#endregion
//#region src/locale/function-list/web/ar-SA.ts
const locale$1 = {
	ENCODEURL: {
		description: "ترجع الدالة ENCODEURL سلسلة مشفرة بعنوان URL، مع استبدال بعض الأحرف غير الأبجدية الرقمية برمز النسبة المئوية (٪) ورقم سداسي عشري.",
		abstract: "ترجع الدالة ENCODEURL سلسلة مشفرة بعنوان URL، مع استبدال بعض الأحرف غير الأبجدية الرقمية برمز النسبة المئوية (٪) ورقم سداسي عشري.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/encodeurl-function"
		}],
		functionParameter: { text: {
			name: "text",
			detail: "سلسلة لتكون مشفرة بعنوان URL"
		} }
	},
	FILTERXML: {
		description: "ترجع الدالة FILTERXML بيانات محددة من محتوى XML باستخدام xpath المحدد.",
		abstract: "ترجع الدالة FILTERXML بيانات محددة من محتوى XML باستخدام xpath المحدد.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/filterxml-function"
		}],
		functionParameter: {
			xml: {
				name: "xml",
				detail: "سلسلة بتنسيق XML صالح."
			},
			xpath: {
				name: "xpath",
				detail: "سلسلة بتنسيق XPath قياسي."
			}
		}
	},
	WEBSERVICE: {
		description: "ترجع الدالة WEBSERVICE البيانات من خدمة ويب على الإنترنت أو إنترانت.",
		abstract: "ترجع الدالة WEBSERVICE البيانات من خدمة ويب على الإنترنت أو إنترانت.",
		links: [{
			title: "التعليمات",
			url: "https://support.microsoft.com/ar-sa/excel/functions/webservice-function"
		}],
		functionParameter: { url: {
			name: "url",
			detail: "عنوان URL لخدمة الويب."
		} }
	}
};

//#endregion
//#region src/locale/ar-SA.ts
const locale = { "engine-formula": { functionList: {
	...locale$15,
	...locale$14,
	...locale$13,
	...locale$12,
	...locale$11,
	...locale$10,
	...locale$9,
	...locale$8,
	...locale$7,
	...locale$6,
	...locale$5,
	...locale$4,
	...locale$3,
	...locale$2,
	...locale$1
} } };

//#endregion
module.exports = locale;