const e = {
  "collaboration-client-ui": {
    collabClient: {
      tooltip: {
        reconnect: "انقر لإعادة الاتصال"
      }
    },
    collabStatus: {
      fetchMiss: "جارٍ مزامنة بيانات الخادم...",
      conflict: "تعارضات\x20التحرير",
      notCollab: "ملف محلي",
      synced: "تمت المزامنة",
      syncing: "جارٍ المزامنة...",
      offline: "غير متصل، سيتم حفظ التعديلات محليًا"
    },
    snapshotLoading: {
      timeout: "توقف تحميل البيانات عند {0}/{1}. حدّث الصفحة للمحاولة مرة أخرى.",
      refresh: "تحديث الصفحة"
    },
    session: {
      "connection-failed": "فشل الاتصال، يرجى التحقق من شبكتك.",
      "will-retry": "فشل\x20الاتصال،\x20سنعيد\x20المحاولة\x20بعد\x20قليل.",
      "room-full": "غرفة التعاون ممتلئة. سيتم حفظ تعديلاتك محليًا.",
      "collaboration-timeout": "الخادم\x20لا\x20يستجيب\x20لطلب\x20التعاون\x20الخاص\x20بك.\x20سيتم\x20حفظ\x20تعديلاتك\x20محليًا."
    },
    conflict: {
      title: "تعارض في التعاون",
      content: "هناك تعارض بين نسختك المحلية والنسخة على الخادم. يرجى حفظ تعديلاتك المحلية، لأنها ستُفقد عند إعادة تحميل الصفحة."
    },
    permission: {
      title: "خطأ\x20في\x20المصادقة",
      content: "إجراءاتك تتعارض مع أذونات الخادم. يرجى حفظ تعديلاتك المحلية في مكان آخر حيث سيتم تجاهلها بعد تحديث الصفحة."
    },
    collaboration: {
      "offline-data-not-saved": "لديك تعديلات غير متصلة لم يتم حفظها على الخادم. يرجى التحقق من شبكتك والمحاولة مرة أخرى.",
      "single-unit": {
        warning: "فتحت\x20نفس\x20الملف\x20في\x20علامة\x20تبويب\x20أخرى.\x20في\x20حالة\x20فقدان\x20البيانات،\x20لا\x20يمكنك\x20التحرير\x20في\x20علامة\x20التبويب\x20هذه."
      },
      closeRoom: "تم\x20إلغاء\x20امتيازات\x20التحرير\x20لأنه\x20تم\x20إغلاق\x20غرفة\x20التعاون."
    },
    auth: {
      needGotoLoginAlert: "انتهت صلاحية تسجيل الدخول الخاص بك، انقر فوق موافق لإعادة تسجيل الدخول، وانقر فوق إلغاء لحفظ تعديلاتك المحلية."
    },
    formula: {
      calculation: {
        started: "بدأ حساب الصيغة.",
        waiting: "قائمة انتظار حساب الصيغة ممتلئة، في انتظار خانة متاحة...",
        unable: "غير قادر على إجراء حساب الصيغة في هذا الوقت. يرجى المحاولة مرة أخرى لاحقًا."
      }
    }
  }
};
export { e as default };
