const e = {
  "sheets-outline-ui": {
    cancel: "إلغاء",
    group: "تجميع",
    ungroup: "إلغاء التجميع",
    groupRows: "تجميع الصفوف {0} - {1}",
    groupColumns: "تجميع الأعمدة {0} - {1}",
    ungroupRows: "إلغاء\x20تجميع\x20الصفوف\x20{0}\x20-\x20{1}",
    ungroupColumns: "إلغاء تجميع الأعمدة {0} - {1}",
    error: {
      permission: "ليس لديك إذن العرض، لذا لا يمكن إجراء عمليات التجميع.",
      invalidRange: "تعذر إنشاء المخطط التفصيلي لأن النطاق المحدد غير صالح.",
      outOfBounds:
        "تعذر\x20إنشاء\x20المخطط\x20التفصيلي\x20لأن\x20النطاق\x20المحدد\x20خارج\x20الورقة.",
      crossing: "تعذر تحديث المخطط التفصيلي لأن النتيجة ستنشئ مجموعات متداخلة.",
      maxDepth:
        "تعذر إنشاء المخطط التفصيلي لأن المخططات المتوافقة مع Excel تدعم حتى 8 مستويات.",
      moveSplitsOutline:
        "تعذر\x20نقل\x20الصفوف\x20أو\x20الأعمدة\x20لأن\x20ذلك\x20سيقسم\x20المخطط\x20التفصيلي\x20الموجود.\x20قم\x20بإزالة\x20المخطط\x20التفصيلي\x20ذي\x20الصلة\x20أولاً.",
      clearRangeNotContainOutline:
        "تعذر إلغاء التجميع لأن النطاق المحدد لا يحتوي بالكامل على نطاق مجموعة المخطط التفصيلي.",
      unknown:
        "تعذر\x20تحديث\x20المخطط\x20التفصيلي\x20لأن\x20العملية\x20غير\x20صالحة.",
    },
  },
};
module.exports = e;
