const e = {
  slides: {
    placeholder: {
      icon: {
        image: "Изображение",
        table: "Таблица",
        chart: "Диаграмма",
        diagram: "Диаграмма",
        media: "Медиа",
      },
    },
    slide: {
      placeholder: {
        text: {
          title: "Нажмите, чтобы добавить заголовок",
          subtitle: "Нажмите, чтобы добавить подзаголовок",
          body: "Нажмите, чтобы добавить текст",
          text: "Нажмите, чтобы добавить текст",
          header: "Заполнитель\x20верхнего\x20колонтитула",
          footer: "Заполнитель\x20нижнего\x20колонтитула",
          date: "Заполнитель\x20даты",
          slideNumber: "Заполнитель\x20номера\x20слайда",
        },
      },
    },
  },
};
export { e as default };
