const _0x562f47 = _0x2faf;
function _0x27d3() {
  const _0x4d2bc3 = [
    "یک\x20تداخل\x20بین\x20نسخه\x20محلی\x20شما\x20و\x20نسخه\x20در\x20سرور\x20وجود\x20دارد.\x20لطفاً\x20ویرایش\x20های\x20محلی\x20خود\x20را\x20ذخیره\x20کنید،\x20زیرا\x20آنها\x20پس\x20از\x20بازیابی\x20صفحه\x20از\x20بین\x20خواهند\x20رفت.",
    "در\x20حال\x20همگام\x20سازی...",
    "3647SrfuBf",
    "278585qeeLCy",
    "خطای\x20اعتبارسنجی",
    "exports",
    "آفلاین،\x20ویرایش\x20ها\x20در\x20محلی\x20ذخیره\x20می\x20شوند",
    "اتصال\x20ناموفق\x20بود،\x20لطفاً\x20شبکه\x20خود\x20را\x20بررسی\x20کنید.",
    "2433426DOXJGl",
    "امتیازات\x20ویرایش\x20به\x20دلیل\x20بسته\x20شدن\x20اتاق\x20همکاری\x20لغو\x20شد.",
    "3hXgXEZ",
    "تداخل\x20همکاری",
    "دسترسی\x20همکاری\x20وجود\x20ندارد.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
    "2526hEIHKn",
    "در\x20حال\x20همگام\x20سازی\x20داده\x20های\x20سرور...",
    "شما\x20همان\x20پرونده\x20را\x20در\x20یک\x20تب\x20دیگر\x20باز\x20کرده\x20اید.\x20در\x20صورت\x20عدم\x20وجود\x20داده،\x20نمی\x20توانید\x20در\x20این\x20تب\x20ویرایش\x20کنید.",
    "تعداد\x20اسناد\x20همکاری\x20از\x20حد\x20مجاز\x20فراتر\x20رفته\x20است.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
    "12753568TCODAS",
    "3859191YVfNvL",
    "1556145aOPQDr",
    "940708OxEHqr",
    "سرور\x20به\x20درخواست\x20همکاری\x20شما\x20پاسخ\x20نمی‌دهد.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
    "پیوستن\x20به\x20همکاری\x20ناموفق\x20بود.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
    "اعمال\x20شما\x20با\x20مجوزهای\x20سرور\x20تداخل\x20دارد.\x20لطفاً\x20ویرایش\x20های\x20محلی\x20خود\x20را\x20در\x20جای\x20دیگر\x20ذخیره\x20کنید\x20زیرا\x20پس\x20از\x20تازه\x20سازی\x20صفحه\x20از\x20بین\x20خواهند\x20رفت.",
  ];
  _0x27d3 = function () {
    return _0x4d2bc3;
  };
  return _0x27d3();
}
(function (_0x53f8d6, _0x5afb24) {
  const _0x16c8bd = _0x2faf,
    _0x365684 = _0x53f8d6();
  while (!![]) {
    try {
      const _0x52cdec =
        -parseInt(_0x16c8bd(0x136)) / 0x1 +
        parseInt(_0x16c8bd(0x143)) / 0x2 +
        (-parseInt(_0x16c8bd(0x145)) / 0x3) *
          (parseInt(_0x16c8bd(0x137)) / 0x4) +
        parseInt(_0x16c8bd(0x13e)) / 0x5 +
        (-parseInt(_0x16c8bd(0x148)) / 0x6) *
          (-parseInt(_0x16c8bd(0x13d)) / 0x7) +
        parseInt(_0x16c8bd(0x134)) / 0x8 +
        -parseInt(_0x16c8bd(0x135)) / 0x9;
      if (_0x52cdec === _0x5afb24) break;
      else _0x365684["push"](_0x365684["shift"]());
    } catch (_0x1ddb5e) {
      _0x365684["push"](_0x365684["shift"]());
    }
  }
})(_0x27d3, 0xd3636);
const e = {
  "collaboration-client": {
    collabClient: {
      tooltip: { reconnect: "برای\x20اتصال\x20مجدد\x20کلیک\x20کنید" },
    },
    collabStatus: {
      fetchMiss: _0x562f47(0x149),
      conflict: "تداخل\x20ویرایش",
      notCollab: "پرونده\x20محلی",
      synced: "همگام\x20سازی",
      syncing: _0x562f47(0x13c),
      offline: _0x562f47(0x141),
    },
    session: {
      "connection-failed": _0x562f47(0x142),
      "will-retry":
        "اتصال\x20ناموفق\x20بود،\x20ما\x20بعداً\x20دوباره\x20تلاش\x20می\x20کنیم.",
      "room-full":
        "ظرفیت\x20همکاری\x20در\x20این\x20سند\x20پر\x20شده\x20است.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
      "join-failed":
        "پیوستن\x20به\x20همکاری\x20ناموفق\x20بود.\x20لطفاً\x20بعداً\x20دوباره\x20امتحان\x20کنید.\x20ویرایش‌های\x20شما\x20به\x20صورت\x20محلی\x20ذخیره\x20خواهد\x20شد.",
      "room-not-exists": _0x562f47(0x139),
      "room-permission-denied": _0x562f47(0x147),
      "room-cnt-exceeds": _0x562f47(0x133),
      "collaboration-timeout": _0x562f47(0x138),
    },
    conflict: { title: _0x562f47(0x146), content: _0x562f47(0x13b) },
    permission: { title: _0x562f47(0x13f), content: _0x562f47(0x13a) },
    collaboration: {
      "single-unit": { warning: _0x562f47(0x132) },
      closeRoom: _0x562f47(0x144),
    },
    auth: {
      needGotoLoginAlert:
        "ورود\x20شم\x20منقضی\x20شده\x20است،\x20برای\x20ورود\x20مجدد\x20کلیک\x20کنید،\x20برای\x20ذخیره\x20ویرایش\x20های\x20محلی\x20خود\x20کلیک\x20کنید.",
    },
  },
};
function _0x2faf(_0x54a9cd, _0x4c5c7f) {
  _0x54a9cd = _0x54a9cd - 0x132;
  const _0x27d347 = _0x27d3();
  let _0x2faf16 = _0x27d347[_0x54a9cd];
  return _0x2faf16;
}
module[_0x562f47(0x140)] = e;
