function _0x47c6() {
  const _0x1c4534 = [
    "399856JEHaWB",
    "Ошибка\x20аутентификации",
    "Обнаружен\x20конфликт\x20между\x20локальной\x20копией\x20и\x20копией\x20на\x20сервере.\x20Сохраните\x20локальные\x20изменения,\x20так\x20как\x20они\x20будут\x20утеряны\x20при\x20обновлении\x20страницы.",
    "Конфликт\x20совместной\x20работы",
    "Вы\x20открыли\x20тот\x20же\x20файл\x20в\x20другой\x20вкладке.\x20Во\x20избежание\x20потери\x20данных\x20редактирование\x20в\x20этой\x20вкладке\x20будет\x20ограничено.",
    "60525VfiqJq",
    "Права\x20на\x20редактирование\x20были\x20отозваны,\x20так\x20как\x20комната\x20совместной\x20работы\x20была\x20закрыта.",
    "Нажмите\x20для\x20переподключения",
    "307296norpVS",
    "99715KDeOWn",
    "Синхронизация...",
    "21nUYCcz",
    "67152ruIagD",
    "Ошибка\x20подключения.\x20Проверьте\x20подключение\x20к\x20сети.",
    "Синхронизация\x20данных\x20сервера...",
    "Срок\x20действия\x20вашего\x20входа\x20истек.\x20Нажмите\x20ОК\x20для\x20повторного\x20входа\x20или\x20Отмена\x20для\x20сохранения\x20локальных\x20изменений.",
    "959328ZLDFBb",
    "Не\x20удалось\x20присоединиться\x20к\x20совместной\x20работе.\x20Повторите\x20попытку\x20позже.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
    "Офлайн,\x20изменения\x20будут\x20сохранены\x20локально",
    "Сервер\x20не\x20отвечает\x20на\x20запрос\x20совместной\x20работы.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
    "Количество\x20документов\x20для\x20совместной\x20работы\x20превышает\x20лимит.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
    "Ваши\x20действия\x20конфликтуют\x20с\x20разрешениями\x20сервера.\x20Сохраните\x20локальные\x20изменения\x20в\x20другом\x20месте,\x20так\x20как\x20они\x20будут\x20удалены\x20после\x20обновления\x20страницы.",
    "Конфликты\x20редактирования",
    "Не\x20удалось\x20присоединиться\x20к\x20совместной\x20работе.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
    "594600YUtznu",
  ];
  _0x47c6 = function () {
    return _0x1c4534;
  };
  return _0x47c6();
}
const _0x23a54a = _0xc5d8;
(function (_0x2a4d57, _0x2ca448) {
  const _0x185d20 = _0xc5d8,
    _0x5c6929 = _0x2a4d57();
  while (!![]) {
    try {
      const _0x4f4de7 =
        -parseInt(_0x185d20(0x18f)) / 0x1 +
        -parseInt(_0x185d20(0x18b)) / 0x2 +
        -parseInt(_0x185d20(0x188)) / 0x3 +
        parseInt(_0x185d20(0x193)) / 0x4 +
        -parseInt(_0x185d20(0x18c)) / 0x5 +
        parseInt(_0x185d20(0x19b)) / 0x6 +
        (parseInt(_0x185d20(0x18e)) / 0x7) * (parseInt(_0x185d20(0x183)) / 0x8);
      if (_0x4f4de7 === _0x2ca448) break;
      else _0x5c6929["push"](_0x5c6929["shift"]());
    } catch (_0x17c332) {
      _0x5c6929["push"](_0x5c6929["shift"]());
    }
  }
})(_0x47c6, 0x37a78);
function _0xc5d8(_0x3e8076, _0x330cd7) {
  _0x3e8076 = _0x3e8076 - 0x183;
  const _0x47c6f0 = _0x47c6();
  let _0xc5d839 = _0x47c6f0[_0x3e8076];
  return _0xc5d839;
}
const e = {
  "collaboration-client": {
    collabClient: { tooltip: { reconnect: _0x23a54a(0x18a) } },
    collabStatus: {
      fetchMiss: _0x23a54a(0x191),
      conflict: _0x23a54a(0x199),
      notCollab: "Локальный\x20файл",
      synced: "Синхронизировано",
      syncing: _0x23a54a(0x18d),
      offline: _0x23a54a(0x195),
    },
    session: {
      "connection-failed": _0x23a54a(0x190),
      "will-retry":
        "Ошибка\x20подключения.\x20Повторная\x20попытка\x20будет\x20выполнена\x20позже.",
      "room-full":
        "Документ\x20достиг\x20лимита\x20совместной\x20работы.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
      "join-failed": _0x23a54a(0x194),
      "room-not-exists": _0x23a54a(0x19a),
      "room-permission-denied":
        "Нет\x20разрешения\x20на\x20совместную\x20работу.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
      "room-cnt-exceeds": _0x23a54a(0x197),
      "collaboration-timeout": _0x23a54a(0x196),
    },
    conflict: { title: _0x23a54a(0x186), content: _0x23a54a(0x185) },
    permission: { title: _0x23a54a(0x184), content: _0x23a54a(0x198) },
    collaboration: {
      "single-unit": { warning: _0x23a54a(0x187) },
      closeRoom: _0x23a54a(0x189),
    },
    auth: { needGotoLoginAlert: _0x23a54a(0x192) },
  },
};
module["exports"] = e;
