const e = {
  "collaboration-client-ui": {
    collabClient: {
      tooltip: { reconnect: "برای\x20اتصال\x20مجدد\x20کلیک\x20کنید" },
    },
    collabStatus: {
      fetchMiss: "در\x20حال\x20همگام\x20سازی\x20داده\x20های\x20سرور...",
      conflict: "تداخل ویرایش",
      notCollab: "پرونده محلی",
      synced: "همگام\x20سازی",
      syncing: "در حال همگام سازی...",
      offline: "آفلاین، ویرایش ها در محلی ذخیره می شوند",
    },
    snapshotLoading: {
      timeout:
        "بارگیری\x20داده‌ها\x20در\x20{0}/{1}\x20متوقف\x20شده\x20است.\x20برای\x20تلاش\x20دوباره\x20صفحه\x20را\x20تازه‌سازی\x20کنید.",
      refresh: "تازه‌سازی\x20صفحه",
    },
    session: {
      "connection-failed":
        "اتصال\x20ناموفق\x20بود،\x20لطفا\x20شبکه\x20خود\x20را\x20بررسی\x20کنید.",
      "will-retry": "اتصال ناموفق بود، ما بعداً دوباره تلاش می کنیم.",
      "room-full":
        "اتاق همکاری پر است. شما ویرایش های خود را در محلی ذخیره خواهید کرد.",
      "collaboration-timeout":
        "سرور به درخواست همکاری شما پاسخ نمی دهد. ویرایش های شما در محلی ذخیره می شوند.",
    },
    conflict: {
      title: "تداخل همکاری",
      content:
        "یک تداخل بین نسخه محلی شما و نسخه در سرور وجود دارد. لطفاً ویرایش های محلی خود را ذخیره کنید، زیرا آنها پس از بازیابی صفحه از بین خواهند رفت.",
    },
    permission: {
      title: "خطای اعتبارسنجی",
      content:
        "اعمال شما با مجوزهای سرور تداخل دارد. لطفاً ویرایش های محلی خود را در جای دیگر ذخیره کنید زیرا پس از تازه سازی صفحه از بین خواهند رفت.",
    },
    collaboration: {
      "offline-data-not-saved":
        "شما ویرایش‌های آفلاین دارید که در سرور ذخیره نشده‌اند. لطفاً شبکه خود را بررسی کرده و دوباره تلاش کنید.",
      "single-unit": {
        warning:
          "شما همان پرونده را در یک تب دیگر باز کرده اید. در صورت عدم وجود داده، نمی توانید در این تب ویرایش کنید.",
      },
      closeRoom: "امتیازات ویرایش به دلیل بسته شدن اتاق همکاری لغو شد.",
    },
    auth: {
      needGotoLoginAlert:
        "ورود شما منقضی شده است، برای ورود مجدد کلیک کنید، برای ذخیره ویرایش های محلی خود کلیک کنید.",
    },
    formula: {
      calculation: {
        started: "محاسبه فرمول شروع شد.",
        waiting: "صف محاسبه فرمول پر است، در انتظار اسلات خالی...",
        unable:
          "در حال حاضر امکان انجام محاسبه فرمول وجود ندارد. لطفاً بعداً دوباره امتحان کنید.",
      },
    },
  },
};
export { e as default };
