const e = {
  "collaboration-client-ui": {
    collabClient: { tooltip: { reconnect: "انقر لإعادة الاتصال" } },
    collabStatus: {
      fetchMiss: "جارٍ مزامنة بيانات الخادم...",
      conflict: "تعارضات التحرير",
      notCollab: "ملف محلي",
      synced: "تمت المزامنة",
      syncing: "جارٍ\x20المزامنة...",
      offline: "غير متصل، سيتم حفظ التعديلات محليًا",
    },
    snapshotLoading: {
      timeout:
        "توقف\x20تحميل\x20البيانات\x20عند\x20{0}/{1}.\x20حدّث\x20الصفحة\x20للمحاولة\x20مرة\x20أخرى.",
      refresh: "تحديث الصفحة",
    },
    session: {
      "connection-failed": "فشل\x20الاتصال،\x20يرجى\x20التحقق\x20من\x20شبكتك.",
      "will-retry": "فشل\x20الاتصال،\x20سنعيد\x20المحاولة\x20بعد\x20قليل.",
      "room-full": "غرفة التعاون ممتلئة. سيتم حفظ تعديلاتك محليًا.",
      "collaboration-timeout":
        "الخادم لا يستجيب لطلب التعاون الخاص بك. سيتم حفظ تعديلاتك محليًا.",
    },
    conflict: {
      title: "تعارض في التعاون",
      content:
        "هناك تعارض بين نسختك المحلية والنسخة على الخادم. يرجى حفظ تعديلاتك المحلية، لأنها ستُفقد عند إعادة تحميل الصفحة.",
    },
    permission: {
      title: "خطأ في المصادقة",
      content:
        "إجراءاتك تتعارض مع أذونات الخادم. يرجى حفظ تعديلاتك المحلية في مكان آخر حيث سيتم تجاهلها بعد تحديث الصفحة.",
    },
    collaboration: {
      "offline-data-not-saved":
        "لديك\x20تعديلات\x20غير\x20متصلة\x20لم\x20يتم\x20حفظها\x20على\x20الخادم.\x20يرجى\x20التحقق\x20من\x20شبكتك\x20والمحاولة\x20مرة\x20أخرى.",
      "single-unit": {
        warning:
          "فتحت نفس الملف في علامة تبويب أخرى. في حالة فقدان البيانات، لا يمكنك التحرير في علامة التبويب هذه.",
      },
      closeRoom: "تم إلغاء امتيازات التحرير لأنه تم إغلاق غرفة التعاون.",
    },
    auth: {
      needGotoLoginAlert:
        "انتهت\x20صلاحية\x20تسجيل\x20الدخول\x20الخاص\x20بك،\x20انقر\x20فوق\x20موافق\x20لإعادة\x20تسجيل\x20الدخول،\x20وانقر\x20فوق\x20إلغاء\x20لحفظ\x20تعديلاتك\x20المحلية.",
    },
    formula: {
      calculation: {
        started: "بدأ حساب الصيغة.",
        waiting: "قائمة انتظار حساب الصيغة ممتلئة، في انتظار خانة متاحة...",
        unable:
          "غير قادر على إجراء حساب الصيغة في هذا الوقت. يرجى المحاولة مرة أخرى لاحقًا.",
      },
    },
  },
};
module.exports = e;
