const e = {
  "collaboration-client-ui": {
    collabClient: {
      tooltip: {
        reconnect: "برای\x20اتصال\x20مجدد\x20کلیک\x20کنید"
      }
    },
    collabStatus: {
      fetchMiss: "در حال همگام سازی داده های سرور...",
      conflict: "تداخل ویرایش",
      notCollab: "پرونده محلی",
      synced: "همگام سازی",
      syncing: "در\x20حال\x20همگام\x20سازی...",
      offline: "آفلاین، ویرایش ها در محلی ذخیره می شوند"
    },
    snapshotLoading: {
      timeout: "بارگیری داده‌ها در {0}/{1} متوقف شده است. برای تلاش دوباره صفحه را تازه‌سازی کنید.",
      refresh: "تازه‌سازی صفحه"
    },
    session: {
      "connection-failed": "اتصال ناموفق بود، لطفا شبکه خود را بررسی کنید.",
      "will-retry": "اتصال ناموفق بود، ما بعداً دوباره تلاش می کنیم.",
      "room-full": "اتاق\x20همکاری\x20پر\x20است.\x20شما\x20ویرایش\x20های\x20خود\x20را\x20در\x20محلی\x20ذخیره\x20خواهید\x20کرد.",
      "collaboration-timeout": "سرور به درخواست همکاری شما پاسخ نمی دهد. ویرایش های شما در محلی ذخیره می شوند."
    },
    conflict: {
      title: "تداخل همکاری",
      content: "یک\x20تداخل\x20بین\x20نسخه\x20محلی\x20شما\x20و\x20نسخه\x20در\x20سرور\x20وجود\x20دارد.\x20لطفاً\x20ویرایش\x20های\x20محلی\x20خود\x20را\x20ذخیره\x20کنید،\x20زیرا\x20آنها\x20پس\x20از\x20بازیابی\x20صفحه\x20از\x20بین\x20خواهند\x20رفت."
    },
    permission: {
      title: "خطای اعتبارسنجی",
      content: "اعمال شما با مجوزهای سرور تداخل دارد. لطفاً ویرایش های محلی خود را در جای دیگر ذخیره کنید زیرا پس از تازه سازی صفحه از بین خواهند رفت."
    },
    collaboration: {
      "offline-data-not-saved": "شما ویرایش‌های آفلاین دارید که در سرور ذخیره نشده‌اند. لطفاً شبکه خود را بررسی کرده و دوباره تلاش کنید.",
      "single-unit": {
        warning: "شما\x20همان\x20پرونده\x20را\x20در\x20یک\x20تب\x20دیگر\x20باز\x20کرده\x20اید.\x20در\x20صورت\x20عدم\x20وجود\x20داده،\x20نمی\x20توانید\x20در\x20این\x20تب\x20ویرایش\x20کنید."
      },
      closeRoom: "امتیازات ویرایش به دلیل بسته شدن اتاق همکاری لغو شد."
    },
    auth: {
      needGotoLoginAlert: "ورود\x20شما\x20منقضی\x20شده\x20است،\x20برای\x20ورود\x20مجدد\x20کلیک\x20کنید،\x20برای\x20ذخیره\x20ویرایش\x20های\x20محلی\x20خود\x20کلیک\x20کنید."
    },
    formula: {
      calculation: {
        started: "محاسبه فرمول شروع شد.",
        waiting: "صف محاسبه فرمول پر است، در انتظار اسلات خالی...",
        unable: "در حال حاضر امکان انجام محاسبه فرمول وجود ندارد. لطفاً بعداً دوباره امتحان کنید."
      }
    }
  }
};
module.exports = e;
