function _0x1316(_0x55d539, _0x57a14d) {
  _0x55d539 = _0x55d539 - 0x197;
  const _0x2fc96e = _0x2fc9();
  let _0x13169d = _0x2fc96e[_0x55d539];
  return _0x13169d;
}
const _0x253cea = _0x1316;
function _0x2fc9() {
  const _0x57b6a7 = [
    "146072dhZDgl",
    "242820PYiMSf",
    "32120973SRDOGs",
    "Локальный\x20файл",
    "Ваши\x20действия\x20конфликтуют\x20с\x20разрешениями\x20сервера.\x20Сохраните\x20локальные\x20изменения\x20в\x20другом\x20месте,\x20так\x20как\x20они\x20будут\x20удалены\x20после\x20обновления\x20страницы.",
    "Конфликт\x20совместной\x20работы",
    "Синхронизация...",
    "5508232lQaRVe",
    "Начато\x20вычисление\x20формул.",
    "Синхронизация\x20данных\x20сервера...",
    "Сервер\x20не\x20отвечает\x20на\x20запрос\x20совместной\x20работы.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
    "175zThHZW",
    "Права\x20на\x20редактирование\x20были\x20отозваны,\x20так\x20как\x20комната\x20совместной\x20работы\x20была\x20закрыта.",
    "Синхронизировано",
    "792504SfnMlC",
    "Конфликты\x20редактирования",
    "Обнаружен\x20конфликт\x20между\x20локальной\x20копией\x20и\x20копией\x20на\x20сервере.\x20Сохраните\x20локальные\x20изменения,\x20так\x20как\x20они\x20будут\x20утеряны\x20при\x20обновлении\x20страницы.",
    "В\x20настоящее\x20время\x20невозможно\x20выполнить\x20вычисление\x20формул.\x20Повторите\x20попытку\x20позже.",
    "Очередь\x20вычисления\x20формул\x20заполнена,\x20ожидание\x20свободного\x20слота...",
    "384918OTPSux",
    "Комната\x20совместной\x20работы\x20заполнена.\x20Ваши\x20изменения\x20будут\x20сохранены\x20локально.",
    "Ошибка\x20подключения,\x20повторная\x20попытка\x20будет\x20выполнена\x20позже.",
    "Вы\x20открыли\x20тот\x20же\x20файл\x20в\x20другой\x20вкладке.\x20Во\x20избежание\x20потери\x20данных\x20редактирование\x20в\x20этой\x20вкладке\x20будет\x20ограничено.",
    "Офлайн,\x20изменения\x20будут\x20сохранены\x20локально",
    "1713025YMXFCL",
    "Нажмите\x20для\x20переподключения",
    "15yqPzXY",
  ];
  _0x2fc9 = function () {
    return _0x57b6a7;
  };
  return _0x2fc9();
}
(function (_0x2694ce, _0x3e6a38) {
  const _0x239615 = _0x1316,
    _0xed5439 = _0x2694ce();
  while (!![]) {
    try {
      const _0x4c6fc5 =
        -parseInt(_0x239615(0x1af)) / 0x1 +
        parseInt(_0x239615(0x1a2)) / 0x2 +
        (parseInt(_0x239615(0x1ae)) / 0x3) *
          (-parseInt(_0x239615(0x1b0)) / 0x4) +
        -parseInt(_0x239615(0x1ac)) / 0x5 +
        (-parseInt(_0x239615(0x1a7)) / 0x6) *
          (parseInt(_0x239615(0x19f)) / 0x7) +
        -parseInt(_0x239615(0x19b)) / 0x8 +
        parseInt(_0x239615(0x1b1)) / 0x9;
      if (_0x4c6fc5 === _0x3e6a38) break;
      else _0xed5439["push"](_0xed5439["shift"]());
    } catch (_0x995b9e) {
      _0xed5439["push"](_0xed5439["shift"]());
    }
  }
})(_0x2fc9, 0xd7035);
const e = {
  "collaboration-client-ui": {
    collabClient: { tooltip: { reconnect: _0x253cea(0x1ad) } },
    collabStatus: {
      fetchMiss: _0x253cea(0x19d),
      conflict: _0x253cea(0x1a3),
      notCollab: _0x253cea(0x197),
      synced: _0x253cea(0x1a1),
      syncing: _0x253cea(0x19a),
      offline: _0x253cea(0x1ab),
    },
    snapshotLoading: {
      timeout:
        "Загрузка\x20данных\x20остановилась\x20на\x20{0}/{1}.\x20Обновите\x20страницу\x20и\x20повторите\x20попытку.",
      refresh: "Обновить\x20страницу",
    },
    session: {
      "connection-failed":
        "Ошибка\x20подключения,\x20проверьте\x20подключение\x20к\x20сети.",
      "will-retry": _0x253cea(0x1a9),
      "room-full": _0x253cea(0x1a8),
      "collaboration-timeout": _0x253cea(0x19e),
    },
    conflict: { title: _0x253cea(0x199), content: _0x253cea(0x1a4) },
    permission: {
      title: "Ошибка\x20аутентификации",
      content: _0x253cea(0x198),
    },
    collaboration: {
      "offline-data-not-saved":
        "У\x20вас\x20есть\x20несохраненные\x20офлайн-изменения.\x20Проверьте\x20подключение\x20к\x20сети\x20и\x20повторите\x20попытку.",
      "single-unit": { warning: _0x253cea(0x1aa) },
      closeRoom: _0x253cea(0x1a0),
    },
    auth: {
      needGotoLoginAlert:
        "Срок\x20действия\x20вашего\x20входа\x20истек.\x20Нажмите\x20ОК\x20для\x20повторного\x20входа\x20или\x20Отмена\x20для\x20сохранения\x20локальных\x20изменений.",
    },
    formula: {
      calculation: {
        started: _0x253cea(0x19c),
        waiting: _0x253cea(0x1a6),
        unable: _0x253cea(0x1a5),
      },
    },
  },
};
module["exports"] = e;
